holographicSol/SatIO_ESPIDF_Waveshare_ESP32-P4_Round_Display/satio_lvgl.cpp
        case KB_MATRIX_OUTPUT_PWM_1:
            if (strval_validate(ctx->strval_type, input)) {
                uint32_t val = strtoul(input, NULL, 10);
                printf("[keyboard_event_cb] Setting MATRIX_OUTPUT_PWM_1 to: %lu\n", val);
                // lv_textarea_set_text(...); // Update relevant object if needed
                matrixData.output_pwm[0][current_matrix_i][INDEX_MATRIX_SWITCH_PWM_ON] = val;
                matrixData.matrix_switch_write_required[0][current_matrix_i]=true;
            }
            else {
                printf("[keyboard_event_cb] Input is not a valid uint32_t: %s\n", input);
            }
            break;
        
        case KB_MATRIX_PORT_MAP:
            if (strval_validate(ctx->strval_type, input)) {
                int16_t val = atoi(input);
                printf("[keyboard_event_cb] Setting MATRIX_PORT_MAP to: %d\n", val);
                // lv_textarea_set_text(...); // Update relevant object if needed
                matrixData.matrix_port_map[0][current_matrix_i] = val;
                matrixData.matrix_switch_write_required[0][current_matrix_i]=true;
            }
            else {
                printf("[keyboard_event_cb] Input is not a valid int8_t: %s\n", input);
            }
            break;
        
        case KB_MAPPING_C1:
            if (strval_validate(ctx->strval_type, input)) {
                int32_t val = strtol(input, NULL, 10);
                printf("[keyboard_event_cb] Setting KB_MAPPING_C1 to: %ld\n", val);
                // lv_textarea_set_text(...); // Update relevant object if needed
                mappingData.mapping_config[0][matrixData.index_mapped_value[0][current_matrix_i]][INDEX_MAP_C1] = val;
                matrixData.matrix_switch_write_required[0][current_matrix_i]=true;
            }
            else {
                printf("[keyboard_event_cb] Input is not a valid int32_t: %s\n", input);
            }
            break;
        
        case KB_MAPPING_C2:
            if (strval_validate(ctx->strval_type, input)) {
                int32_t val = strtol(input, NULL, 10);
                printf("[keyboard_event_cb] Setting KB_MAPPING_C2 to: %ld\n", val);
                // lv_textarea_set_text(...); // Update relevant object if needed
                mappingData.mapping_config[0][matrixData.index_mapped_value[0][current_matrix_i]][INDEX_MAP_C2] = val;
                matrixData.matrix_switch_write_required[0][current_matrix_i]=true;
            }
            else {
                printf("[keyboard_event_cb] Input is not a valid int32_t: %s\n", input);
            }
            break;

        case KB_MAPPING_C3:
            if (strval_validate(ctx->strval_type, input)) {
                int32_t val = strtol(input, NULL, 10);
                printf("[keyboard_event_cb] Setting KB_MAPPING_C3 to: %ld\n", val);
                // lv_textarea_set_text(...); // Update relevant object if needed
                mappingData.mapping_config[0][matrixData.index_mapped_value[0][current_matrix_i]][INDEX_MAP_C3] = val;
                matrixData.matrix_switch_write_required[0][current_matrix_i]=true;
            }
            else {
                printf("[keyboard_event_cb] Input is not a valid int32_t: %s\n", input);
            }
            break;

        case KB_MAPPING_C4:
            if (strval_validate(ctx->strval_type, input)) {
                int32_t val = strtol(input, NULL, 10);
                printf("[keyboard_event_cb] Setting KB_MAPPING_C4 to: %ld\n", val);
                // lv_textarea_set_text(...); // Update relevant object if needed
                mappingData.mapping_config[0][matrixData.index_mapped_value[0][current_matrix_i]][INDEX_MAP_C4] = val;
                matrixData.matrix_switch_write_required[0][current_matrix_i]=true;
            }
            else {
                printf("[keyboard_event_cb] Input is not a valid int32_t: %s\n", input);
            }
            break;

        case KB_MAPPING_C5:
            if (strval_validate(ctx->strval_type, input)) {
                int32_t val = strtol(input, NULL, 10);
                printf("[keyboard_event_cb] Setting KB_MAPPING_C5 to: %ld\n", val);
                // lv_textarea_set_text(...); // Update relevant object if needed
                mappingData.mapping_config[0][matrixData.index_mapped_value[0][current_matrix_i]][INDEX_MAP_C5] = val;
                matrixData.matrix_switch_write_required[0][current_matrix_i]=true;
            }
            else {
                printf("[keyboard_event_cb] Input is not a valid int32_t: %s\n", input);
            }
            break;

        case KB_USER_LATITUDE:
            if (strval_validate(ctx->strval_type, input)) {
                double val = strtod(input, NULL);
                printf("[keyboard_event_cb] Setting KB_USER_LATITUDE to: %f\n", val);
                // lv_textarea_set_text(...); // Update relevant object if needed
                satioData.user_degrees_latitude = val;
            }
            else {
                printf("[keyboard_event_cb] Input is not a valid double: %s\n", input);
            }
            break;

        case KB_USER_LONGITUDE:
            if (strval_validate(ctx->strval_type, input)) {
                double val = strtod(input, NULL);
                printf("[keyboard_event_cb] Setting KB_USER_LONGITUDE to: %f\n", val);
                // lv_textarea_set_text(...); // Update relevant object if needed
                satioData.user_degrees_longitude = val;
            }
            else {
                printf("[keyboard_event_cb] Input is not a valid double: %s\n", input);
            }
            break;

        case KB_USER_ALTITUDE:
            if (strval_validate(ctx->strval_type, input)) {
                double val = strtod(input, NULL);
                printf("[keyboard_event_cb] Setting KB_USER_ALTITUDE to: %f\n", val);
                // lv_textarea_set_text(...); // Update relevant object if needed
                satioData.user_altitude = val;
            }
            else {
                printf("[keyboard_event_cb] Input is not a valid double: %s\n", input);
            }
            break;

        case KB_USER_SPEED:
            if (strval_validate(ctx->strval_type, input)) {
                double val = strtod(input, NULL);
                printf("[keyboard_event_cb] Setting KB_USER_SPEED to: %f\n", val);
                // lv_textarea_set_text(...); // Update relevant object if needed
                satioData.user_speed= val;
            }
            else {
                printf("[keyboard_event_cb] Input is not a valid double: %s\n", input);
            }
            break;

        case KB_USER_GROUND_HEADING:
            if (strval_validate(ctx->strval_type, input)) {
                double val = strtod(input, NULL);
                printf("[keyboard_event_cb] Setting KB_USER_GROUND_HEADING to: %f\n", val);
                // lv_textarea_set_text(...); // Update relevant object if needed
                satioData.user_ground_heading= val;
            }
            else {
                printf("[keyboard_event_cb] Input is not a valid double: %s\n", input);
            }
            break;

        case KB_UTC_OFFSET_SECONDS:
            if (strval_validate(ctx->strval_type, input)) {
                int64_t val = atoll(input);
                printf("[keyboard_event_cb] Setting KB_UTC_OFFSET_SECONDS to: %lld\n", val);
                // lv_textarea_set_text(...); // Update relevant object if needed
                satioData.utc_second_offset = val;
            }
            else {
                printf("[keyboard_event_cb] Input is not a valid int64_t: %s\n", input);
            }
            break;
        
