holographicSol/SatIO_ESPIDF_Waveshare_ESP32-P4_Round_Display/satio_lvgl.cpp
    if(code == LV_EVENT_CLICKED) {
        printf("[matrix_new_event_cb] Setting new matrix.\n");
        override_all_computer_assists();
        set_all_matrix_default();
    }
}

/** -------------------------------------------------------------------------------------
 * @brief Event callback.
 * 
 * @param e Pointer to the LVGL event structure.
 */
static void matrix_save_event_cb(lv_event_t * e)
{
    lv_event_code_t code = lv_event_get_code(e);
    if
    (
        code == LV_EVENT_CLICKED ||
        code == LV_EVENT_PRESSED ||
        code == LV_EVENT_RELEASED
    ) {printf("[matrix_save_event_cb] event code: %d\n", code);}

    if(code == LV_EVENT_CLICKED) {
        if (sdcardData.sdcard_mounted==true) {
            printf("[matrix_save_event_cb] Saving matrix to slot: %s\n", satioFileData.current_matrix_filepath);
            sdcardFlagData.save_matrix=true;
            vTaskDelay(1000 / portTICK_PERIOD_MS);
            sdcardFlagData.save_mapping=true;
        }
        else {
            printf("[matrix_save_event_cb] sdcard is not mounted.");
        }
    }
}

/** -------------------------------------------------------------------------------------
 * @brief Event callback.
 * 
 * @param e Pointer to the LVGL event structure.
 */
static void matrix_load_event_cb(lv_event_t * e)
{
    lv_event_code_t code = lv_event_get_code(e);
    if
    (
        code == LV_EVENT_CLICKED ||
        code == LV_EVENT_PRESSED ||
        code == LV_EVENT_RELEASED
    ) {printf("[matrix_load_event_cb] event code: %d\n", code);}

    if(code == LV_EVENT_CLICKED) {
        if (sdcardData.sdcard_mounted==true) {
            printf("[matrix_load_event_cb] Loading matrix from slot: %s\n", satioFileData.current_matrix_filepath);
            sdcardFlagData.load_mapping=true;
            vTaskDelay(1000 / portTICK_PERIOD_MS);
            sdcardFlagData.load_matrix=true;
        }
        else {
            printf("[matrix_load_event_cb] sdcard is not mounted.");
        }
    }
}

/** -------------------------------------------------------------------------------------
 * @brief Event callback.
 * 
 * @param e Pointer to the LVGL event structure.
 */
static void matrix_delete_event_cb(lv_event_t * e)
{
    lv_event_code_t code = lv_event_get_code(e);
    if
    (
        code == LV_EVENT_CLICKED ||
        code == LV_EVENT_PRESSED ||
        code == LV_EVENT_RELEASED
    ) {printf("[matrix_delete_event_cb] event code: %d\n", code);}

    if(code == LV_EVENT_CLICKED) {
        if (sdcardData.sdcard_mounted==true) {
            printf("[matrix_delete_event_cb] Deleting matrix in slot: %s\n", satioFileData.current_matrix_filepath);
            sdcardFlagData.delete_matrix=true;
        }
        else {
            printf("[matrix_delete_event_cb] sdcard is not mounted.");
        }
    }
}

/** -------------------------------------------------------------------------------------
 * @brief Event callback.
 * 
 * @param e Pointer to the LVGL event structure.
 */
static void current_matrix_computer_assist_event_cb(lv_event_t * e)
{
    lv_event_code_t code = lv_event_get_code(e);
    if
    (
        code == LV_EVENT_CLICKED ||
        code == LV_EVENT_PRESSED ||
        code == LV_EVENT_RELEASED
    ) {printf("[current_matrix_computer_assist_event_cb] event code: %d\n", code);}

    if(code == LV_EVENT_CLICKED) {
        bool toggle = !matrixData.computer_assist[0][current_matrix_i];
        matrixData.computer_assist[0][current_matrix_i] = toggle;
        printf("[current_matrix_computer_assist_event_cb] Setting computer assist for matrix switch %d to: %s\n", current_matrix_i, toggle ? "true" : "false");
    }
}

/** -------------------------------------------------------------------------------------
 * @brief Event callback.
 * 
 * @param e Pointer to the LVGL event structure.
 */
static void switch_matrix_mapping_panel_event_cb(lv_event_t * e)
{
    lv_event_code_t code = lv_event_get_code(e);
    if
    (
        code == LV_EVENT_CLICKED ||
        code == LV_EVENT_PRESSED ||
        code == LV_EVENT_RELEASED
    ) {printf("[switch_matrix_mapping_panel_event_cb] event code: %d\n", code);}

    if(code == LV_EVENT_CLICKED) {
        current_matrix_panel_view+=1;
        if (current_matrix_panel_view>=MAX_MATRIX_PANEL_VIEWS) {current_matrix_panel_view=0;}
        printf("[switch_matrix_mapping_panel_event_cb] Switching matrix panel view: %d\n", current_matrix_panel_view);
    }
}

/** -------------------------------------------------------------------------------------
 * @brief Event callback.
 * 
 * @param e Pointer to the LVGL event structure.
 */
static void switch_gps_panel_event_cb(lv_event_t * e)
{
    lv_event_code_t code = lv_event_get_code(e);
    if
    (
        code == LV_EVENT_CLICKED ||
        code == LV_EVENT_PRESSED ||
        code == LV_EVENT_RELEASED
    ) {printf("[switch_gps_panel_event_cb] event code: %d\n", code);}

    if(code == LV_EVENT_CLICKED) {
        current_gps_panel+=1;
        if (current_gps_panel>=MAX_GPS_PANEL_VIEWS) {current_gps_panel=0;}
        printf("[switch_gps_panel_event_cb] Switching GPS panel view: %d\n", current_gps_panel);
    }
}

/** -------------------------------------------------------------------------------------
 * @brief Event callback.
 * 
 * @param e Pointer to the LVGL event structure.
 */
static void current_matrix_override_off_event_cb(lv_event_t * e)
{
    lv_event_code_t code = lv_event_get_code(e);
    if
    (
        code == LV_EVENT_CLICKED ||
        code == LV_EVENT_PRESSED ||
        code == LV_EVENT_RELEASED
    ) {printf("[current_matrix_override_off_event_cb] event code: %d\n", code);}

    if(code == LV_EVENT_CLICKED) {
        printf("[current_matrix_override_off_event_cb] OVERRIDING matrix switch %d\n", current_matrix_i);
        setOverrideOutputValue((int)current_matrix_i, (uint32_t)0);
    }
}

/** ---------------------------------------------------------------------------------------
 * Title Bar
 */
title_bar_t create_title_bar (
    lv_obj_t * scr,
    int32_t size_w_px,
    int32_t size_h_px,
    lv_align_t alignment,
    int32_t pos_x,
    int32_t pos_y,
    bool show_scrollbar,
    bool enable_scrolling
    )
{
    // Initialize struct
    title_bar_t title_bar = {0};
    
    // Create title bar
    title_bar.panel = lv_obj_create(scr);

    // Show scrollbar
    if (show_scrollbar) {lv_obj_set_scrollbar_mode(title_bar.panel, LV_SCROLLBAR_MODE_AUTO);}
    else {lv_obj_set_scrollbar_mode(title_bar.panel, LV_SCROLLBAR_MODE_OFF);}

    // Enable scrolling
    if (enable_scrolling) {lv_obj_set_scroll_dir(title_bar.panel, LV_DIR_ALL);}
    else {lv_obj_set_scroll_dir(title_bar.panel, LV_DIR_NONE);}

    // Size and position
    lv_obj_set_size(title_bar.panel, size_w_px, size_h_px);
    lv_obj_align(title_bar.panel, alignment, pos_x, pos_y);

