holographicSol/SatIO_ESPIDF_Waveshare_ESP32-P4_Round_Display/satio_lvgl.cpp
    lv_obj_t * row_0 = lv_obj_create(result.panel);
    lv_obj_set_size(row_0, LV_PCT(100), row_height);
    lv_obj_set_flex_flow(row_0, LV_FLEX_FLOW_ROW);
    lv_obj_set_style_pad_all(row_0, 0, LV_PART_MAIN);
    lv_obj_set_style_bg_opa(row_0, LV_OPA_TRANSP, LV_PART_MAIN);
    lv_obj_set_style_border_width(row_0, 0, LV_PART_MAIN);
    lv_obj_set_style_pad_column(row_0, padding, LV_PART_MAIN);

    // Critical for alignment
    lv_obj_set_flex_align(
        row_0,
        LV_FLEX_ALIGN_START,   // main axis (left‑right)
        LV_FLEX_ALIGN_CENTER,  // cross axis (top‑bottom)
        LV_FLEX_ALIGN_CENTER   // track alignment
    );

    // Show scrollbar
    if (show_scrollbar) {lv_obj_set_scrollbar_mode(row_0, LV_SCROLLBAR_MODE_AUTO);}
    else {lv_obj_set_scrollbar_mode(row_0, LV_SCROLLBAR_MODE_OFF);}

    // Enable scrolling
    if (enable_scrolling) {lv_obj_set_scroll_dir(row_0, LV_DIR_ALL);}
    else {lv_obj_set_scroll_dir(row_0, LV_DIR_NONE);}

    // Row Object Widths
    label_width_0 = 200;
    value_width_0 = ((width_px) - label_width_0) - padding*4;

    // Label 
    result.lbl_utc_time = create_label(
        row_0,                // parent
        label_width_0,        // width
        obj_height,           // height
        LV_ALIGN_CENTER,      // parent alignment
        0,                    // pos x
        0,                    // pos y
        "UTC Time",                // initial text
        LV_TEXT_ALIGN_LEFT,   // font alignment
        &cobalt_alien_17,     // font
        false,                // transparent background
        false,                // show scrollbar
        false,                // enable scrolling
        2,                    // outline width
        general_radius,       // outline radius
        1
    );
    
    // Value
    result.val_utc_time = create_label(
        row_0,                // parent
        label_width_0,        // width
        obj_height,           // height
        LV_ALIGN_CENTER,      // parent alignment
        0,                    // pos x
        0,                    // pos y
        "",                // initial text
        LV_TEXT_ALIGN_CENTER,   // font alignment
        &cobalt_alien_17,     // font
        false,                // transparent background
        false,                // show scrollbar
        false,                // enable scrolling
        2,                    // outline width
        general_radius,       // outline radius
        1
    );

    // Critical for alignment
    lv_obj_set_size(result.lbl_utc_time, label_width_0, obj_height);
    lv_obj_set_size(result.val_utc_time, value_width_0, obj_height);

    /* ---------------------------------------------------------- */

    lv_obj_t * row_1 = lv_obj_create(result.panel);
    lv_obj_set_size(row_1, LV_PCT(100), row_height);
    lv_obj_set_flex_flow(row_1, LV_FLEX_FLOW_ROW);
    lv_obj_set_style_pad_all(row_1, 0, LV_PART_MAIN);
    lv_obj_set_style_bg_opa(row_1, LV_OPA_TRANSP, LV_PART_MAIN);
    lv_obj_set_style_border_width(row_1, 0, LV_PART_MAIN);
    lv_obj_set_style_pad_column(row_1, padding, LV_PART_MAIN);

    // Critical for alignment
    lv_obj_set_flex_align(
        row_1,
        LV_FLEX_ALIGN_START,   // main axis (left‑right)
        LV_FLEX_ALIGN_CENTER,  // cross axis (top‑bottom)
        LV_FLEX_ALIGN_CENTER   // track alignment
    );

    // Show scrollbar
    if (show_scrollbar) {lv_obj_set_scrollbar_mode(row_1, LV_SCROLLBAR_MODE_AUTO);}
    else {lv_obj_set_scrollbar_mode(row_1, LV_SCROLLBAR_MODE_OFF);}

    // Enable scrolling
    if (enable_scrolling) {lv_obj_set_scroll_dir(row_1, LV_DIR_ALL);}
    else {lv_obj_set_scroll_dir(row_1, LV_DIR_NONE);}

    // Row Object Widths
    label_width_0 = 200;
    value_width_0 = ((width_px) - label_width_0) - padding*4;

    // Label 
    result.lbl_latitude = create_label(
        row_1,                // parent
        label_width_0,        // width
        obj_height,           // height
        LV_ALIGN_CENTER,      // parent alignment
        0,                    // pos x
        0,                    // pos y
        "Latitude",           // initial text
        LV_TEXT_ALIGN_LEFT,   // font alignment
        &cobalt_alien_17,     // font
        false,                // transparent background
        false,                // show scrollbar
        false,                // enable scrolling
        2,                    // outline width
        general_radius,       // outline radius
        1
    );
    
    // Value
    result.val_latitude = create_label(
        row_1,                // parent
        label_width_0,        // width
        obj_height,           // height
        LV_ALIGN_CENTER,      // parent alignment
        0,                    // pos x
        0,                    // pos y
        "",                   // initial text
        LV_TEXT_ALIGN_CENTER, // font alignment
        &cobalt_alien_17,     // font
        false,                // transparent background
        false,                // show scrollbar
        false,                // enable scrolling
        2,                    // outline width
        general_radius,       // outline radius
        1
    );

    // Critical for alignment
    lv_obj_set_size(result.lbl_latitude, label_width_0, obj_height);
    lv_obj_set_size(result.val_latitude, value_width_0, obj_height);

    /* ---------------------------------------------------------- */

    lv_obj_t * row_2 = lv_obj_create(result.panel);
    lv_obj_set_size(row_2, LV_PCT(100), row_height);
    lv_obj_set_flex_flow(row_2, LV_FLEX_FLOW_ROW);
    lv_obj_set_style_pad_all(row_2, 0, LV_PART_MAIN);
    lv_obj_set_style_bg_opa(row_2, LV_OPA_TRANSP, LV_PART_MAIN);
    lv_obj_set_style_border_width(row_2, 0, LV_PART_MAIN);
    lv_obj_set_style_pad_column(row_2, padding, LV_PART_MAIN);

    // Critical for alignment
    lv_obj_set_flex_align(
        row_2,
        LV_FLEX_ALIGN_START,   // main axis (left‑right)
        LV_FLEX_ALIGN_CENTER,  // cross axis (top‑bottom)
        LV_FLEX_ALIGN_CENTER   // track alignment
    );

    // Show scrollbar
    if (show_scrollbar) {lv_obj_set_scrollbar_mode(row_2, LV_SCROLLBAR_MODE_AUTO);}
    else {lv_obj_set_scrollbar_mode(row_2, LV_SCROLLBAR_MODE_OFF);}

    // Enable scrolling
    if (enable_scrolling) {lv_obj_set_scroll_dir(row_2, LV_DIR_ALL);}
    else {lv_obj_set_scroll_dir(row_2, LV_DIR_NONE);}

