holographicSol/SatIO_ESPIDF_Waveshare_ESP32-P4_Round_Display/satio_lvgl.cpp
    // Row Object Widths
    label_width_0 = 200;
    value_width_0 = ((width_px) - label_width_0) - padding*4;

    // Label 
    result.lbl_longitude = create_label(
        row_2,                // parent
        label_width_0,        // width
        obj_height,           // height
        LV_ALIGN_CENTER,      // parent alignment
        0,                    // pos x
        0,                    // pos y
        "Longitude",          // initial text
        LV_TEXT_ALIGN_LEFT,   // font alignment
        &cobalt_alien_17,     // font
        false,                // transparent background
        false,                // show scrollbar
        false,                // enable scrolling
        2,                    // outline width
        general_radius,       // outline radius
        1
    );
    
    // Value
    result.val_longitude = create_label(
        row_2,                // parent
        value_width_0,        // width
        obj_height,           // height
        LV_ALIGN_CENTER,      // parent alignment
        0,                    // pos x
        0,                    // pos y
        "",                   // initial text
        LV_TEXT_ALIGN_CENTER, // font alignment
        &cobalt_alien_17,     // font
        false,                // transparent background
        false,                // show scrollbar
        false,                // enable scrolling
        2,                    // outline width
        general_radius,       // outline radius
        1
    );

    // Critical for alignment
    lv_obj_set_size(result.lbl_latitude, label_width_0, obj_height);
    lv_obj_set_size(result.val_latitude, value_width_0, obj_height);

    /* ---------------------------------------------------------- */

    lv_obj_t * row_3 = lv_obj_create(result.panel);
    lv_obj_set_size(row_3, LV_PCT(100), row_height);
    lv_obj_set_flex_flow(row_3, LV_FLEX_FLOW_ROW);
    lv_obj_set_style_pad_all(row_3, 0, LV_PART_MAIN);
    lv_obj_set_style_bg_opa(row_3, LV_OPA_TRANSP, LV_PART_MAIN);
    lv_obj_set_style_border_width(row_3, 0, LV_PART_MAIN);
    lv_obj_set_style_pad_column(row_3, padding, LV_PART_MAIN);

    // Critical for alignment
    lv_obj_set_flex_align(
        row_3,
        LV_FLEX_ALIGN_START,   // main axis (left‑right)
        LV_FLEX_ALIGN_CENTER,  // cross axis (top‑bottom)
        LV_FLEX_ALIGN_CENTER   // track alignment
    );

    // Show scrollbar
    if (show_scrollbar) {lv_obj_set_scrollbar_mode(row_3, LV_SCROLLBAR_MODE_AUTO);}
    else {lv_obj_set_scrollbar_mode(row_3, LV_SCROLLBAR_MODE_OFF);}

    // Enable scrolling
    if (enable_scrolling) {lv_obj_set_scroll_dir(row_3, LV_DIR_ALL);}
    else {lv_obj_set_scroll_dir(row_3, LV_DIR_NONE);}

    // Row Object Widths
    label_width_0 = 200;
    value_width_0 = ((width_px) - label_width_0) - padding*4;

    // Label 
    result.lbl_solution_status = create_label(
        row_3,                // parent
        label_width_0,        // width
        obj_height,           // height
        LV_ALIGN_CENTER,      // parent alignment
        0,                    // pos x
        0,                    // pos y
        "Solution Status",    // initial text
        LV_TEXT_ALIGN_LEFT,   // font alignment
        &cobalt_alien_17,     // font
        false,                // transparent background
        false,                // show scrollbar
        false,                // enable scrolling
        2,                    // outline width
        general_radius,       // outline radius
        1
    );
    
    // Value
    result.val_solution_status = create_label(
        row_3,                // parent
        value_width_0,        // width
        obj_height,           // height
        LV_ALIGN_CENTER,      // parent alignment
        0,                    // pos x
        0,                    // pos y
        "",                   // initial text
        LV_TEXT_ALIGN_CENTER, // font alignment
        &cobalt_alien_17,     // font
        false,                // transparent background
        false,                // show scrollbar
        false,                // enable scrolling
        2,                    // outline width
        general_radius,       // outline radius
        1
    );

    // Critical for alignment
    lv_obj_set_size(result.lbl_latitude, label_width_0, obj_height);
    lv_obj_set_size(result.val_latitude, value_width_0, obj_height);

    /* ---------------------------------------------------------- */

    lv_obj_t * row_4 = lv_obj_create(result.panel);
    lv_obj_set_size(row_4, LV_PCT(100), row_height);
    lv_obj_set_flex_flow(row_4, LV_FLEX_FLOW_ROW);
    lv_obj_set_style_pad_all(row_4, 0, LV_PART_MAIN);
    lv_obj_set_style_bg_opa(row_4, LV_OPA_TRANSP, LV_PART_MAIN);
    lv_obj_set_style_border_width(row_4, 0, LV_PART_MAIN);
    lv_obj_set_style_pad_column(row_4, padding, LV_PART_MAIN);

    // Critical for alignment
    lv_obj_set_flex_align(
        row_4,
        LV_FLEX_ALIGN_START,   // main axis (left‑right)
        LV_FLEX_ALIGN_CENTER,  // cross axis (top‑bottom)
        LV_FLEX_ALIGN_CENTER   // track alignment
    );

    // Show scrollbar
    if (show_scrollbar) {lv_obj_set_scrollbar_mode(row_4, LV_SCROLLBAR_MODE_AUTO);}
    else {lv_obj_set_scrollbar_mode(row_4, LV_SCROLLBAR_MODE_OFF);}

    // Enable scrolling
    if (enable_scrolling) {lv_obj_set_scroll_dir(row_4, LV_DIR_ALL);}
    else {lv_obj_set_scroll_dir(row_4, LV_DIR_NONE);}

    // Row Object Widths
    label_width_0 = 200;
    value_width_0 = ((width_px) - label_width_0) - padding*4;

    // Label 
    result.lbl_sat_count = create_label(
        row_4,                // parent
        label_width_0,        // width
        obj_height,           // height
        LV_ALIGN_CENTER,      // parent alignment
        0,                    // pos x
        0,                    // pos y
        "Satellites",         // initial text
        LV_TEXT_ALIGN_LEFT,   // font alignment
        &cobalt_alien_17,     // font
        false,                // transparent background
        false,                // show scrollbar
        false,                // enable scrolling
        2,                    // outline width
        general_radius,       // outline radius
        1
    );
    
    // Value
    result.val_sat_count = create_label(
        row_4,                // parent
        value_width_0,        // width
        obj_height,           // height
        LV_ALIGN_CENTER,      // parent alignment
        0,                    // pos x
        0,                    // pos y
        "",                   // initial text
        LV_TEXT_ALIGN_CENTER, // font alignment
        &cobalt_alien_17,     // font
        false,                // transparent background
        false,                // show scrollbar
        false,                // enable scrolling
        2,                    // outline width
        general_radius,       // outline radius
        1
    );

    // Critical for alignment
    lv_obj_set_size(result.lbl_latitude, label_width_0, obj_height);
    lv_obj_set_size(result.val_latitude, value_width_0, obj_height);

    /* ---------------------------------------------------------- */

