holographicSol/SatIO_ESPIDF_Waveshare_ESP32-P4_Round_Display/satio_lvgl.cpp
    lv_obj_t * row_5 = lv_obj_create(result.panel);
    lv_obj_set_size(row_5, LV_PCT(100), row_height);
    lv_obj_set_flex_flow(row_5, LV_FLEX_FLOW_ROW);
    lv_obj_set_style_pad_all(row_5, 0, LV_PART_MAIN);
    lv_obj_set_style_bg_opa(row_5, LV_OPA_TRANSP, LV_PART_MAIN);
    lv_obj_set_style_border_width(row_5, 0, LV_PART_MAIN);
    lv_obj_set_style_pad_column(row_5, padding, LV_PART_MAIN);

    // Critical for alignment
    lv_obj_set_flex_align(
        row_5,
        LV_FLEX_ALIGN_START,   // main axis (left‑right)
        LV_FLEX_ALIGN_CENTER,  // cross axis (top‑bottom)
        LV_FLEX_ALIGN_CENTER   // track alignment
    );

    // Show scrollbar
    if (show_scrollbar) {lv_obj_set_scrollbar_mode(row_5, LV_SCROLLBAR_MODE_AUTO);}
    else {lv_obj_set_scrollbar_mode(row_5, LV_SCROLLBAR_MODE_OFF);}

    // Enable scrolling
    if (enable_scrolling) {lv_obj_set_scroll_dir(row_5, LV_DIR_ALL);}
    else {lv_obj_set_scroll_dir(row_5, LV_DIR_NONE);}

    // Row Object Widths
    label_width_0 = 200;
    value_width_0 = ((width_px) - label_width_0) - padding*4;

    // Label 
    result.lbl_gps_precision_factor = create_label(
        row_5,                // parent
        label_width_0,        // width
        obj_height,           // height
        LV_ALIGN_CENTER,      // parent alignment
        0,                    // pos x
        0,                    // pos y
        "GPS Precision",      // initial text
        LV_TEXT_ALIGN_LEFT,   // font alignment
        &cobalt_alien_17,     // font
        false,                // transparent background
        false,                // show scrollbar
        false,                // enable scrolling
        2,                    // outline width
        general_radius,       // outline radius
        1
    );
    
    // Value
    result.val_gps_precision_factor = create_label(
        row_5,                // parent
        value_width_0,        // width
        obj_height,           // height
        LV_ALIGN_CENTER,      // parent alignment
        0,                    // pos x
        0,                    // pos y
        "",                   // initial text
        LV_TEXT_ALIGN_CENTER, // font alignment
        &cobalt_alien_17,     // font
        false,                // transparent background
        false,                // show scrollbar
        false,                // enable scrolling
        2,                    // outline width
        general_radius,       // outline radius
        1
    );

    /* ---------------------------------------------------------- */

    lv_obj_t * row_6 = lv_obj_create(result.panel);
    lv_obj_set_size(row_6, LV_PCT(100), row_height);
    lv_obj_set_flex_flow(row_6, LV_FLEX_FLOW_ROW);
    lv_obj_set_style_pad_all(row_6, 0, LV_PART_MAIN);
    lv_obj_set_style_bg_opa(row_6, LV_OPA_TRANSP, LV_PART_MAIN);
    lv_obj_set_style_border_width(row_6, 0, LV_PART_MAIN);
    lv_obj_set_style_pad_column(row_6, padding, LV_PART_MAIN);

    // Critical for alignment
    lv_obj_set_flex_align(
        row_6,
        LV_FLEX_ALIGN_START,   // main axis (left‑right)
        LV_FLEX_ALIGN_CENTER,  // cross axis (top‑bottom)
        LV_FLEX_ALIGN_CENTER   // track alignment
    );

    // Show scrollbar
    if (show_scrollbar) {lv_obj_set_scrollbar_mode(row_6, LV_SCROLLBAR_MODE_AUTO);}
    else {lv_obj_set_scrollbar_mode(row_6, LV_SCROLLBAR_MODE_OFF);}

    // Enable scrolling
    if (enable_scrolling) {lv_obj_set_scroll_dir(row_6, LV_DIR_ALL);}
    else {lv_obj_set_scroll_dir(row_6, LV_DIR_NONE);}

    // Row Object Widths
    label_width_0 = 200;
    value_width_0 = ((width_px) - label_width_0) - padding*4;

    // Label 
    result.lbl_altitude = create_label(
        row_6,                // parent
        label_width_0,        // width
        obj_height,           // height
        LV_ALIGN_CENTER,      // parent alignment
        0,                    // pos x
        0,                    // pos y
        "Altitude",           // initial text
        LV_TEXT_ALIGN_LEFT,   // font alignment
        &cobalt_alien_17,     // font
        false,                // transparent background
        false,                // show scrollbar
        false,                // enable scrolling
        2,                    // outline width
        general_radius,       // outline radius
        1
    );
    
    // Value
    result.val_altitude = create_label(
        row_6,                // parent
        value_width_0,        // width
        obj_height,           // height
        LV_ALIGN_CENTER,      // parent alignment
        0,                    // pos x
        0,                    // pos y
        "",                   // initial text
        LV_TEXT_ALIGN_CENTER, // font alignment
        &cobalt_alien_17,     // font
        false,                // transparent background
        false,                // show scrollbar
        false,                // enable scrolling
        2,                    // outline width
        general_radius,       // outline radius
        1
    );

    // Critical for alignment
    lv_obj_set_size(result.lbl_latitude, label_width_0, obj_height);
    lv_obj_set_size(result.val_latitude, value_width_0, obj_height);

    /* ---------------------------------------------------------- */

    lv_obj_t * row_7 = lv_obj_create(result.panel);
    lv_obj_set_size(row_7, LV_PCT(100), row_height);
    lv_obj_set_flex_flow(row_7, LV_FLEX_FLOW_ROW);
    lv_obj_set_style_pad_all(row_7, 0, LV_PART_MAIN);
    lv_obj_set_style_bg_opa(row_7, LV_OPA_TRANSP, LV_PART_MAIN);
    lv_obj_set_style_border_width(row_7, 0, LV_PART_MAIN);
    lv_obj_set_style_pad_column(row_7, padding, LV_PART_MAIN);

    // Critical for alignment
    lv_obj_set_flex_align(
        row_7,
        LV_FLEX_ALIGN_START,   // main axis (left‑right)
        LV_FLEX_ALIGN_CENTER,  // cross axis (top‑bottom)
        LV_FLEX_ALIGN_CENTER   // track alignment
    );

    // Show scrollbar
    if (show_scrollbar) {lv_obj_set_scrollbar_mode(row_7, LV_SCROLLBAR_MODE_AUTO);}
    else {lv_obj_set_scrollbar_mode(row_7, LV_SCROLLBAR_MODE_OFF);}

    // Enable scrolling
    if (enable_scrolling) {lv_obj_set_scroll_dir(row_7, LV_DIR_ALL);}
    else {lv_obj_set_scroll_dir(row_7, LV_DIR_NONE);}

