holographicSol/SatIO_ESPIDF_Waveshare_ESP32-P4_Round_Display/satio_lvgl.cpp
    lv_obj_set_flex_align(row_3,
                          LV_FLEX_ALIGN_START,
                          LV_FLEX_ALIGN_CENTER,
                          LV_FLEX_ALIGN_CENTER);

    if (show_scrollbar) lv_obj_set_scrollbar_mode(row_3, LV_SCROLLBAR_MODE_AUTO);
    else lv_obj_set_scrollbar_mode(row_3, LV_SCROLLBAR_MODE_OFF);

    if (enable_scrolling) lv_obj_set_scroll_dir(row_3, LV_DIR_ALL);
    else lv_obj_set_scroll_dir(row_3, LV_DIR_NONE);

    label_width_0 = 200;
    value_width_0 = (width_px - label_width_0) - padding * 4;

    result.lbl_longitude = create_label(
        row_3,
        label_width_0,
        obj_height,
        LV_ALIGN_CENTER,
        0,
        0,
        "Longitude",
        LV_TEXT_ALIGN_LEFT,
        &cobalt_alien_17,
        false,
        false,
        false,
        2,
        general_radius,
        1
    );

    result.val_longitude = create_label(
        row_3,        // parent (fixing your earlier row_1 typo)
        label_width_0,
        obj_height,
        LV_ALIGN_CENTER,
        0,
        0,
        "",
        LV_TEXT_ALIGN_CENTER,
        &cobalt_alien_17,
        false,
        false,
        false,
        2,
        general_radius,
        1
    );

    lv_obj_set_size(result.lbl_longitude, label_width_0, obj_height);
    lv_obj_set_size(result.val_longitude, value_width_0, obj_height);

    /* ---------------------------------------------------------- */
    /* Row 4: Ground Speed                                        */
    /* ---------------------------------------------------------- */

    lv_obj_t * row_4 = lv_obj_create(result.panel);
    lv_obj_set_size(row_4, LV_PCT(100), row_height);
    lv_obj_set_flex_flow(row_4, LV_FLEX_FLOW_ROW);
    lv_obj_set_style_pad_all(row_4, 0, LV_PART_MAIN);
    lv_obj_set_style_bg_opa(row_4, LV_OPA_TRANSP, LV_PART_MAIN);
    lv_obj_set_style_border_width(row_4, 0, LV_PART_MAIN);
    lv_obj_set_style_pad_column(row_4, padding, LV_PART_MAIN);

    lv_obj_set_flex_align(row_4,
                          LV_FLEX_ALIGN_START,
                          LV_FLEX_ALIGN_CENTER,
                          LV_FLEX_ALIGN_CENTER);

    if (show_scrollbar) lv_obj_set_scrollbar_mode(row_4, LV_SCROLLBAR_MODE_AUTO);
    else lv_obj_set_scrollbar_mode(row_4, LV_SCROLLBAR_MODE_OFF);

    if (enable_scrolling) lv_obj_set_scroll_dir(row_4, LV_DIR_ALL);
    else lv_obj_set_scroll_dir(row_4, LV_DIR_NONE);

    label_width_0 = 200;
    value_width_0 = (width_px - label_width_0) - padding * 4;

    result.lbl_ground_speed = create_label(
        row_4,
        label_width_0,
        obj_height,
        LV_ALIGN_CENTER,
        0,
        0,
        "Ground Speed",
        LV_TEXT_ALIGN_LEFT,
        &cobalt_alien_17,
        false,
        false,
        false,
        2,
        general_radius,
        1
    );

    result.val_ground_speed = create_label(
        row_4,
        label_width_0,
        obj_height,
        LV_ALIGN_CENTER,
        0,
        0,
        "",
        LV_TEXT_ALIGN_CENTER,
        &cobalt_alien_17,
        false,
        false,
        false,
        2,
        general_radius,
        1
    );

    lv_obj_set_size(result.lbl_ground_speed, label_width_0, obj_height);
    lv_obj_set_size(result.val_ground_speed, value_width_0, obj_height);

    /* ---------------------------------------------------------- */
    /* Row 5: Ground Heading                                      */
    /* ---------------------------------------------------------- */

    lv_obj_t * row_5 = lv_obj_create(result.panel);
    lv_obj_set_size(row_5, LV_PCT(100), row_height);
    lv_obj_set_flex_flow(row_5, LV_FLEX_FLOW_ROW);
    lv_obj_set_style_pad_all(row_5, 0, LV_PART_MAIN);
    lv_obj_set_style_bg_opa(row_5, LV_OPA_TRANSP, LV_PART_MAIN);
    lv_obj_set_style_border_width(row_5, 0, LV_PART_MAIN);
    lv_obj_set_style_pad_column(row_5, padding, LV_PART_MAIN);

    lv_obj_set_flex_align(row_5,
                          LV_FLEX_ALIGN_START,
                          LV_FLEX_ALIGN_CENTER,
                          LV_FLEX_ALIGN_CENTER);

    if (show_scrollbar) lv_obj_set_scrollbar_mode(row_5, LV_SCROLLBAR_MODE_AUTO);
    else lv_obj_set_scrollbar_mode(row_5, LV_SCROLLBAR_MODE_OFF);

    if (enable_scrolling) lv_obj_set_scroll_dir(row_5, LV_DIR_ALL);
    else lv_obj_set_scroll_dir(row_5, LV_DIR_NONE);

    label_width_0 = 200;
    value_width_0 = (width_px - label_width_0) - padding * 4;

    result.lbl_ground_heading = create_label(
        row_5,
        label_width_0,
        obj_height,
        LV_ALIGN_CENTER,
        0,
        0,
        "Ground Head",
        LV_TEXT_ALIGN_LEFT,
        &cobalt_alien_17,
        false,
        false,
        false,
        2,
        general_radius,
        1
    );

    result.val_ground_heading = create_label(
        row_5,
        label_width_0,
        obj_height,
        LV_ALIGN_CENTER,
        0,
        0,
        "",
        LV_TEXT_ALIGN_CENTER,
        &cobalt_alien_17,
        false,
        false,
        false,
        2,
        general_radius,
        1
    );

    lv_obj_set_size(result.lbl_ground_heading, label_width_0, obj_height);
    lv_obj_set_size(result.val_ground_heading, value_width_0, obj_height);

    /* ---------------------------------------------------------- */
    /* Row 6: UTC Date                                            */
    /* ---------------------------------------------------------- */

    lv_obj_t * row_6 = lv_obj_create(result.panel);
    lv_obj_set_size(row_6, LV_PCT(100), row_height);
    lv_obj_set_flex_flow(row_6, LV_FLEX_FLOW_ROW);
    lv_obj_set_style_pad_all(row_6, 0, LV_PART_MAIN);
    lv_obj_set_style_bg_opa(row_6, LV_OPA_TRANSP, LV_PART_MAIN);
    lv_obj_set_style_border_width(row_6, 0, LV_PART_MAIN);
    lv_obj_set_style_pad_column(row_6, padding, LV_PART_MAIN);

    lv_obj_set_flex_align(row_6,
                          LV_FLEX_ALIGN_START,
                          LV_FLEX_ALIGN_CENTER,
                          LV_FLEX_ALIGN_CENTER);

