holographicSol/SatIO_ESPIDF_Waveshare_ESP32-P4_Round_Display/satio_lvgl.cpp
    lv_obj_set_size(result.lbl_software_version, label_width_0, obj_height);
    lv_obj_set_size(result.val_software_version, value_width_0, obj_height);

    /* ---------------------------------------------------------- */
    /* Row 4: Product ID                                          */
    /* ---------------------------------------------------------- */

    lv_obj_t * row_4 = lv_obj_create(result.panel);
    lv_obj_set_size(row_4, LV_PCT(100), row_height);
    lv_obj_set_flex_flow(row_4, LV_FLEX_FLOW_ROW);
    lv_obj_set_style_pad_all(row_4, 0, LV_PART_MAIN);
    lv_obj_set_style_bg_opa(row_4, LV_OPA_TRANSP, LV_PART_MAIN);
    lv_obj_set_style_border_width(row_4, 0, LV_PART_MAIN);
    lv_obj_set_style_pad_column(row_4, padding, LV_PART_MAIN);

    lv_obj_set_flex_align(
        row_4,
        LV_FLEX_ALIGN_START,
        LV_FLEX_ALIGN_CENTER,
        LV_FLEX_ALIGN_CENTER
    );

    if (show_scrollbar) { lv_obj_set_scrollbar_mode(row_4, LV_SCROLLBAR_MODE_AUTO); }
    else { lv_obj_set_scrollbar_mode(row_4, LV_SCROLLBAR_MODE_OFF); }

    if (enable_scrolling) { lv_obj_set_scroll_dir(row_4, LV_DIR_ALL); }
    else { lv_obj_set_scroll_dir(row_4, LV_DIR_NONE); }

    label_width_0 = 200;
    value_width_0 = (width_px - label_width_0) - padding * 4;

    result.lbl_product_id = create_label(
        row_4,
        label_width_0,
        obj_height,
        LV_ALIGN_CENTER,
        0,
        0,
        "Product ID",
        LV_TEXT_ALIGN_LEFT,
        &cobalt_alien_17,
        false,
        false,
        false,
        2,
        general_radius,
        1
    );

    result.val_product_id = create_label(
        row_4,
        label_width_0,
        obj_height,
        LV_ALIGN_CENTER,
        0,
        0,
        "",
        LV_TEXT_ALIGN_CENTER,
        &cobalt_alien_17,
        false,
        false,
        false,
        2,
        general_radius,
        1
    );

    lv_obj_set_size(result.lbl_product_id, label_width_0, obj_height);
    lv_obj_set_size(result.val_product_id, value_width_0, obj_height);

    /* ---------------------------------------------------------- */
    /* Row 5: INS                                                 */
    /* ---------------------------------------------------------- */

    lv_obj_t * row_5 = lv_obj_create(result.panel);
    lv_obj_set_size(row_5, LV_PCT(100), row_height);
    lv_obj_set_flex_flow(row_5, LV_FLEX_FLOW_ROW);
    lv_obj_set_style_pad_all(row_5, 0, LV_PART_MAIN);
    lv_obj_set_style_bg_opa(row_5, LV_OPA_TRANSP, LV_PART_MAIN);
    lv_obj_set_style_border_width(row_5, 0, LV_PART_MAIN);
    lv_obj_set_style_pad_column(row_5, padding, LV_PART_MAIN);

    lv_obj_set_flex_align(
        row_5,
        LV_FLEX_ALIGN_START,
        LV_FLEX_ALIGN_CENTER,
        LV_FLEX_ALIGN_CENTER
    );

    if (show_scrollbar) { lv_obj_set_scrollbar_mode(row_5, LV_SCROLLBAR_MODE_AUTO); }
    else { lv_obj_set_scrollbar_mode(row_5, LV_SCROLLBAR_MODE_OFF); }

    if (enable_scrolling) { lv_obj_set_scroll_dir(row_5, LV_DIR_ALL); }
    else { lv_obj_set_scroll_dir(row_5, LV_DIR_NONE); }

    label_width_0 = 200;
    value_width_0 = (width_px - label_width_0) - padding * 4;

    result.lbl_ins = create_label(
        row_5,
        label_width_0,
        obj_height,
        LV_ALIGN_CENTER,
        0,
        0,
        "INS",
        LV_TEXT_ALIGN_LEFT,
        &cobalt_alien_17,
        false,
        false,
        false,
        2,
        general_radius,
        1
    );

    result.val_ins = create_label(
        row_5,
        label_width_0,
        obj_height,
        LV_ALIGN_CENTER,
        0,
        0,
        "",
        LV_TEXT_ALIGN_CENTER,
        &cobalt_alien_17,
        false,
        false,
        false,
        2,
        general_radius,
        1
    );

    lv_obj_set_size(result.lbl_ins, label_width_0, obj_height);
    lv_obj_set_size(result.val_ins, value_width_0, obj_height);

    /* ---------------------------------------------------------- */
    /* Row 6: Hardware Version                                    */
    /* ---------------------------------------------------------- */

    lv_obj_t * row_6 = lv_obj_create(result.panel);
    lv_obj_set_size(row_6, LV_PCT(100), row_height);
    lv_obj_set_flex_flow(row_6, LV_FLEX_FLOW_ROW);
    lv_obj_set_style_pad_all(row_6, 0, LV_PART_MAIN);
    lv_obj_set_style_bg_opa(row_6, LV_OPA_TRANSP, LV_PART_MAIN);
    lv_obj_set_style_border_width(row_6, 0, LV_PART_MAIN);
    lv_obj_set_style_pad_column(row_6, padding, LV_PART_MAIN);

    lv_obj_set_flex_align(
        row_6,
        LV_FLEX_ALIGN_START,
        LV_FLEX_ALIGN_CENTER,
        LV_FLEX_ALIGN_CENTER
    );

    if (show_scrollbar) { lv_obj_set_scrollbar_mode(row_6, LV_SCROLLBAR_MODE_AUTO); }
    else { lv_obj_set_scrollbar_mode(row_6, LV_SCROLLBAR_MODE_OFF); }

    if (enable_scrolling) { lv_obj_set_scroll_dir(row_6, LV_DIR_ALL); }
    else { lv_obj_set_scroll_dir(row_6, LV_DIR_NONE); }

    label_width_0 = 200;
    value_width_0 = (width_px - label_width_0) - padding * 4;

    result.lbl_hardware_version = create_label(
        row_6,
        label_width_0,
        obj_height,
        LV_ALIGN_CENTER,
        0,
        0,
        "HW Version",
        LV_TEXT_ALIGN_LEFT,
        &cobalt_alien_17,
        false,
        false,
        false,
        2,
        general_radius,
        1
    );

    result.val_hardware_version = create_label(
        row_6,
        label_width_0,
        obj_height,
        LV_ALIGN_CENTER,
        0,
        0,
        "",
        LV_TEXT_ALIGN_CENTER,
        &cobalt_alien_17,
        false,
        false,
        false,
        2,
        general_radius,
        1
    );

    lv_obj_set_size(result.lbl_hardware_version, label_width_0, obj_height);
    lv_obj_set_size(result.val_hardware_version, value_width_0, obj_height);

    /* ---------------------------------------------------------- */
    /* Row 7: Run State Flag                                      */
    /* ---------------------------------------------------------- */

    lv_obj_t * row_7 = lv_obj_create(result.panel);
    lv_obj_set_size(row_7, LV_PCT(100), row_height);
    lv_obj_set_flex_flow(row_7, LV_FLEX_FLOW_ROW);
    lv_obj_set_style_pad_all(row_7, 0, LV_PART_MAIN);
    lv_obj_set_style_bg_opa(row_7, LV_OPA_TRANSP, LV_PART_MAIN);
    lv_obj_set_style_border_width(row_7, 0, LV_PART_MAIN);
    lv_obj_set_style_pad_column(row_7, padding, LV_PART_MAIN);

    lv_obj_set_flex_align(
        row_7,
        LV_FLEX_ALIGN_START,
        LV_FLEX_ALIGN_CENTER,
        LV_FLEX_ALIGN_CENTER
    );

    if (show_scrollbar) { lv_obj_set_scrollbar_mode(row_7, LV_SCROLLBAR_MODE_AUTO); }
    else { lv_obj_set_scrollbar_mode(row_7, LV_SCROLLBAR_MODE_OFF); }

    if (enable_scrolling) { lv_obj_set_scroll_dir(row_7, LV_DIR_ALL); }
    else { lv_obj_set_scroll_dir(row_7, LV_DIR_NONE); }

    label_width_0 = 200;
    value_width_0 = (width_px - label_width_0) - padding * 4;

    result.lbl_run_state_flag = create_label(
        row_7,
        label_width_0,
        obj_height,
        LV_ALIGN_CENTER,
        0,
        0,
        "Run State",
        LV_TEXT_ALIGN_LEFT,
        &cobalt_alien_17,
        false,
        false,
        false,
        2,
        general_radius,
        1
    );

    result.val_run_state_flag = create_label(
        row_7,
        label_width_0,
        obj_height,
        LV_ALIGN_CENTER,
        0,
        0,
        "",
        LV_TEXT_ALIGN_CENTER,
        &cobalt_alien_17,
        false,
        false,
        false,
        2,
        general_radius,
        1
    );

