holographicSol/SatIO_ESPIDF_Waveshare_ESP32-P4_Round_Display/satio_lvgl.cpp
    if (enable_scrolling) lv_obj_set_scroll_dir(row_title_positioning, LV_DIR_ALL);
    else lv_obj_set_scroll_dir(row_title_positioning, LV_DIR_NONE);

    label_width_0 = width_px - padding * 4;

    result.lbl_title_location= create_label(
        row_title_positioning,
        label_width_0,
        obj_height,
        LV_ALIGN_CENTER,
        0,
        0,
        "POSITIONING",
        LV_TEXT_ALIGN_CENTER,
        &cobalt_alien_17,
        false,
        false,
        false,
        2,
        general_radius,
        1
    );

    lv_obj_set_size(result.lbl_title_location, label_width_0, obj_height);

    /* ---------------------------------------------------------- */
    /* Row GPS Degrees Latitude                                   */
    /* ---------------------------------------------------------- */

    lv_obj_t * row_lat = lv_obj_create(result.panel);
    lv_obj_set_size(row_lat, LV_PCT(100), row_height);
    lv_obj_set_flex_flow(row_lat, LV_FLEX_FLOW_ROW);
    lv_obj_set_style_pad_all(row_lat, 0, LV_PART_MAIN);
    lv_obj_set_style_bg_opa(row_lat, LV_OPA_TRANSP, LV_PART_MAIN);
    lv_obj_set_style_border_width(row_lat, 0, LV_PART_MAIN);
    lv_obj_set_style_pad_column(row_lat, padding, LV_PART_MAIN);

    lv_obj_set_flex_align(row_lat,
                          LV_FLEX_ALIGN_START,
                          LV_FLEX_ALIGN_CENTER,
                          LV_FLEX_ALIGN_CENTER);

    if (show_scrollbar) lv_obj_set_scrollbar_mode(row_lat, LV_SCROLLBAR_MODE_AUTO);
    else lv_obj_set_scrollbar_mode(row_lat, LV_SCROLLBAR_MODE_OFF);

    if (enable_scrolling) lv_obj_set_scroll_dir(row_lat, LV_DIR_ALL);
    else lv_obj_set_scroll_dir(row_lat, LV_DIR_NONE);

    label_width_0 = 250;
    value_width_0 = ((width_px) - label_width_0) - padding * 4;
    obj_height = row_height - 6;

    result.lbl_deg_lat= create_label(
        row_lat,
        label_width_0,
        obj_height,
        LV_ALIGN_CENTER,
        0,
        0,
        "[GPS] Degrees Latitude",
        LV_TEXT_ALIGN_LEFT,
        &cobalt_alien_17,
        false,
        false,
        false,
        2,
        general_radius,
        1
    );

    result.val_deg_lat = create_label(
        row_lat,
        value_width_0,
        obj_height,
        LV_ALIGN_CENTER,
        0,
        0,
        "",
        LV_TEXT_ALIGN_CENTER,
        &cobalt_alien_17,
        false,
        false,
        false,
        2,
        general_radius,
        1
    );

    lv_obj_set_size(result.lbl_deg_lat, label_width_0, obj_height);
    lv_obj_set_size(result.val_deg_lat, value_width_0, obj_height);

    /* ---------------------------------------------------------- */
    /* Row GPS Degrees Longitude                                  */
    /* ---------------------------------------------------------- */

    lv_obj_t * row_lon = lv_obj_create(result.panel);
    lv_obj_set_size(row_lon, LV_PCT(100), row_height);
    lv_obj_set_flex_flow(row_lon, LV_FLEX_FLOW_ROW);
    lv_obj_set_style_pad_all(row_lon, 0, LV_PART_MAIN);
    lv_obj_set_style_bg_opa(row_lon, LV_OPA_TRANSP, LV_PART_MAIN);
    lv_obj_set_style_border_width(row_lon, 0, LV_PART_MAIN);
    lv_obj_set_style_pad_column(row_lon, padding, LV_PART_MAIN);

    lv_obj_set_flex_align(row_lon,
                          LV_FLEX_ALIGN_START,
                          LV_FLEX_ALIGN_CENTER,
                          LV_FLEX_ALIGN_CENTER);

    if (show_scrollbar) lv_obj_set_scrollbar_mode(row_lon, LV_SCROLLBAR_MODE_AUTO);
    else lv_obj_set_scrollbar_mode(row_lon, LV_SCROLLBAR_MODE_OFF);

    if (enable_scrolling) lv_obj_set_scroll_dir(row_lon, LV_DIR_ALL);
    else lv_obj_set_scroll_dir(row_lon, LV_DIR_NONE);

    result.lbl_deg_lon = create_label(
        row_lon,
        label_width_0,
        obj_height,
        LV_ALIGN_CENTER,
        0,
        0,
        "[GPS] Degrees Longitude",
        LV_TEXT_ALIGN_LEFT,
        &cobalt_alien_17,
        false,
        false,
        false,
        2,
        general_radius,
        1
    );

    result.val_deg_lon = create_label(
        row_lon,
        value_width_0,
        obj_height,
        LV_ALIGN_CENTER,
        0,
        0,
        "",
        LV_TEXT_ALIGN_CENTER,
        &cobalt_alien_17,
        false,
        false,
        false,
        2,
        general_radius,
        1
    );

    lv_obj_set_size(result.lbl_deg_lon, label_width_0, obj_height);
    lv_obj_set_size(result.val_deg_lon, value_width_0, obj_height);

    /* ---------------------------------------------------------- */
    /* Row Degrees User Latitude                                  */
    /* ---------------------------------------------------------- */

    lv_obj_t * row_user_lat = lv_obj_create(result.panel);
    lv_obj_set_size(row_user_lat, LV_PCT(100), row_height);
    lv_obj_set_flex_flow(row_user_lat, LV_FLEX_FLOW_ROW);
    lv_obj_set_style_pad_all(row_user_lat, 0, LV_PART_MAIN);
    lv_obj_set_style_bg_opa(row_user_lat, LV_OPA_TRANSP, LV_PART_MAIN);
    lv_obj_set_style_border_width(row_user_lat, 0, LV_PART_MAIN);
    lv_obj_set_style_pad_column(row_user_lat, padding, LV_PART_MAIN);

    lv_obj_set_flex_align(row_user_lat,
                          LV_FLEX_ALIGN_START,
                          LV_FLEX_ALIGN_CENTER,
                          LV_FLEX_ALIGN_CENTER);

    if (show_scrollbar) lv_obj_set_scrollbar_mode(row_user_lat, LV_SCROLLBAR_MODE_AUTO);
    else lv_obj_set_scrollbar_mode(row_user_lat, LV_SCROLLBAR_MODE_OFF);

    if (enable_scrolling) lv_obj_set_scroll_dir(row_user_lat, LV_DIR_ALL);
    else lv_obj_set_scroll_dir(row_user_lat, LV_DIR_NONE);

    result.lbl_user_deg_lat= create_label(
        row_user_lat,
        label_width_0,
        obj_height,
        LV_ALIGN_CENTER,
        0,
        0,
        "[USER] Degrees Latitude",
        LV_TEXT_ALIGN_LEFT,
        &cobalt_alien_17,
        false,
        false,
        false,
        2,
        general_radius,
        1
    );

    result.ta_user_deg_lat = create_textarea(
        row_user_lat,
        value_width_0,
        obj_height,
        LV_ALIGN_CENTER,
        0,
        0,
        true,
        "0123456789.-",
        "0",
        false,
        false,
        false,
        &cobalt_alien_17,
        LV_TEXT_ALIGN_CENTER
    );
    lv_obj_add_event_cb(result.ta_user_deg_lat, set_keyboard_context_cb, LV_EVENT_ALL, NULL);
    lv_obj_set_user_data(result.ta_user_deg_lat, &user_latitude_ctx);

    lv_obj_set_size(result.lbl_user_deg_lat, label_width_0, obj_height);
    lv_obj_set_size(result.ta_user_deg_lat, value_width_0, obj_height);

    /* ---------------------------------------------------------- */
    /* Row Degrees User Longitude                                 */
    /* ---------------------------------------------------------- */

