holographicSol/SatIO_ESPIDF_Waveshare_ESP32-P4_Round_Display/satio_lvgl.cpp
    lv_obj_t * row_user_lon = lv_obj_create(result.panel);
    lv_obj_set_size(row_user_lon, LV_PCT(100), row_height);
    lv_obj_set_flex_flow(row_user_lon, LV_FLEX_FLOW_ROW);
    lv_obj_set_style_pad_all(row_user_lon, 0, LV_PART_MAIN);
    lv_obj_set_style_bg_opa(row_user_lon, LV_OPA_TRANSP, LV_PART_MAIN);
    lv_obj_set_style_border_width(row_user_lon, 0, LV_PART_MAIN);
    lv_obj_set_style_pad_column(row_user_lon, padding, LV_PART_MAIN);

    lv_obj_set_flex_align(row_user_lon,
                          LV_FLEX_ALIGN_START,
                          LV_FLEX_ALIGN_CENTER,
                          LV_FLEX_ALIGN_CENTER);

    if (show_scrollbar) lv_obj_set_scrollbar_mode(row_user_lon, LV_SCROLLBAR_MODE_AUTO);
    else lv_obj_set_scrollbar_mode(row_user_lon, LV_SCROLLBAR_MODE_OFF);

    if (enable_scrolling) lv_obj_set_scroll_dir(row_user_lon, LV_DIR_ALL);
    else lv_obj_set_scroll_dir(row_user_lon, LV_DIR_NONE);

    result.lbl_user_deg_lon = create_label(
        row_user_lon,
        label_width_0,
        obj_height,
        LV_ALIGN_CENTER,
        0,
        0,
        "[USER] Degrees Longitude",
        LV_TEXT_ALIGN_LEFT,
        &cobalt_alien_17,
        false,
        false,
        false,
        2,
        general_radius,
        1
    );

    result.ta_user_deg_lon = create_textarea(
        row_user_lon,
        value_width_0,
        obj_height,
        LV_ALIGN_CENTER,
        0,
        0,
        true,
        "0123456789.-",
        "0",
        false,
        false,
        false,
        &cobalt_alien_17,
        LV_TEXT_ALIGN_CENTER
    );
    lv_obj_add_event_cb(result.ta_user_deg_lon, set_keyboard_context_cb, LV_EVENT_ALL, NULL);
    lv_obj_set_user_data(result.ta_user_deg_lon, &user_longitude_ctx);

    lv_obj_set_size(result.lbl_user_deg_lon, label_width_0, obj_height);
    lv_obj_set_size(result.ta_user_deg_lon, value_width_0, obj_height);

    /* ---------------------------------------------------------- */
    /* Title Altitude                                             */
    /* ---------------------------------------------------------- */

    lv_obj_t * row_title_altitude = lv_obj_create(result.panel);
    lv_obj_set_size(row_title_altitude, LV_PCT(100), row_height);
    lv_obj_set_flex_flow(row_title_altitude, LV_FLEX_FLOW_ROW);
    lv_obj_set_style_pad_all(row_title_altitude, 0, LV_PART_MAIN);
    lv_obj_set_style_bg_opa(row_title_altitude, LV_OPA_TRANSP, LV_PART_MAIN);
    lv_obj_set_style_border_width(row_title_altitude, 0, LV_PART_MAIN);
    lv_obj_set_style_pad_column(row_title_altitude, padding, LV_PART_MAIN);

    lv_obj_set_flex_align(row_title_altitude,
                          LV_FLEX_ALIGN_START,
                          LV_FLEX_ALIGN_CENTER,
                          LV_FLEX_ALIGN_CENTER);

    if (show_scrollbar) lv_obj_set_scrollbar_mode(row_title_altitude, LV_SCROLLBAR_MODE_AUTO);
    else lv_obj_set_scrollbar_mode(row_title_altitude, LV_SCROLLBAR_MODE_OFF);

    if (enable_scrolling) lv_obj_set_scroll_dir(row_title_altitude, LV_DIR_ALL);
    else lv_obj_set_scroll_dir(row_title_altitude, LV_DIR_NONE);

    label_width_0 = width_px - padding * 4;

    result.lbl_title_altitude= create_label(
        row_title_altitude,
        label_width_0,
        obj_height,
        LV_ALIGN_CENTER,
        0,
        0,
        "ALTITUDE",
        LV_TEXT_ALIGN_CENTER,
        &cobalt_alien_17,
        false,
        false,
        false,
        2,
        general_radius,
        1
    );

    lv_obj_set_size(result.lbl_title_altitude, label_width_0, obj_height);

    /* ---------------------------------------------------------- */
    /* Row GPS Altitude                                           */
    /* ---------------------------------------------------------- */

    lv_obj_t * row_17 = lv_obj_create(result.panel);
    lv_obj_set_size(row_17, LV_PCT(100), row_height);
    lv_obj_set_flex_flow(row_17, LV_FLEX_FLOW_ROW);
    lv_obj_set_style_pad_all(row_17, 0, LV_PART_MAIN);
    lv_obj_set_style_bg_opa(row_17, LV_OPA_TRANSP, LV_PART_MAIN);
    lv_obj_set_style_border_width(row_17, 0, LV_PART_MAIN);
    lv_obj_set_style_pad_column(row_17, padding, LV_PART_MAIN);

    lv_obj_set_flex_align(row_17,
                          LV_FLEX_ALIGN_START,
                          LV_FLEX_ALIGN_CENTER,
                          LV_FLEX_ALIGN_CENTER);

    if (show_scrollbar) lv_obj_set_scrollbar_mode(row_17, LV_SCROLLBAR_MODE_AUTO);
    else lv_obj_set_scrollbar_mode(row_17, LV_SCROLLBAR_MODE_OFF);

    if (enable_scrolling) lv_obj_set_scroll_dir(row_17, LV_DIR_ALL);
    else lv_obj_set_scroll_dir(row_17, LV_DIR_NONE);

    label_width_0 = 250;
    value_width_0 = ((width_px) - label_width_0) - padding * 4;
    obj_height = row_height - 6;

    result.lbl_altitude = create_label(
        row_17,
        label_width_0,
        obj_height,
        LV_ALIGN_CENTER,
        0,
        0,
        "[GPS] Altitude",
        LV_TEXT_ALIGN_LEFT,
        &cobalt_alien_17,
        false,
        false,
        false,
        2,
        general_radius,
        1
    );

    result.val_altitude = create_label(
        row_17,
        value_width_0,
        obj_height,
        LV_ALIGN_CENTER,
        0,
        0,
        "",
        LV_TEXT_ALIGN_CENTER,
        &cobalt_alien_17,
        false,
        false,
        false,
        2,
        general_radius,
        1
    );

    lv_obj_set_size(result.lbl_altitude, label_width_0, obj_height);
    lv_obj_set_size(result.val_altitude, value_width_0, obj_height);

    /* ---------------------------------------------------------- */
    /* Row User Altitude                                          */
    /* ---------------------------------------------------------- */

    lv_obj_t * row_user_alt = lv_obj_create(result.panel);
    lv_obj_set_size(row_user_alt, LV_PCT(100), row_height);
    lv_obj_set_flex_flow(row_user_alt, LV_FLEX_FLOW_ROW);
    lv_obj_set_style_pad_all(row_user_alt, 0, LV_PART_MAIN);
    lv_obj_set_style_bg_opa(row_user_alt, LV_OPA_TRANSP, LV_PART_MAIN);
    lv_obj_set_style_border_width(row_user_alt, 0, LV_PART_MAIN);
    lv_obj_set_style_pad_column(row_user_alt, padding, LV_PART_MAIN);

    lv_obj_set_flex_align(row_user_alt,
                          LV_FLEX_ALIGN_START,
                          LV_FLEX_ALIGN_CENTER,
                          LV_FLEX_ALIGN_CENTER);

