holographicSol/SatIO_ESPIDF_Waveshare_ESP32-P4_Round_Display/satio_lvgl.cpp
    if (show_scrollbar) lv_obj_set_scrollbar_mode(row_user_alt, LV_SCROLLBAR_MODE_AUTO);
    else lv_obj_set_scrollbar_mode(row_user_alt, LV_SCROLLBAR_MODE_OFF);

    if (enable_scrolling) lv_obj_set_scroll_dir(row_user_alt, LV_DIR_ALL);
    else lv_obj_set_scroll_dir(row_user_alt, LV_DIR_NONE);

    result.lbl_user_altitude = create_label(
        row_user_alt,
        label_width_0,
        obj_height,
        LV_ALIGN_CENTER,
        0,
        0,
        "[USER] Altitude",
        LV_TEXT_ALIGN_LEFT,
        &cobalt_alien_17,
        false,
        false,
        false,
        2,
        general_radius,
        1
    );

    result.ta_user_altitude = create_textarea(
        row_user_alt,
        value_width_0,
        obj_height,
        LV_ALIGN_CENTER,
        0,
        0,
        true,
        "0123456789.-",
        "0",
        false,
        false,
        false,
        &cobalt_alien_17,
        LV_TEXT_ALIGN_CENTER
    );
    lv_obj_add_event_cb(result.ta_user_altitude, set_keyboard_context_cb, LV_EVENT_ALL, NULL);
    lv_obj_set_user_data(result.ta_user_altitude, &user_altitude_ctx);

    lv_obj_set_size(result.lbl_user_altitude, label_width_0, obj_height);
    lv_obj_set_size(result.ta_user_altitude, value_width_0, obj_height);

    /* ---------------------------------------------------------- */
    /* Title Speed                                                */
    /* ---------------------------------------------------------- */
    lv_obj_t * row_title_speed = lv_obj_create(result.panel);
    lv_obj_set_size(row_title_speed, LV_PCT(100), row_height);
    lv_obj_set_flex_flow(row_title_speed, LV_FLEX_FLOW_ROW);
    lv_obj_set_style_pad_all(row_title_speed, 0, LV_PART_MAIN);
    lv_obj_set_style_bg_opa(row_title_speed, LV_OPA_TRANSP, LV_PART_MAIN);
    lv_obj_set_style_border_width(row_title_speed, 0, LV_PART_MAIN);
    lv_obj_set_style_pad_column(row_title_speed, padding, LV_PART_MAIN);

    lv_obj_set_flex_align(row_title_speed,
                          LV_FLEX_ALIGN_START,
                          LV_FLEX_ALIGN_CENTER,
                          LV_FLEX_ALIGN_CENTER);

    if (show_scrollbar) lv_obj_set_scrollbar_mode(row_title_speed, LV_SCROLLBAR_MODE_AUTO);
    else lv_obj_set_scrollbar_mode(row_title_speed, LV_SCROLLBAR_MODE_OFF);

    if (enable_scrolling) lv_obj_set_scroll_dir(row_title_speed, LV_DIR_ALL);
    else lv_obj_set_scroll_dir(row_title_speed, LV_DIR_NONE);

    label_width_0 = width_px - padding * 4;

    result.lbl_title_speed= create_label(
        row_title_speed,
        label_width_0,
        obj_height,
        LV_ALIGN_CENTER,
        0,
        0,
        "SPEED",
        LV_TEXT_ALIGN_CENTER,
        &cobalt_alien_17,
        false,
        false,
        false,
        2,
        general_radius,
        1
    );

    lv_obj_set_size(result.lbl_title_speed, label_width_0, obj_height);

    /* ---------------------------------------------------------- */
    /* Row GPS Speed                                              */
    /* ---------------------------------------------------------- */

    lv_obj_t * row_21 = lv_obj_create(result.panel);
    lv_obj_set_size(row_21, LV_PCT(100), row_height);
    lv_obj_set_flex_flow(row_21, LV_FLEX_FLOW_ROW);
    lv_obj_set_style_pad_all(row_21, 0, LV_PART_MAIN);
    lv_obj_set_style_bg_opa(row_21, LV_OPA_TRANSP, LV_PART_MAIN);
    lv_obj_set_style_border_width(row_21, 0, LV_PART_MAIN);
    lv_obj_set_style_pad_column(row_21, padding, LV_PART_MAIN);

    lv_obj_set_flex_align(row_21,
                          LV_FLEX_ALIGN_START,
                          LV_FLEX_ALIGN_CENTER,
                          LV_FLEX_ALIGN_CENTER);

    if (show_scrollbar) lv_obj_set_scrollbar_mode(row_21, LV_SCROLLBAR_MODE_AUTO);
    else lv_obj_set_scrollbar_mode(row_21, LV_SCROLLBAR_MODE_OFF);

    if (enable_scrolling) lv_obj_set_scroll_dir(row_21, LV_DIR_ALL);
    else lv_obj_set_scroll_dir(row_21, LV_DIR_NONE);

    label_width_0 = 250;
    value_width_0 = ((width_px) - label_width_0) - padding * 4;
    obj_height = row_height - 6;

    result.lbl_speed = create_label(
        row_21,
        label_width_0,
        obj_height,
        LV_ALIGN_CENTER,
        0,
        0,
        "[GPS] Speed",
        LV_TEXT_ALIGN_LEFT,
        &cobalt_alien_17,
        false,
        false,
        false,
        2,
        general_radius,
        1
    );

    result.val_speed = create_label(
        row_21,
        value_width_0,
        obj_height,
        LV_ALIGN_CENTER,
        0,
        0,
        "",
        LV_TEXT_ALIGN_CENTER,
        &cobalt_alien_17,
        false,
        false,
        false,
        2,
        general_radius,
        1
    );

    lv_obj_set_size(result.lbl_speed, label_width_0, obj_height);
    lv_obj_set_size(result.val_speed, value_width_0, obj_height);

    /* ---------------------------------------------------------- */
    /* Row User Speed                                             */
    /* ---------------------------------------------------------- */

    lv_obj_t * row_user_speed = lv_obj_create(result.panel);
    lv_obj_set_size(row_user_speed, LV_PCT(100), row_height);
    lv_obj_set_flex_flow(row_user_speed, LV_FLEX_FLOW_ROW);
    lv_obj_set_style_pad_all(row_user_speed, 0, LV_PART_MAIN);
    lv_obj_set_style_bg_opa(row_user_speed, LV_OPA_TRANSP, LV_PART_MAIN);
    lv_obj_set_style_border_width(row_user_speed, 0, LV_PART_MAIN);
    lv_obj_set_style_pad_column(row_user_speed, padding, LV_PART_MAIN);

    lv_obj_set_flex_align(row_user_speed,
                          LV_FLEX_ALIGN_START,
                          LV_FLEX_ALIGN_CENTER,
                          LV_FLEX_ALIGN_CENTER);

    if (show_scrollbar) lv_obj_set_scrollbar_mode(row_user_speed, LV_SCROLLBAR_MODE_AUTO);
    else lv_obj_set_scrollbar_mode(row_user_speed, LV_SCROLLBAR_MODE_OFF);

    if (enable_scrolling) lv_obj_set_scroll_dir(row_user_speed, LV_DIR_ALL);
    else lv_obj_set_scroll_dir(row_user_speed, LV_DIR_NONE);

    result.lbl_user_speed = create_label(
        row_user_speed,
        label_width_0,
        obj_height,
        LV_ALIGN_CENTER,
        0,
        0,
        "[USER] Speed",
        LV_TEXT_ALIGN_LEFT,
        &cobalt_alien_17,
        false,
        false,
        false,
        2,
        general_radius,
        1
    );

    result.ta_user_speed = create_textarea(
        row_user_speed,
        value_width_0,
        obj_height,
        LV_ALIGN_CENTER,
        0,
        0,
        true,
        "0123456789.-",
        "0",
        false,
        false,
        false,
        &cobalt_alien_17,
        LV_TEXT_ALIGN_CENTER
    );
    lv_obj_add_event_cb(result.ta_user_speed, set_keyboard_context_cb, LV_EVENT_ALL, NULL);
    lv_obj_set_user_data(result.ta_user_speed, &user_speed_ctx);

