holographicSol/SatIO_ESPIDF_Waveshare_ESP32-P4_Round_Display/satio_lvgl.cpp
    lv_obj_set_size(result.lbl_user_speed, label_width_0, obj_height);
    lv_obj_set_size(result.ta_user_speed, value_width_0, obj_height);

    /* ---------------------------------------------------------- */
    /* Title Heading                                              */
    /* ---------------------------------------------------------- */
    lv_obj_t * row_title_heading = lv_obj_create(result.panel);
    lv_obj_set_size(row_title_heading, LV_PCT(100), row_height);
    lv_obj_set_flex_flow(row_title_heading, LV_FLEX_FLOW_ROW);
    lv_obj_set_style_pad_all(row_title_heading, 0, LV_PART_MAIN);
    lv_obj_set_style_bg_opa(row_title_heading, LV_OPA_TRANSP, LV_PART_MAIN);
    lv_obj_set_style_border_width(row_title_heading, 0, LV_PART_MAIN);
    lv_obj_set_style_pad_column(row_title_heading, padding, LV_PART_MAIN);

    lv_obj_set_flex_align(row_title_heading,
                          LV_FLEX_ALIGN_START,
                          LV_FLEX_ALIGN_CENTER,
                          LV_FLEX_ALIGN_CENTER);

    if (show_scrollbar) lv_obj_set_scrollbar_mode(row_title_heading, LV_SCROLLBAR_MODE_AUTO);
    else lv_obj_set_scrollbar_mode(row_title_heading, LV_SCROLLBAR_MODE_OFF);

    if (enable_scrolling) lv_obj_set_scroll_dir(row_title_heading, LV_DIR_ALL);
    else lv_obj_set_scroll_dir(row_title_heading, LV_DIR_NONE);

    label_width_0 = width_px - padding * 4;

    result.lbl_title_heading= create_label(
        row_title_heading,
        label_width_0,
        obj_height,
        LV_ALIGN_CENTER,
        0,
        0,
        "HEADING",
        LV_TEXT_ALIGN_CENTER,
        &cobalt_alien_17,
        false,
        false,
        false,
        2,
        general_radius,
        1
    );

    lv_obj_set_size(result.lbl_title_heading, label_width_0, obj_height);

    /* ---------------------------------------------------------- */
    /* Row GPS Ground Heading Name                                */
    /* ---------------------------------------------------------- */

    lv_obj_t * row_25 = lv_obj_create(result.panel);
    lv_obj_set_size(row_25, LV_PCT(100), row_height);
    lv_obj_set_flex_flow(row_25, LV_FLEX_FLOW_ROW);
    lv_obj_set_style_pad_all(row_25, 0, LV_PART_MAIN);
    lv_obj_set_style_bg_opa(row_25, LV_OPA_TRANSP, LV_PART_MAIN);
    lv_obj_set_style_border_width(row_25, 0, LV_PART_MAIN);
    lv_obj_set_style_pad_column(row_25, padding, LV_PART_MAIN);

    lv_obj_set_flex_align(row_25,
                          LV_FLEX_ALIGN_START,
                          LV_FLEX_ALIGN_CENTER,
                          LV_FLEX_ALIGN_CENTER);

    if (show_scrollbar) lv_obj_set_scrollbar_mode(row_25, LV_SCROLLBAR_MODE_AUTO);
    else lv_obj_set_scrollbar_mode(row_25, LV_SCROLLBAR_MODE_OFF);

    if (enable_scrolling) lv_obj_set_scroll_dir(row_25, LV_DIR_ALL);
    else lv_obj_set_scroll_dir(row_25, LV_DIR_NONE);

    label_width_0 = 250;
    value_width_0 = ((width_px) - label_width_0) - padding * 4;
    obj_height = row_height - 6;

    result.lbl_ground_heading_name = create_label(
        row_25,
        label_width_0,
        obj_height,
        LV_ALIGN_CENTER,
        0,
        0,
        "[GPS] GH Name",
        LV_TEXT_ALIGN_LEFT,
        &cobalt_alien_17,
        false,
        false,
        false,
        2,
        general_radius,
        1
    );

    result.val_ground_heading_name = create_label(
        row_25,
        value_width_0,
        obj_height,
        LV_ALIGN_CENTER,
        0,
        0,
        "",
        LV_TEXT_ALIGN_CENTER,
        &cobalt_alien_17,
        false,
        false,
        false,
        2,
        general_radius,
        1
    );

    lv_obj_set_size(result.lbl_ground_heading_name, label_width_0, obj_height);
    lv_obj_set_size(result.val_ground_heading_name, value_width_0, obj_height);

    /* ---------------------------------------------------------- */
    /* Row GPS Ground Heading                                     */
    /* ---------------------------------------------------------- */

    lv_obj_t * row_26 = lv_obj_create(result.panel);
    lv_obj_set_size(row_26, LV_PCT(100), row_height);
    lv_obj_set_flex_flow(row_26, LV_FLEX_FLOW_ROW);
    lv_obj_set_style_pad_all(row_26, 0, LV_PART_MAIN);
    lv_obj_set_style_bg_opa(row_26, LV_OPA_TRANSP, LV_PART_MAIN);
    lv_obj_set_style_border_width(row_26, 0, LV_PART_MAIN);
    lv_obj_set_style_pad_column(row_26, padding, LV_PART_MAIN);

    lv_obj_set_flex_align(row_26,
                          LV_FLEX_ALIGN_START,
                          LV_FLEX_ALIGN_CENTER,
                          LV_FLEX_ALIGN_CENTER);

    if (show_scrollbar) lv_obj_set_scrollbar_mode(row_26, LV_SCROLLBAR_MODE_AUTO);
    else lv_obj_set_scrollbar_mode(row_26, LV_SCROLLBAR_MODE_OFF);

    if (enable_scrolling) lv_obj_set_scroll_dir(row_26, LV_DIR_ALL);
    else lv_obj_set_scroll_dir(row_26, LV_DIR_NONE);

    result.lbl_ground_heading = create_label(
        row_26,
        label_width_0,
        obj_height,
        LV_ALIGN_CENTER,
        0,
        0,
        "[GPS] Ground Heading",
        LV_TEXT_ALIGN_LEFT,
        &cobalt_alien_17,
        false,
        false,
        false,
        2,
        general_radius,
        1
    );

    result.val_ground_heading = create_label(
        row_26,
        value_width_0,
        obj_height,
        LV_ALIGN_CENTER,
        0,
        0,
        "",
        LV_TEXT_ALIGN_CENTER,
        &cobalt_alien_17,
        false,
        false,
        false,
        2,
        general_radius,
        1
    );

    lv_obj_set_size(result.lbl_ground_heading, label_width_0, obj_height);
    lv_obj_set_size(result.val_ground_heading, value_width_0, obj_height);

    /* ---------------------------------------------------------- */
    /* Row User Ground Heading                                    */
    /* ---------------------------------------------------------- */

    lv_obj_t * row_user_gh = lv_obj_create(result.panel);
    lv_obj_set_size(row_user_gh, LV_PCT(100), row_height);
    lv_obj_set_flex_flow(row_user_gh, LV_FLEX_FLOW_ROW);
    lv_obj_set_style_pad_all(row_user_gh, 0, LV_PART_MAIN);
    lv_obj_set_style_bg_opa(row_user_gh, LV_OPA_TRANSP, LV_PART_MAIN);
    lv_obj_set_style_border_width(row_user_gh, 0, LV_PART_MAIN);
    lv_obj_set_style_pad_column(row_user_gh, padding, LV_PART_MAIN);

