holographicSol/SatIO_ESPIDF_Waveshare_ESP32-P4_Round_Display/satio_lvgl.cpp
    lv_obj_set_flex_align(row_user_gh,
                          LV_FLEX_ALIGN_START,
                          LV_FLEX_ALIGN_CENTER,
                          LV_FLEX_ALIGN_CENTER);

    if (show_scrollbar) lv_obj_set_scrollbar_mode(row_user_gh, LV_SCROLLBAR_MODE_AUTO);
    else lv_obj_set_scrollbar_mode(row_user_gh, LV_SCROLLBAR_MODE_OFF);

    if (enable_scrolling) lv_obj_set_scroll_dir(row_user_gh, LV_DIR_ALL);
    else lv_obj_set_scroll_dir(row_user_gh, LV_DIR_NONE);

    result.lbl_user_ground_heading = create_label(
        row_user_gh,
        label_width_0,
        obj_height,
        LV_ALIGN_CENTER,
        0,
        0,
        "[USER] Ground Heading",
        LV_TEXT_ALIGN_LEFT,
        &cobalt_alien_17,
        false,
        false,
        false,
        2,
        general_radius,
        1
    );

    result.ta_user_ground_heading = create_textarea(
        row_user_gh,
        value_width_0,
        obj_height,
        LV_ALIGN_CENTER,
        0,
        0,
        true,
        "0123456789.-",
        "0",
        false,
        false,
        false,
        &cobalt_alien_17,
        LV_TEXT_ALIGN_CENTER
    );
    lv_obj_add_event_cb(result.ta_user_ground_heading, set_keyboard_context_cb, LV_EVENT_ALL, NULL);
    lv_obj_set_user_data(result.ta_user_ground_heading, &user_ground_heading_ctx);

    lv_obj_set_size(result.lbl_user_ground_heading, label_width_0, obj_height);
    lv_obj_set_size(result.ta_user_ground_heading, value_width_0, obj_height);

    /* ---------------------------------------------------------- */
    /* Title Mileage                                              */
    /* ---------------------------------------------------------- */
    lv_obj_t * row_title_mileage = lv_obj_create(result.panel);
    lv_obj_set_size(row_title_mileage, LV_PCT(100), row_height);
    lv_obj_set_flex_flow(row_title_mileage, LV_FLEX_FLOW_ROW);
    lv_obj_set_style_pad_all(row_title_mileage, 0, LV_PART_MAIN);
    lv_obj_set_style_bg_opa(row_title_mileage, LV_OPA_TRANSP, LV_PART_MAIN);
    lv_obj_set_style_border_width(row_title_mileage, 0, LV_PART_MAIN);
    lv_obj_set_style_pad_column(row_title_mileage, padding, LV_PART_MAIN);

    lv_obj_set_flex_align(row_title_mileage,
                          LV_FLEX_ALIGN_START,
                          LV_FLEX_ALIGN_CENTER,
                          LV_FLEX_ALIGN_CENTER);

    if (show_scrollbar) lv_obj_set_scrollbar_mode(row_title_mileage, LV_SCROLLBAR_MODE_AUTO);
    else lv_obj_set_scrollbar_mode(row_title_mileage, LV_SCROLLBAR_MODE_OFF);

    if (enable_scrolling) lv_obj_set_scroll_dir(row_title_mileage, LV_DIR_ALL);
    else lv_obj_set_scroll_dir(row_title_mileage, LV_DIR_NONE);

    label_width_0 = width_px - padding * 4;

    result.lbl_title_mileage= create_label(
        row_title_mileage,
        label_width_0,
        obj_height,
        LV_ALIGN_CENTER,
        0,
        0,
        "MILEAGE",
        LV_TEXT_ALIGN_CENTER,
        &cobalt_alien_17,
        false,
        false,
        false,
        2,
        general_radius,
        1
    );

    lv_obj_set_size(result.lbl_title_mileage, label_width_0, obj_height);

    /* ---------------------------------------------------------- */
    /* Row 28: Mileage                                            */
    /* ---------------------------------------------------------- */

    lv_obj_t * row_28 = lv_obj_create(result.panel);
    lv_obj_set_size(row_28, LV_PCT(100), row_height);
    lv_obj_set_flex_flow(row_28, LV_FLEX_FLOW_ROW);
    lv_obj_set_style_pad_all(row_28, 0, LV_PART_MAIN);
    lv_obj_set_style_bg_opa(row_28, LV_OPA_TRANSP, LV_PART_MAIN);
    lv_obj_set_style_border_width(row_28, 0, LV_PART_MAIN);
    lv_obj_set_style_pad_column(row_28, padding, LV_PART_MAIN);

    lv_obj_set_flex_align(row_28,
                          LV_FLEX_ALIGN_START,
                          LV_FLEX_ALIGN_CENTER,
                          LV_FLEX_ALIGN_CENTER);

    if (show_scrollbar) lv_obj_set_scrollbar_mode(row_28, LV_SCROLLBAR_MODE_AUTO);
    else lv_obj_set_scrollbar_mode(row_28, LV_SCROLLBAR_MODE_OFF);

    if (enable_scrolling) lv_obj_set_scroll_dir(row_28, LV_DIR_ALL);
    else lv_obj_set_scroll_dir(row_28, LV_DIR_NONE);

    label_width_0 = 250;
    value_width_0 = ((width_px) - label_width_0) - padding * 4;
    obj_height = row_height - 6;

    result.lbl_mileage = create_label(
        row_28,
        label_width_0,
        obj_height,
        LV_ALIGN_CENTER,
        0,
        0,
        "Mileage",
        LV_TEXT_ALIGN_LEFT,
        &cobalt_alien_17,
        false,
        false,
        false,
        2,
        general_radius,
        1
    );

    result.val_mileage = create_label(
        row_28,
        value_width_0,
        obj_height,
        LV_ALIGN_CENTER,
        0,
        0,
        "",
        LV_TEXT_ALIGN_CENTER,
        &cobalt_alien_17,
        false,
        false,
        false,
        2,
        general_radius,
        1
    );

    lv_obj_set_size(result.lbl_mileage, label_width_0, obj_height);
    lv_obj_set_size(result.val_mileage, value_width_0, obj_height);

    /* ---------------------------------------------------------- */
    /* Title Local Time                                           */
    /* ---------------------------------------------------------- */
    lv_obj_t * row_title_local_time = lv_obj_create(result.panel);
    lv_obj_set_size(row_title_local_time, LV_PCT(100), row_height);
    lv_obj_set_flex_flow(row_title_local_time, LV_FLEX_FLOW_ROW);
    lv_obj_set_style_pad_all(row_title_local_time, 0, LV_PART_MAIN);
    lv_obj_set_style_bg_opa(row_title_local_time, LV_OPA_TRANSP, LV_PART_MAIN);
    lv_obj_set_style_border_width(row_title_local_time, 0, LV_PART_MAIN);
    lv_obj_set_style_pad_column(row_title_local_time, padding, LV_PART_MAIN);

    lv_obj_set_flex_align(row_title_local_time,
                          LV_FLEX_ALIGN_START,
                          LV_FLEX_ALIGN_CENTER,
                          LV_FLEX_ALIGN_CENTER);

    if (show_scrollbar) lv_obj_set_scrollbar_mode(row_title_local_time, LV_SCROLLBAR_MODE_AUTO);
    else lv_obj_set_scrollbar_mode(row_title_local_time, LV_SCROLLBAR_MODE_OFF);

    if (enable_scrolling) lv_obj_set_scroll_dir(row_title_local_time, LV_DIR_ALL);
    else lv_obj_set_scroll_dir(row_title_local_time, LV_DIR_NONE);

