holographicSol/SatIO_ESPIDF_Waveshare_ESP32-P4_Round_Display/satio_lvgl.cpp
    label_width_0 = width_px - padding * 4;

    result.lbl_title_local_time= create_label(
        row_title_local_time,
        label_width_0,
        obj_height,
        LV_ALIGN_CENTER,
        0,
        0,
        "LOCAL TIME",
        LV_TEXT_ALIGN_CENTER,
        &cobalt_alien_17,
        false,
        false,
        false,
        2,
        general_radius,
        1
    );

    lv_obj_set_size(result.lbl_title_local_time, label_width_0, obj_height);

    /* ---------------------------------------------------------- */
    /* Row 14: UTC Second Offset                                  */
    /* ---------------------------------------------------------- */

    lv_obj_t * row_14 = lv_obj_create(result.panel);
    lv_obj_set_size(row_14, LV_PCT(100), row_height);
    lv_obj_set_flex_flow(row_14, LV_FLEX_FLOW_ROW);
    lv_obj_set_style_pad_all(row_14, 0, LV_PART_MAIN);
    lv_obj_set_style_bg_opa(row_14, LV_OPA_TRANSP, LV_PART_MAIN);
    lv_obj_set_style_border_width(row_14, 0, LV_PART_MAIN);
    lv_obj_set_style_pad_column(row_14, padding, LV_PART_MAIN);

    lv_obj_set_flex_align(row_14,
                          LV_FLEX_ALIGN_START,
                          LV_FLEX_ALIGN_CENTER,
                          LV_FLEX_ALIGN_CENTER);

    if (show_scrollbar) lv_obj_set_scrollbar_mode(row_14, LV_SCROLLBAR_MODE_AUTO);
    else lv_obj_set_scrollbar_mode(row_14, LV_SCROLLBAR_MODE_OFF);

    if (enable_scrolling) lv_obj_set_scroll_dir(row_14, LV_DIR_ALL);
    else lv_obj_set_scroll_dir(row_14, LV_DIR_NONE);

    label_width_0 = 250;
    value_width_0 = ((width_px) - label_width_0) - padding * 4;
    obj_height = row_height - 6;

    result.lbl_utc_second_offset = create_label(
        row_14,
        label_width_0,
        obj_height,
        LV_ALIGN_CENTER,
        0,
        0,
        "UTC Offset (s)",
        LV_TEXT_ALIGN_LEFT,
        &cobalt_alien_17,
        false,
        false,
        false,
        2,
        general_radius,
        1
    );

    result.ta_utc_second_offset = create_textarea(
        row_14,
        value_width_0,
        obj_height,
        LV_ALIGN_CENTER,
        0,
        0,
        true,
        "0123456789-",
        "0",
        false,
        false,
        false,
        &cobalt_alien_17,
        LV_TEXT_ALIGN_CENTER
    );
    lv_obj_add_event_cb(result.ta_utc_second_offset, set_keyboard_context_cb, LV_EVENT_ALL, NULL);
    lv_obj_set_user_data(result.ta_utc_second_offset, &user_utc_offset_seconds_ctx);

    lv_obj_set_size(result.lbl_utc_second_offset, label_width_0, obj_height);
    lv_obj_set_size(result.ta_utc_second_offset, value_width_0, obj_height);

    /* ---------------------------------------------------------- */
    /* Row 15: UTC Auto Offset Flag                               */
    /* ---------------------------------------------------------- */

    lv_obj_t * row_15 = lv_obj_create(result.panel);
    lv_obj_set_size(row_15, LV_PCT(100), row_height);
    lv_obj_set_flex_flow(row_15, LV_FLEX_FLOW_ROW);
    lv_obj_set_style_pad_all(row_15, 0, LV_PART_MAIN);
    lv_obj_set_style_bg_opa(row_15, LV_OPA_TRANSP, LV_PART_MAIN);
    lv_obj_set_style_border_width(row_15, 0, LV_PART_MAIN);
    lv_obj_set_style_pad_column(row_15, padding, LV_PART_MAIN);

    lv_obj_set_flex_align(row_15,
                          LV_FLEX_ALIGN_START,
                          LV_FLEX_ALIGN_CENTER,
                          LV_FLEX_ALIGN_CENTER);

    if (show_scrollbar) lv_obj_set_scrollbar_mode(row_15, LV_SCROLLBAR_MODE_AUTO);
    else lv_obj_set_scrollbar_mode(row_15, LV_SCROLLBAR_MODE_OFF);

    if (enable_scrolling) lv_obj_set_scroll_dir(row_15, LV_DIR_ALL);
    else lv_obj_set_scroll_dir(row_15, LV_DIR_NONE);

    result.lbl_utc_auto_offset_flag = create_label(
        row_15,
        label_width_0,
        obj_height,
        LV_ALIGN_CENTER,
        0,
        0,
        "Auto UTC Offset",
        LV_TEXT_ALIGN_LEFT,
        &cobalt_alien_17,
        false,
        false,
        false,
        2,
        general_radius,
        1
    );

    result.val_utc_auto_offset_flag = create_label(
        row_15,
        value_width_0,
        obj_height,
        LV_ALIGN_CENTER,
        0,
        0,
        "",
        LV_TEXT_ALIGN_CENTER,
        &cobalt_alien_17,
        false,
        false,
        false,
        2,
        general_radius,
        1
    );

    lv_obj_set_size(result.lbl_utc_auto_offset_flag, label_width_0, obj_height);
    lv_obj_set_size(result.val_utc_auto_offset_flag, value_width_0, obj_height);

    /* ---------------------------------------------------------- */
    /* Row 16: Set Time Automatically                             */
    /* ---------------------------------------------------------- */

    lv_obj_t * row_16 = lv_obj_create(result.panel);
    lv_obj_set_size(row_16, LV_PCT(100), row_height);
    lv_obj_set_flex_flow(row_16, LV_FLEX_FLOW_ROW);
    lv_obj_set_style_pad_all(row_16, 0, LV_PART_MAIN);
    lv_obj_set_style_bg_opa(row_16, LV_OPA_TRANSP, LV_PART_MAIN);
    lv_obj_set_style_border_width(row_16, 0, LV_PART_MAIN);
    lv_obj_set_style_pad_column(row_16, padding, LV_PART_MAIN);

    lv_obj_set_flex_align(row_16,
                          LV_FLEX_ALIGN_START,
                          LV_FLEX_ALIGN_CENTER,
                          LV_FLEX_ALIGN_CENTER);

    if (show_scrollbar) lv_obj_set_scrollbar_mode(row_16, LV_SCROLLBAR_MODE_AUTO);
    else lv_obj_set_scrollbar_mode(row_16, LV_SCROLLBAR_MODE_OFF);

    if (enable_scrolling) lv_obj_set_scroll_dir(row_16, LV_DIR_ALL);
    else lv_obj_set_scroll_dir(row_16, LV_DIR_NONE);

    result.lbl_set_time_automatically = create_label(
        row_16,
        label_width_0,
        obj_height,
        LV_ALIGN_CENTER,
        0,
        0,
        "Auto Time Set",
        LV_TEXT_ALIGN_LEFT,
        &cobalt_alien_17,
        false,
        false,
        false,
        2,
        general_radius,
        1
    );

    result.val_set_time_automatically = create_label(
        row_16,
        value_width_0,
        obj_height,
        LV_ALIGN_CENTER,
        0,
        0,
        "",
        LV_TEXT_ALIGN_CENTER,
        &cobalt_alien_17,
        false,
        false,
        false,
        2,
        general_radius,
        1
    );

