holographicSol/SatIO_ESPIDF_Waveshare_ESP32-P4_Round_Display/satio_lvgl.cpp
    lv_obj_set_flex_align(row_3,
                          LV_FLEX_ALIGN_START,
                          LV_FLEX_ALIGN_CENTER,
                          LV_FLEX_ALIGN_CENTER);

    if (show_scrollbar) lv_obj_set_scrollbar_mode(row_3, LV_SCROLLBAR_MODE_AUTO);
    else lv_obj_set_scrollbar_mode(row_3, LV_SCROLLBAR_MODE_OFF);

    if (enable_scrolling) lv_obj_set_scroll_dir(row_3, LV_DIR_ALL);
    else lv_obj_set_scroll_dir(row_3, LV_DIR_NONE);

    result.lbl_formatted_local_time = create_label(
        row_3,
        label_width_0,
        obj_height,
        LV_ALIGN_CENTER,
        0,
        0,
        "Local Time",
        LV_TEXT_ALIGN_LEFT,
        &cobalt_alien_17,
        false,
        false,
        false,
        2,
        general_radius,
        1
    );

    result.val_formatted_local_time = create_label(
        row_3,
        value_width_0,
        obj_height,
        LV_ALIGN_CENTER,
        0,
        0,
        "",
        LV_TEXT_ALIGN_CENTER,
        &cobalt_alien_17,
        false,
        false,
        false,
        2,
        general_radius,
        1
    );

    lv_obj_set_size(result.lbl_formatted_local_time, label_width_0, obj_height);
    lv_obj_set_size(result.val_formatted_local_time, value_width_0, obj_height);

    /* ---------------------------------------------------------- */
    /* Row 4: Formatted Local Date                                */
    /* ---------------------------------------------------------- */

    lv_obj_t * row_4 = lv_obj_create(result.panel);
    lv_obj_set_size(row_4, LV_PCT(100), row_height);
    lv_obj_set_flex_flow(row_4, LV_FLEX_FLOW_ROW);
    lv_obj_set_style_pad_all(row_4, 0, LV_PART_MAIN);
    lv_obj_set_style_bg_opa(row_4, LV_OPA_TRANSP, LV_PART_MAIN);
    lv_obj_set_style_border_width(row_4, 0, LV_PART_MAIN);
    lv_obj_set_style_pad_column(row_4, padding, LV_PART_MAIN);

    lv_obj_set_flex_align(row_4,
                          LV_FLEX_ALIGN_START,
                          LV_FLEX_ALIGN_CENTER,
                          LV_FLEX_ALIGN_CENTER);

    if (show_scrollbar) lv_obj_set_scrollbar_mode(row_4, LV_SCROLLBAR_MODE_AUTO);
    else lv_obj_set_scrollbar_mode(row_4, LV_SCROLLBAR_MODE_OFF);

    if (enable_scrolling) lv_obj_set_scroll_dir(row_4, LV_DIR_ALL);
    else lv_obj_set_scroll_dir(row_4, LV_DIR_NONE);

    result.lbl_formatted_local_date = create_label(
        row_4,
        label_width_0,
        obj_height,
        LV_ALIGN_CENTER,
        0,
        0,
        "Local Date",
        LV_TEXT_ALIGN_LEFT,
        &cobalt_alien_17,
        false,
        false,
        false,
        2,
        general_radius,
        1
    );

    result.val_formatted_local_date = create_label(
        row_4,
        value_width_0,
        obj_height,
        LV_ALIGN_CENTER,
        0,
        0,
        "",
        LV_TEXT_ALIGN_CENTER,
        &cobalt_alien_17,
        false,
        false,
        false,
        2,
        general_radius,
        1
    );

    lv_obj_set_size(result.lbl_formatted_local_date, label_width_0, obj_height);
    lv_obj_set_size(result.val_formatted_local_date, value_width_0, obj_height);

    /* ---------------------------------------------------------- */
    /* Row 5: Local Unix Time (μs)                                */
    /* ---------------------------------------------------------- */

    lv_obj_t * row_5 = lv_obj_create(result.panel);
    lv_obj_set_size(row_5, LV_PCT(100), row_height);
    lv_obj_set_flex_flow(row_5, LV_FLEX_FLOW_ROW);
    lv_obj_set_style_pad_all(row_5, 0, LV_PART_MAIN);
    lv_obj_set_style_bg_opa(row_5, LV_OPA_TRANSP, LV_PART_MAIN);
    lv_obj_set_style_border_width(row_5, 0, LV_PART_MAIN);
    lv_obj_set_style_pad_column(row_5, padding, LV_PART_MAIN);

    lv_obj_set_flex_align(row_5,
                          LV_FLEX_ALIGN_START,
                          LV_FLEX_ALIGN_CENTER,
                          LV_FLEX_ALIGN_CENTER);

    if (show_scrollbar) lv_obj_set_scrollbar_mode(row_5, LV_SCROLLBAR_MODE_AUTO);
    else lv_obj_set_scrollbar_mode(row_5, LV_SCROLLBAR_MODE_OFF);

    if (enable_scrolling) lv_obj_set_scroll_dir(row_5, LV_DIR_ALL);
    else lv_obj_set_scroll_dir(row_5, LV_DIR_NONE);

    result.lbl_local_unixtime_us = create_label(
        row_5,
        label_width_0,
        obj_height,
        LV_ALIGN_CENTER,
        0,
        0,
        "Local Unix uS",
        LV_TEXT_ALIGN_LEFT,
        &cobalt_alien_17,
        false,
        false,
        false,
        2,
        general_radius,
        1
    );

    result.val_local_unixtime_us = create_label(
        row_5,
        value_width_0,
        obj_height,
        LV_ALIGN_CENTER,
        0,
        0,
        "",
        LV_TEXT_ALIGN_CENTER,
        &cobalt_alien_17,
        false,
        false,
        false,
        2,
        general_radius,
        1
    );

    lv_obj_set_size(result.lbl_local_unixtime_us, label_width_0, obj_height);
    lv_obj_set_size(result.val_local_unixtime_us, value_width_0, obj_height);

    /* ---------------------------------------------------------- */
    /* Title RTC                                                  */
    /* ---------------------------------------------------------- */
    lv_obj_t * row_title_rtc_time = lv_obj_create(result.panel);
    lv_obj_set_size(row_title_rtc_time, LV_PCT(100), row_height);
    lv_obj_set_flex_flow(row_title_rtc_time, LV_FLEX_FLOW_ROW);
    lv_obj_set_style_pad_all(row_title_rtc_time, 0, LV_PART_MAIN);
    lv_obj_set_style_bg_opa(row_title_rtc_time, LV_OPA_TRANSP, LV_PART_MAIN);
    lv_obj_set_style_border_width(row_title_rtc_time, 0, LV_PART_MAIN);
    lv_obj_set_style_pad_column(row_title_rtc_time, padding, LV_PART_MAIN);

    lv_obj_set_flex_align(row_title_rtc_time,
                          LV_FLEX_ALIGN_START,
                          LV_FLEX_ALIGN_CENTER,
                          LV_FLEX_ALIGN_CENTER);

