holographicSol/SatIO_ESPIDF_Waveshare_ESP32-P4_Round_Display/satio_lvgl.cpp
    if (show_scrollbar) lv_obj_set_scrollbar_mode(row_title_rtc_time, LV_SCROLLBAR_MODE_AUTO);
    else lv_obj_set_scrollbar_mode(row_title_rtc_time, LV_SCROLLBAR_MODE_OFF);

    if (enable_scrolling) lv_obj_set_scroll_dir(row_title_rtc_time, LV_DIR_ALL);
    else lv_obj_set_scroll_dir(row_title_rtc_time, LV_DIR_NONE);

    label_width_0 = width_px - padding * 4;

    result.lbl_title_rtc_time= create_label(
        row_title_rtc_time,
        label_width_0,
        obj_height,
        LV_ALIGN_CENTER,
        0,
        0,
        "RTC TIME",
        LV_TEXT_ALIGN_CENTER,
        &cobalt_alien_17,
        false,
        false,
        false,
        2,
        general_radius,
        1
    );

    lv_obj_set_size(result.lbl_title_rtc_time, label_width_0, obj_height);

    /* ---------------------------------------------------------- */
    /* Row 11: Formatted RTC Time                                 */
    /* ---------------------------------------------------------- */

    lv_obj_t * row_11 = lv_obj_create(result.panel);
    lv_obj_set_size(row_11, LV_PCT(100), row_height);
    lv_obj_set_flex_flow(row_11, LV_FLEX_FLOW_ROW);
    lv_obj_set_style_pad_all(row_11, 0, LV_PART_MAIN);
    lv_obj_set_style_bg_opa(row_11, LV_OPA_TRANSP, LV_PART_MAIN);
    lv_obj_set_style_border_width(row_11, 0, LV_PART_MAIN);
    lv_obj_set_style_pad_column(row_11, padding, LV_PART_MAIN);

    lv_obj_set_flex_align(row_11,
                          LV_FLEX_ALIGN_START,
                          LV_FLEX_ALIGN_CENTER,
                          LV_FLEX_ALIGN_CENTER);

    if (show_scrollbar) lv_obj_set_scrollbar_mode(row_11, LV_SCROLLBAR_MODE_AUTO);
    else lv_obj_set_scrollbar_mode(row_11, LV_SCROLLBAR_MODE_OFF);

    if (enable_scrolling) lv_obj_set_scroll_dir(row_11, LV_DIR_ALL);
    else lv_obj_set_scroll_dir(row_11, LV_DIR_NONE);

    label_width_0 = 250;
    value_width_0 = ((width_px) - label_width_0) - padding * 4;
    obj_height = row_height - 6;

    result.lbl_formatted_rtc_time = create_label(
        row_11,
        label_width_0,
        obj_height,
        LV_ALIGN_CENTER,
        0,
        0,
        "RTC Time",
        LV_TEXT_ALIGN_LEFT,
        &cobalt_alien_17,
        false,
        false,
        false,
        2,
        general_radius,
        1
    );

    result.val_formatted_rtc_time = create_label(
        row_11,
        value_width_0,
        obj_height,
        LV_ALIGN_CENTER,
        0,
        0,
        "",
        LV_TEXT_ALIGN_CENTER,
        &cobalt_alien_17,
        false,
        false,
        false,
        2,
        general_radius,
        1
    );

    lv_obj_set_size(result.lbl_formatted_rtc_time, label_width_0, obj_height);
    lv_obj_set_size(result.val_formatted_rtc_time, value_width_0, obj_height);

    /* ---------------------------------------------------------- */
    /* Row 12: Formatted RTC Date                                 */
    /* ---------------------------------------------------------- */

    lv_obj_t * row_12 = lv_obj_create(result.panel);
    lv_obj_set_size(row_12, LV_PCT(100), row_height);
    lv_obj_set_flex_flow(row_12, LV_FLEX_FLOW_ROW);
    lv_obj_set_style_pad_all(row_12, 0, LV_PART_MAIN);
    lv_obj_set_style_bg_opa(row_12, LV_OPA_TRANSP, LV_PART_MAIN);
    lv_obj_set_style_border_width(row_12, 0, LV_PART_MAIN);
    lv_obj_set_style_pad_column(row_12, padding, LV_PART_MAIN);

    lv_obj_set_flex_align(row_12,
                          LV_FLEX_ALIGN_START,
                          LV_FLEX_ALIGN_CENTER,
                          LV_FLEX_ALIGN_CENTER);

    if (show_scrollbar) lv_obj_set_scrollbar_mode(row_12, LV_SCROLLBAR_MODE_AUTO);
    else lv_obj_set_scrollbar_mode(row_12, LV_SCROLLBAR_MODE_OFF);

    if (enable_scrolling) lv_obj_set_scroll_dir(row_12, LV_DIR_ALL);
    else lv_obj_set_scroll_dir(row_12, LV_DIR_NONE);

    result.lbl_formatted_rtc_date = create_label(
        row_12,
        label_width_0,
        obj_height,
        LV_ALIGN_CENTER,
        0,
        0,
        "RTC Date",
        LV_TEXT_ALIGN_LEFT,
        &cobalt_alien_17,
        false,
        false,
        false,
        2,
        general_radius,
        1
    );

    result.val_formatted_rtc_date = create_label(
        row_12,
        value_width_0,
        obj_height,
        LV_ALIGN_CENTER,
        0,
        0,
        "",
        LV_TEXT_ALIGN_CENTER,
        &cobalt_alien_17,
        false,
        false,
        false,
        2,
        general_radius,
        1
    );

    lv_obj_set_size(result.lbl_formatted_rtc_date, label_width_0, obj_height);
    lv_obj_set_size(result.val_formatted_rtc_date, value_width_0, obj_height);

    /* ---------------------------------------------------------- */
    /* Row 13: RTC Unix Time                                      */
    /* ---------------------------------------------------------- */

    lv_obj_t * row_13 = lv_obj_create(result.panel);
    lv_obj_set_size(row_13, LV_PCT(100), row_height);
    lv_obj_set_flex_flow(row_13, LV_FLEX_FLOW_ROW);
    lv_obj_set_style_pad_all(row_13, 0, LV_PART_MAIN);
    lv_obj_set_style_bg_opa(row_13, LV_OPA_TRANSP, LV_PART_MAIN);
    lv_obj_set_style_border_width(row_13, 0, LV_PART_MAIN);
    lv_obj_set_style_pad_column(row_13, padding, LV_PART_MAIN);

    lv_obj_set_flex_align(row_13,
                          LV_FLEX_ALIGN_START,
                          LV_FLEX_ALIGN_CENTER,
                          LV_FLEX_ALIGN_CENTER);

    if (show_scrollbar) lv_obj_set_scrollbar_mode(row_13, LV_SCROLLBAR_MODE_AUTO);
    else lv_obj_set_scrollbar_mode(row_13, LV_SCROLLBAR_MODE_OFF);

    if (enable_scrolling) lv_obj_set_scroll_dir(row_13, LV_DIR_ALL);
    else lv_obj_set_scroll_dir(row_13, LV_DIR_NONE);

    result.lbl_rtc_unixtime = create_label(
        row_13,
        label_width_0,
        obj_height,
        LV_ALIGN_CENTER,
        0,
        0,
        "RTC Unix",
        LV_TEXT_ALIGN_LEFT,
        &cobalt_alien_17,
        false,
        false,
        false,
        2,
        general_radius,
        1
    );

