holographicSol/SatIO_ESPIDF_Waveshare_ESP32-P4_Round_Display/satio_lvgl.cpp
    result.val_rtc_unixtime = create_label(
        row_13,
        value_width_0,
        obj_height,
        LV_ALIGN_CENTER,
        0,
        0,
        "",
        LV_TEXT_ALIGN_CENTER,
        &cobalt_alien_17,
        false,
        false,
        false,
        2,
        general_radius,
        1
    );

    lv_obj_set_size(result.lbl_rtc_unixtime, label_width_0, obj_height);
    lv_obj_set_size(result.val_rtc_unixtime, value_width_0, obj_height);

    /* ---------------------------------------------------------- */
    /* Title RTC Sync                                             */
    /* ---------------------------------------------------------- */
    lv_obj_t * row_title_rtc_sync = lv_obj_create(result.panel);
    lv_obj_set_size(row_title_rtc_sync, LV_PCT(100), row_height);
    lv_obj_set_flex_flow(row_title_rtc_sync, LV_FLEX_FLOW_ROW);
    lv_obj_set_style_pad_all(row_title_rtc_sync, 0, LV_PART_MAIN);
    lv_obj_set_style_bg_opa(row_title_rtc_sync, LV_OPA_TRANSP, LV_PART_MAIN);
    lv_obj_set_style_border_width(row_title_rtc_sync, 0, LV_PART_MAIN);
    lv_obj_set_style_pad_column(row_title_rtc_sync, padding, LV_PART_MAIN);

    lv_obj_set_flex_align(row_title_rtc_sync,
                          LV_FLEX_ALIGN_START,
                          LV_FLEX_ALIGN_CENTER,
                          LV_FLEX_ALIGN_CENTER);

    if (show_scrollbar) lv_obj_set_scrollbar_mode(row_title_rtc_sync, LV_SCROLLBAR_MODE_AUTO);
    else lv_obj_set_scrollbar_mode(row_title_rtc_sync, LV_SCROLLBAR_MODE_OFF);

    if (enable_scrolling) lv_obj_set_scroll_dir(row_title_rtc_sync, LV_DIR_ALL);
    else lv_obj_set_scroll_dir(row_title_rtc_sync, LV_DIR_NONE);

    label_width_0 = width_px - padding * 4;

    result.lbl_title_rtc_sync= create_label(
        row_title_rtc_sync,
        label_width_0,
        obj_height,
        LV_ALIGN_CENTER,
        0,
        0,
        "RTC SYNC",
        LV_TEXT_ALIGN_CENTER,
        &cobalt_alien_17,
        false,
        false,
        false,
        2,
        general_radius,
        1
    );

    lv_obj_set_size(result.lbl_title_rtc_sync, label_width_0, obj_height);

    /* ---------------------------------------------------------- */
    /* Row 6: Formatted RTC Sync Time                             */
    /* ---------------------------------------------------------- */

    lv_obj_t * row_6 = lv_obj_create(result.panel);
    lv_obj_set_size(row_6, LV_PCT(100), row_height);
    lv_obj_set_flex_flow(row_6, LV_FLEX_FLOW_ROW);
    lv_obj_set_style_pad_all(row_6, 0, LV_PART_MAIN);
    lv_obj_set_style_bg_opa(row_6, LV_OPA_TRANSP, LV_PART_MAIN);
    lv_obj_set_style_border_width(row_6, 0, LV_PART_MAIN);
    lv_obj_set_style_pad_column(row_6, padding, LV_PART_MAIN);

    lv_obj_set_flex_align(row_6,
                          LV_FLEX_ALIGN_START,
                          LV_FLEX_ALIGN_CENTER,
                          LV_FLEX_ALIGN_CENTER);

    if (show_scrollbar) lv_obj_set_scrollbar_mode(row_6, LV_SCROLLBAR_MODE_AUTO);
    else lv_obj_set_scrollbar_mode(row_6, LV_SCROLLBAR_MODE_OFF);

    if (enable_scrolling) lv_obj_set_scroll_dir(row_6, LV_DIR_ALL);
    else lv_obj_set_scroll_dir(row_6, LV_DIR_NONE);

    label_width_0 = 250;
    value_width_0 = ((width_px) - label_width_0) - padding * 4;
    obj_height = row_height - 6;

    result.lbl_formatted_rtc_sync_time = create_label(
        row_6,
        label_width_0,
        obj_height,
        LV_ALIGN_CENTER,
        0,
        0,
        "RTC Sync Time",
        LV_TEXT_ALIGN_LEFT,
        &cobalt_alien_17,
        false,
        false,
        false,
        2,
        general_radius,
        1
    );

    result.val_formatted_rtc_sync_time = create_label(
        row_6,
        value_width_0,
        obj_height,
        LV_ALIGN_CENTER,
        0,
        0,
        "",
        LV_TEXT_ALIGN_CENTER,
        &cobalt_alien_17,
        false,
        false,
        false,
        2,
        general_radius,
        1
    );

    lv_obj_set_size(result.lbl_formatted_rtc_sync_time, label_width_0, obj_height);
    lv_obj_set_size(result.val_formatted_rtc_sync_time, value_width_0, obj_height);

    /* ---------------------------------------------------------- */
    /* Row 7: Formatted RTC Sync Date                             */
    /* ---------------------------------------------------------- */

    lv_obj_t * row_7 = lv_obj_create(result.panel);
    lv_obj_set_size(row_7, LV_PCT(100), row_height);
    lv_obj_set_flex_flow(row_7, LV_FLEX_FLOW_ROW);
    lv_obj_set_style_pad_all(row_7, 0, LV_PART_MAIN);
    lv_obj_set_style_bg_opa(row_7, LV_OPA_TRANSP, LV_PART_MAIN);
    lv_obj_set_style_border_width(row_7, 0, LV_PART_MAIN);
    lv_obj_set_style_pad_column(row_7, padding, LV_PART_MAIN);

    lv_obj_set_flex_align(row_7,
                          LV_FLEX_ALIGN_START,
                          LV_FLEX_ALIGN_CENTER,
                          LV_FLEX_ALIGN_CENTER);

    if (show_scrollbar) lv_obj_set_scrollbar_mode(row_7, LV_SCROLLBAR_MODE_AUTO);
    else lv_obj_set_scrollbar_mode(row_7, LV_SCROLLBAR_MODE_OFF);

    if (enable_scrolling) lv_obj_set_scroll_dir(row_7, LV_DIR_ALL);
    else lv_obj_set_scroll_dir(row_7, LV_DIR_NONE);

    result.lbl_formatted_rtc_sync_date = create_label(
        row_7,
        label_width_0,
        obj_height,
        LV_ALIGN_CENTER,
        0,
        0,
        "RTC Sync Date",
        LV_TEXT_ALIGN_LEFT,
        &cobalt_alien_17,
        false,
        false,
        false,
        2,
        general_radius,
        1
    );

    result.val_formatted_rtc_sync_date = create_label(
        row_7,
        value_width_0,
        obj_height,
        LV_ALIGN_CENTER,
        0,
        0,
        "",
        LV_TEXT_ALIGN_CENTER,
        &cobalt_alien_17,
        false,
        false,
        false,
        2,
        general_radius,
        1
    );

