holographicSol/SatIO_ESPIDF_Waveshare_ESP32-P4_Round_Display/satio_lvgl.cpp
    int32_t label_width_0 = 200;
    int32_t value_width_0 = (width_px - label_width_0) - padding * 4;
    int32_t obj_height = row_height - 6;

    /* --- MAIN PANEL ------------------------------------------------------------------ */

    result.panel = lv_obj_create(scr);
    lv_obj_set_size(result.panel, width_px, height_px);
    lv_obj_align(result.panel, alignment, pos_x, pos_y);

    if (show_scrollbar) lv_obj_set_scrollbar_mode(result.panel, LV_SCROLLBAR_MODE_AUTO);
    else lv_obj_set_scrollbar_mode(result.panel, LV_SCROLLBAR_MODE_OFF);

    if (enable_scrolling) lv_obj_set_scroll_dir(result.panel, LV_DIR_ALL);
    else lv_obj_set_scroll_dir(result.panel, LV_DIR_NONE);

    lv_obj_set_style_radius(result.panel, general_radius, LV_PART_MAIN);
    lv_obj_set_style_outline_width(result.panel, outline_width, LV_PART_MAIN);
    lv_obj_set_style_outline_color(result.panel, default_outline_hue, LV_PART_MAIN);
    lv_obj_set_style_border_width(result.panel, border_width, LV_PART_MAIN);
    lv_obj_set_style_border_color(result.panel, default_border_hue, LV_PART_MAIN);
    lv_obj_set_style_bg_color(result.panel, default_bg_hue, LV_PART_MAIN);
    lv_obj_set_style_pad_all(result.panel, padding, LV_PART_MAIN);
    lv_obj_set_scrollbar_mode(result.panel, LV_SCROLLBAR_MODE_AUTO);
    lv_obj_set_flex_flow(result.panel, LV_FLEX_FLOW_COLUMN);
    lv_obj_set_flex_align(result.panel,
                          LV_FLEX_ALIGN_START,
                          LV_FLEX_ALIGN_START,
                          LV_FLEX_ALIGN_START);
    lv_obj_set_style_pad_column(result.panel, padding, LV_PART_MAIN);
    lv_obj_set_style_pad_row(result.panel, row_spacing, LV_PART_MAIN);
    lv_obj_set_style_radius(result.panel, radius, LV_PART_MAIN);
    lv_obj_set_style_outline_pad(result.panel, padding, LV_PART_MAIN);

    /* ---------------------------------------------------------- */
    /* Row 0: Angular X (gyro_0_ang_x)                           */
    /* ---------------------------------------------------------- */

    lv_obj_t * row_0 = lv_obj_create(result.panel);
    lv_obj_set_size(row_0, LV_PCT(100), row_height);
    lv_obj_set_flex_flow(row_0, LV_FLEX_FLOW_ROW);
    lv_obj_set_style_pad_all(row_0, 0, LV_PART_MAIN);
    lv_obj_set_style_bg_opa(row_0, LV_OPA_TRANSP, LV_PART_MAIN);
    lv_obj_set_style_border_width(row_0, 0, LV_PART_MAIN);
    lv_obj_set_style_pad_column(row_0, padding, LV_PART_MAIN);

    lv_obj_set_flex_align(row_0,
                          LV_FLEX_ALIGN_START,
                          LV_FLEX_ALIGN_CENTER,
                          LV_FLEX_ALIGN_CENTER);

    if (show_scrollbar) lv_obj_set_scrollbar_mode(row_0, LV_SCROLLBAR_MODE_AUTO);
    else lv_obj_set_scrollbar_mode(row_0, LV_SCROLLBAR_MODE_OFF);

    if (enable_scrolling) lv_obj_set_scroll_dir(row_0, LV_DIR_ALL);
    else lv_obj_set_scroll_dir(row_0, LV_DIR_NONE);

    result.lbl_gyro_0_ang_x = create_label(
        row_0,
        label_width_0,
        obj_height,
        LV_ALIGN_CENTER,
        0,
        0,
        "Ang X",
        LV_TEXT_ALIGN_LEFT,
        &cobalt_alien_17,
        false,
        false,
        false,
        2,
        general_radius,
        1
    );

    result.val_gyro_0_ang_x = create_label(
        row_0,
        value_width_0,
        obj_height,
        LV_ALIGN_CENTER,
        0,
        0,
        "",
        LV_TEXT_ALIGN_CENTER,
        &cobalt_alien_17,
        false,
        false,
        false,
        2,
        general_radius,
        1
    );

    lv_obj_set_size(result.lbl_gyro_0_ang_x, label_width_0, obj_height);
    lv_obj_set_size(result.val_gyro_0_ang_x, value_width_0, obj_height);

    /* ---------------------------------------------------------- */
    /* Row 1: Angular Y                                           */
    /* ---------------------------------------------------------- */

    lv_obj_t * row_1 = lv_obj_create(result.panel);
    lv_obj_set_size(row_1, LV_PCT(100), row_height);
    lv_obj_set_flex_flow(row_1, LV_FLEX_FLOW_ROW);
    lv_obj_set_style_pad_all(row_1, 0, LV_PART_MAIN);
    lv_obj_set_style_bg_opa(row_1, LV_OPA_TRANSP, LV_PART_MAIN);
    lv_obj_set_style_border_width(row_1, 0, LV_PART_MAIN);
    lv_obj_set_style_pad_column(row_1, padding, LV_PART_MAIN);

    lv_obj_set_flex_align(row_1,
                          LV_FLEX_ALIGN_START,
                          LV_FLEX_ALIGN_CENTER,
                          LV_FLEX_ALIGN_CENTER);

    if (show_scrollbar) lv_obj_set_scrollbar_mode(row_1, LV_SCROLLBAR_MODE_AUTO);
    else lv_obj_set_scrollbar_mode(row_1, LV_SCROLLBAR_MODE_OFF);

    if (enable_scrolling) lv_obj_set_scroll_dir(row_1, LV_DIR_ALL);
    else lv_obj_set_scroll_dir(row_1, LV_DIR_NONE);

    result.lbl_gyro_0_ang_y = create_label(
        row_1,
        label_width_0,
        obj_height,
        LV_ALIGN_CENTER,
        0,
        0,
        "Ang Y",
        LV_TEXT_ALIGN_LEFT,
        &cobalt_alien_17,
        false,
        false,
        false,
        2,
        general_radius,
        1
    );

    result.val_gyro_0_ang_y = create_label(
        row_1,
        value_width_0,
        obj_height,
        LV_ALIGN_CENTER,
        0,
        0,
        "",
        LV_TEXT_ALIGN_CENTER,
        &cobalt_alien_17,
        false,
        false,
        false,
        2,
        general_radius,
        1
    );

    lv_obj_set_size(result.lbl_gyro_0_ang_y, label_width_0, obj_height);
    lv_obj_set_size(result.val_gyro_0_ang_y, value_width_0, obj_height);

    /* ---------------------------------------------------------- */
    /* Row 2: Angular Z                                           */
    /* ---------------------------------------------------------- */

    lv_obj_t * row_2 = lv_obj_create(result.panel);
    lv_obj_set_size(row_2, LV_PCT(100), row_height);
    lv_obj_set_flex_flow(row_2, LV_FLEX_FLOW_ROW);
    lv_obj_set_style_pad_all(row_2, 0, LV_PART_MAIN);
    lv_obj_set_style_bg_opa(row_2, LV_OPA_TRANSP, LV_PART_MAIN);
    lv_obj_set_style_border_width(row_2, 0, LV_PART_MAIN);
    lv_obj_set_style_pad_column(row_2, padding, LV_PART_MAIN);

    lv_obj_set_flex_align(row_2,
                          LV_FLEX_ALIGN_START,
                          LV_FLEX_ALIGN_CENTER,
                          LV_FLEX_ALIGN_CENTER);

    if (show_scrollbar) lv_obj_set_scrollbar_mode(row_2, LV_SCROLLBAR_MODE_AUTO);
    else lv_obj_set_scrollbar_mode(row_2, LV_SCROLLBAR_MODE_OFF);

    if (enable_scrolling) lv_obj_set_scroll_dir(row_2, LV_DIR_ALL);
    else lv_obj_set_scroll_dir(row_2, LV_DIR_NONE);

    result.lbl_gyro_0_ang_z = create_label(
        row_2,
        label_width_0,
        obj_height,
        LV_ALIGN_CENTER,
        0,
        0,
        "Ang Z",
        LV_TEXT_ALIGN_LEFT,
        &cobalt_alien_17,
        false,
        false,
        false,
        2,
        general_radius,
        1
    );

    result.val_gyro_0_ang_z = create_label(
        row_2,
        value_width_0,
        obj_height,
        LV_ALIGN_CENTER,
        0,
        0,
        "",
        LV_TEXT_ALIGN_CENTER,
        &cobalt_alien_17,
        false,
        false,
        false,
        2,
        general_radius,
        1
    );

    lv_obj_set_size(result.lbl_gyro_0_ang_z, label_width_0, obj_height);
    lv_obj_set_size(result.val_gyro_0_ang_z, value_width_0, obj_height);

    /* ---------------------------------------------------------- */
    /* Row 3: Acc X                                               */
    /* ---------------------------------------------------------- */

    lv_obj_t * row_3 = lv_obj_create(result.panel);
    lv_obj_set_size(row_3, LV_PCT(100), row_height);
    lv_obj_set_flex_flow(row_3, LV_FLEX_FLOW_ROW);
    lv_obj_set_style_pad_all(row_3, 0, LV_PART_MAIN);
    lv_obj_set_style_bg_opa(row_3, LV_OPA_TRANSP, LV_PART_MAIN);
    lv_obj_set_style_border_width(row_3, 0, LV_PART_MAIN);
    lv_obj_set_style_pad_column(row_3, padding, LV_PART_MAIN);

