holographicSol/SatIO_ESPIDF_Waveshare_ESP32-P4_Round_Display/satio_lvgl.cpp
    lv_obj_set_flex_align(row_7,
                          LV_FLEX_ALIGN_START,
                          LV_FLEX_ALIGN_CENTER,
                          LV_FLEX_ALIGN_CENTER);

    if (show_scrollbar) lv_obj_set_scrollbar_mode(row_7, LV_SCROLLBAR_MODE_AUTO);
    else lv_obj_set_scrollbar_mode(row_7, LV_SCROLLBAR_MODE_OFF);

    if (enable_scrolling) lv_obj_set_scroll_dir(row_7, LV_DIR_ALL);
    else lv_obj_set_scroll_dir(row_7, LV_DIR_NONE);

    result.lbl_gyro_0_gyr_y = create_label(
        row_7,
        label_width_0,
        obj_height,
        LV_ALIGN_CENTER,
        0,
        0,
        "Gyro Y",
        LV_TEXT_ALIGN_LEFT,
        &cobalt_alien_17,
        false,
        false,
        false,
        2,
        general_radius,
        1
    );

    result.val_gyro_0_gyr_y = create_label(
        row_7,
        value_width_0,
        obj_height,
        LV_ALIGN_CENTER,
        0,
        0,
        "",
        LV_TEXT_ALIGN_CENTER,
        &cobalt_alien_17,
        false,
        false,
        false,
        2,
        general_radius,
        1
    );

    lv_obj_set_size(result.lbl_gyro_0_gyr_y, label_width_0, obj_height);
    lv_obj_set_size(result.val_gyro_0_gyr_y, value_width_0, obj_height);

    /* ---------------------------------------------------------- */
    /* Row 8: Gyro Z                                              */
    /* ---------------------------------------------------------- */

    lv_obj_t * row_8 = lv_obj_create(result.panel);
    lv_obj_set_size(row_8, LV_PCT(100), row_height);
    lv_obj_set_flex_flow(row_8, LV_FLEX_FLOW_ROW);
    lv_obj_set_style_pad_all(row_8, 0, LV_PART_MAIN);
    lv_obj_set_style_bg_opa(row_8, LV_OPA_TRANSP, LV_PART_MAIN);
    lv_obj_set_style_border_width(row_8, 0, LV_PART_MAIN);
    lv_obj_set_style_pad_column(row_8, padding, LV_PART_MAIN);

    lv_obj_set_flex_align(row_8,
                          LV_FLEX_ALIGN_START,
                          LV_FLEX_ALIGN_CENTER,
                          LV_FLEX_ALIGN_CENTER);

    if (show_scrollbar) lv_obj_set_scrollbar_mode(row_8, LV_SCROLLBAR_MODE_AUTO);
    else lv_obj_set_scrollbar_mode(row_8, LV_SCROLLBAR_MODE_OFF);

    if (enable_scrolling) lv_obj_set_scroll_dir(row_8, LV_DIR_ALL);
    else lv_obj_set_scroll_dir(row_8, LV_DIR_NONE);

    result.lbl_gyro_0_gyr_z = create_label(
        row_8,
        label_width_0,
        obj_height,
        LV_ALIGN_CENTER,
        0,
        0,
        "Gyro Z",
        LV_TEXT_ALIGN_LEFT,
        &cobalt_alien_17,
        false,
        false,
        false,
        2,
        general_radius,
        1
    );

    result.val_gyro_0_gyr_z = create_label(
        row_8,
        value_width_0,
        obj_height,
        LV_ALIGN_CENTER,
        0,
        0,
        "",
        LV_TEXT_ALIGN_CENTER,
        &cobalt_alien_17,
        false,
        false,
        false,
        2,
        general_radius,
        1
    );

    lv_obj_set_size(result.lbl_gyro_0_gyr_z, label_width_0, obj_height);
    lv_obj_set_size(result.val_gyro_0_gyr_z, value_width_0, obj_height);

    /* ---------------------------------------------------------- */
    /* Row 9: Mag X                                               */
    /* ---------------------------------------------------------- */

    lv_obj_t * row_9 = lv_obj_create(result.panel);
    lv_obj_set_size(row_9, LV_PCT(100), row_height);
    lv_obj_set_flex_flow(row_9, LV_FLEX_FLOW_ROW);
    lv_obj_set_style_pad_all(row_9, 0, LV_PART_MAIN);
    lv_obj_set_style_bg_opa(row_9, LV_OPA_TRANSP, LV_PART_MAIN);
    lv_obj_set_style_border_width(row_9, 0, LV_PART_MAIN);
    lv_obj_set_style_pad_column(row_9, padding, LV_PART_MAIN);

    lv_obj_set_flex_align(row_9,
                          LV_FLEX_ALIGN_START,
                          LV_FLEX_ALIGN_CENTER,
                          LV_FLEX_ALIGN_CENTER);

    if (show_scrollbar) lv_obj_set_scrollbar_mode(row_9, LV_SCROLLBAR_MODE_AUTO);
    else lv_obj_set_scrollbar_mode(row_9, LV_SCROLLBAR_MODE_OFF);

    if (enable_scrolling) lv_obj_set_scroll_dir(row_9, LV_DIR_ALL);
    else lv_obj_set_scroll_dir(row_9, LV_DIR_NONE);

    result.lbl_gyro_0_mag_x = create_label(
        row_9,
        label_width_0,
        obj_height,
        LV_ALIGN_CENTER,
        0,
        0,
        "Magnetic Field X",
        LV_TEXT_ALIGN_LEFT,
        &cobalt_alien_17,
        false,
        false,
        false,
        2,
        general_radius,
        1
    );

    result.val_gyro_0_mag_x = create_label(
        row_9,
        value_width_0,
        obj_height,
        LV_ALIGN_CENTER,
        0,
        0,
        "",
        LV_TEXT_ALIGN_CENTER,
        &cobalt_alien_17,
        false,
        false,
        false,
        2,
        general_radius,
        1
    );

    lv_obj_set_size(result.lbl_gyro_0_mag_x, label_width_0, obj_height);
    lv_obj_set_size(result.val_gyro_0_mag_x, value_width_0, obj_height);

    /* ---------------------------------------------------------- */
    /* Row 10: Mag Y                                              */
    /* ---------------------------------------------------------- */

    lv_obj_t * row_10 = lv_obj_create(result.panel);
    lv_obj_set_size(row_10, LV_PCT(100), row_height);
    lv_obj_set_flex_flow(row_10, LV_FLEX_FLOW_ROW);
    lv_obj_set_style_pad_all(row_10, 0, LV_PART_MAIN);
    lv_obj_set_style_bg_opa(row_10, LV_OPA_TRANSP, LV_PART_MAIN);
    lv_obj_set_style_border_width(row_10, 0, LV_PART_MAIN);
    lv_obj_set_style_pad_column(row_10, padding, LV_PART_MAIN);

    lv_obj_set_flex_align(row_10,
                          LV_FLEX_ALIGN_START,
                          LV_FLEX_ALIGN_CENTER,
                          LV_FLEX_ALIGN_CENTER);

    if (show_scrollbar) lv_obj_set_scrollbar_mode(row_10, LV_SCROLLBAR_MODE_AUTO);
    else lv_obj_set_scrollbar_mode(row_10, LV_SCROLLBAR_MODE_OFF);

    if (enable_scrolling) lv_obj_set_scroll_dir(row_10, LV_DIR_ALL);
    else lv_obj_set_scroll_dir(row_10, LV_DIR_NONE);

    result.lbl_gyro_0_mag_y = create_label(
        row_10,
        label_width_0,
        obj_height,
        LV_ALIGN_CENTER,
        0,
        0,
        "Magnetic Field Y",
        LV_TEXT_ALIGN_LEFT,
        &cobalt_alien_17,
        false,
        false,
        false,
        2,
        general_radius,
        1
    );

    result.val_gyro_0_mag_y = create_label(
        row_10,
        value_width_0,
        obj_height,
        LV_ALIGN_CENTER,
        0,
        0,
        "",
        LV_TEXT_ALIGN_CENTER,
        &cobalt_alien_17,
        false,
        false,
        false,
        2,
        general_radius,
        1
    );

