holographicSol/SatIO_ESPIDF_Waveshare_ESP32-P4_Round_Display/satio_lvgl.cpp
    lv_obj_set_size(result.lbl_gyro_0_mag_y, label_width_0, obj_height);
    lv_obj_set_size(result.val_gyro_0_mag_y, value_width_0, obj_height);

    /* ---------------------------------------------------------- */
    /* Row 11: Mag Z                                              */
    /* ---------------------------------------------------------- */

    lv_obj_t * row_11 = lv_obj_create(result.panel);
    lv_obj_set_size(row_11, LV_PCT(100), row_height);
    lv_obj_set_flex_flow(row_11, LV_FLEX_FLOW_ROW);
    lv_obj_set_style_pad_all(row_11, 0, LV_PART_MAIN);
    lv_obj_set_style_bg_opa(row_11, LV_OPA_TRANSP, LV_PART_MAIN);
    lv_obj_set_style_border_width(row_11, 0, LV_PART_MAIN);
    lv_obj_set_style_pad_column(row_11, padding, LV_PART_MAIN);

    lv_obj_set_flex_align(row_11,
                          LV_FLEX_ALIGN_START,
                          LV_FLEX_ALIGN_CENTER,
                          LV_FLEX_ALIGN_CENTER);

    if (show_scrollbar) lv_obj_set_scrollbar_mode(row_11, LV_SCROLLBAR_MODE_AUTO);
    else lv_obj_set_scrollbar_mode(row_11, LV_SCROLLBAR_MODE_OFF);

    if (enable_scrolling) lv_obj_set_scroll_dir(row_11, LV_DIR_ALL);
    else lv_obj_set_scroll_dir(row_11, LV_DIR_NONE);

    result.lbl_gyro_0_mag_z = create_label(
        row_11,
        label_width_0,
        obj_height,
        LV_ALIGN_CENTER,
        0,
        0,
        "Magnetic Field Z",
        LV_TEXT_ALIGN_LEFT,
        &cobalt_alien_17,
        false,
        false,
        false,
        2,
        general_radius,
        1
    );

    result.val_gyro_0_mag_z = create_label(
        row_11,
        value_width_0,
        obj_height,
        LV_ALIGN_CENTER,
        0,
        0,
        "",
        LV_TEXT_ALIGN_CENTER,
        &cobalt_alien_17,
        false,
        false,
        false,
        2,
        general_radius,
        1
    );

    lv_obj_set_size(result.lbl_gyro_0_mag_z, label_width_0, obj_height);
    lv_obj_set_size(result.val_gyro_0_mag_z, value_width_0, obj_height);

    /* ---------------------------------------------------------- */
    /* Row 12: Current UI Baud Rate                               */
    /* ---------------------------------------------------------- */

    lv_obj_t * row_12 = lv_obj_create(result.panel);
    lv_obj_set_size(row_12, LV_PCT(100), row_height);
    lv_obj_set_flex_flow(row_12, LV_FLEX_FLOW_ROW);
    lv_obj_set_style_pad_all(row_12, 0, LV_PART_MAIN);
    lv_obj_set_style_bg_opa(row_12, LV_OPA_TRANSP, LV_PART_MAIN);
    lv_obj_set_style_border_width(row_12, 0, LV_PART_MAIN);
    lv_obj_set_style_pad_column(row_12, padding, LV_PART_MAIN);

    lv_obj_set_flex_align(row_12,
                          LV_FLEX_ALIGN_START,
                          LV_FLEX_ALIGN_CENTER,
                          LV_FLEX_ALIGN_CENTER);

    if (show_scrollbar) lv_obj_set_scrollbar_mode(row_12, LV_SCROLLBAR_MODE_AUTO);
    else lv_obj_set_scrollbar_mode(row_12, LV_SCROLLBAR_MODE_OFF);

    if (enable_scrolling) lv_obj_set_scroll_dir(row_12, LV_DIR_ALL);
    else lv_obj_set_scroll_dir(row_12, LV_DIR_NONE);

    result.lbl_gyro_0_current_uiBaud = create_label(
        row_12,
        label_width_0,
        obj_height,
        LV_ALIGN_CENTER,
        0,
        0,
        "Baud Rate",
        LV_TEXT_ALIGN_LEFT,
        &cobalt_alien_17,
        false,
        false,
        false,
        2,
        general_radius,
        1
    );

    result.val_gyro_0_current_uiBaud = create_label(
        row_12,
        value_width_0,
        obj_height,
        LV_ALIGN_CENTER,
        0,
        0,
        "",
        LV_TEXT_ALIGN_CENTER,
        &cobalt_alien_17,
        false,
        false,
        false,
        2,
        general_radius,
        1
    );

    lv_obj_set_size(result.lbl_gyro_0_current_uiBaud, label_width_0, obj_height);
    lv_obj_set_size(result.val_gyro_0_current_uiBaud, value_width_0, obj_height);

    return result;
}

/** ----------------------------------------------------------------------------------------
 * @brief Create Matrix Function Container
 * 
 * Creates a container panel with all elements needed to display/edit matrix function data:
 * - Function Slot
 * - Function Name
 * - XYZ Coordinates (3 values)
 * - Operator Name
 * - Output Mode
 * - Output PWM (2 values)
 * - Port Map
 * 
 * @param scr Pointer to the parent screen object.
 * @param width_px Width of the container in pixels.
 * @param height_px Height of the container in pixels.
 * @param alignment Alignment of the container within its parent/screen.
 * @param pos_x X position of the container.
 * @param pos_y Y position of the container.
 * @return matrix_function_container_t struct with all UI element pointers.
 */
matrix_function_container_t create_matrix_function_container(
    lv_obj_t * scr,
    int32_t width_px,
    int32_t height_px,
    lv_align_t alignment,
    int32_t pos_x,
    int32_t pos_y,
    int32_t radius,
    int32_t padding,
    int32_t row_height,
    int32_t row_spacing,
    bool show_scrollbar,
    bool enable_scrolling,
    const lv_font_t * font_title,
    const lv_font_t * font_sub
) {
    matrix_function_container_t result = {0};

    // Row Object Widths
    int32_t label_width_0 = 80;
    int32_t value_width_0 = ((width_px/2) - label_width_0) - padding*2;
    int32_t label_width_1 = 80;
    int32_t value_width_1 = ((width_px/2) - label_width_1) - padding*2;
    int32_t label_width_2 = 80;
    int32_t value_width_2 = ((width_px/2) - label_width_2) - padding*2;

    int32_t obj_height = row_height-6;

    /* --- MAIN PANEL ------------------------------------------------------------------ */
    
    result.panel = lv_obj_create(scr);
    lv_obj_set_size(result.panel, width_px, height_px);
    lv_obj_align(result.panel, alignment, pos_x, pos_y);

    // Show scrollbar
    if (show_scrollbar) {lv_obj_set_scrollbar_mode(result.panel, LV_SCROLLBAR_MODE_AUTO);}
    else {lv_obj_set_scrollbar_mode(result.panel, LV_SCROLLBAR_MODE_OFF);}

    // Enable scrolling
    if (enable_scrolling) {lv_obj_set_scroll_dir(result.panel, LV_DIR_ALL);}
    else {lv_obj_set_scroll_dir(result.panel, LV_DIR_NONE);}
    
    // Panel style
    lv_obj_set_style_radius(result.panel, general_radius, LV_PART_MAIN);
    lv_obj_set_style_outline_width(result.panel, outline_width, LV_PART_MAIN);
    lv_obj_set_style_outline_color(result.panel, default_outline_hue, LV_PART_MAIN);
    lv_obj_set_style_border_width(result.panel, border_width, LV_PART_MAIN);
    lv_obj_set_style_border_color(result.panel, default_border_hue, LV_PART_MAIN);
    lv_obj_set_style_bg_color(result.panel, default_bg_hue, LV_PART_MAIN);
    lv_obj_set_style_pad_all(result.panel, padding, LV_PART_MAIN);
    lv_obj_set_scrollbar_mode(result.panel, LV_SCROLLBAR_MODE_AUTO);
    lv_obj_set_flex_flow(result.panel, LV_FLEX_FLOW_COLUMN);
    lv_obj_set_flex_align(result.panel, LV_FLEX_ALIGN_START, LV_FLEX_ALIGN_START, LV_FLEX_ALIGN_START);
    lv_obj_set_style_pad_column(result.panel, padding, LV_PART_MAIN);
    lv_obj_set_style_pad_row(result.panel, row_spacing, LV_PART_MAIN);
    lv_obj_set_style_radius(result.panel, radius, LV_PART_MAIN);
    lv_obj_set_style_outline_pad(result.panel, padding, LV_PART_MAIN);

    /* --- Function Slot ------------------------------------------------------- */
    lv_obj_t * row_index = lv_obj_create(result.panel);
    lv_obj_set_size(row_index, LV_PCT(100), row_height);
    lv_obj_set_flex_flow(row_index, LV_FLEX_FLOW_ROW);
    lv_obj_set_style_pad_all(row_index, 0, LV_PART_MAIN);
    lv_obj_set_style_bg_opa(row_index, LV_OPA_TRANSP, LV_PART_MAIN);
    lv_obj_set_style_border_width(row_index, 0, LV_PART_MAIN);
    lv_obj_set_style_pad_column(row_index, padding, LV_PART_MAIN);

    // Critical for alignment
    lv_obj_set_flex_align(
        row_index,
        LV_FLEX_ALIGN_START,   // main axis (left‑right)
        LV_FLEX_ALIGN_CENTER,  // cross axis (top‑bottom)
        LV_FLEX_ALIGN_CENTER   // track alignment
    );

    // Show scrollbar
    if (show_scrollbar) {lv_obj_set_scrollbar_mode(row_index, LV_SCROLLBAR_MODE_AUTO);}
    else {lv_obj_set_scrollbar_mode(row_index, LV_SCROLLBAR_MODE_OFF);}

    // Enable scrolling
    if (enable_scrolling) {lv_obj_set_scroll_dir(row_index, LV_DIR_ALL);}
    else {lv_obj_set_scroll_dir(row_index, LV_DIR_NONE);}

