holographicSol/SatIO_ESPIDF_Waveshare_ESP32-P4_Round_Display/satio_lvgl.cpp
    /* --- X Value ------------------------------------------------------------- */
    
    lv_obj_t * row_value_x = lv_obj_create(result.panel);
    lv_obj_set_size(row_value_x, LV_PCT(100), row_height);
    lv_obj_set_flex_flow(row_value_x, LV_FLEX_FLOW_ROW);
    lv_obj_set_style_pad_all(row_value_x, 0, LV_PART_MAIN);
    lv_obj_set_style_bg_opa(row_value_x, LV_OPA_TRANSP, LV_PART_MAIN);
    lv_obj_set_style_border_width(row_value_x, 0, LV_PART_MAIN);
    lv_obj_set_style_pad_column(row_value_x, padding, LV_PART_MAIN);

    // Critical for alignment
    lv_obj_set_flex_align(
        row_value_x,
        LV_FLEX_ALIGN_START,   // main axis (left‑right)
        LV_FLEX_ALIGN_CENTER,  // cross axis (top‑bottom)
        LV_FLEX_ALIGN_CENTER   // track alignment
    );

    // Show scrollbar
    if (show_scrollbar) {lv_obj_set_scrollbar_mode(row_value_x, LV_SCROLLBAR_MODE_AUTO);}
    else {lv_obj_set_scrollbar_mode(row_value_x, LV_SCROLLBAR_MODE_OFF);}

    // Enable scrolling
    if (enable_scrolling) {lv_obj_set_scroll_dir(row_value_x, LV_DIR_ALL);}
    else {lv_obj_set_scroll_dir(row_value_x, LV_DIR_NONE);}

    // Row Object Widths
    label_width_0 = 20;
    value_width_0 = (((width_px/3) *2) - label_width_0) - padding*3;
    label_width_1 = 0;
    value_width_1 = (((width_px/3) *1) - label_width_1) - padding*2;
    
    // Label X
    result.label_x = create_label(
        row_value_x,          // parent
        label_width_0,        // width
        obj_height,           // height
        LV_ALIGN_CENTER,      // parent alignment
        0,                    // pos x
        0,                    // pos y
        "X",                  // initial text
        LV_TEXT_ALIGN_LEFT,   // font alignment
        &cobalt_alien_17,     // font
        false,                // transparent background
        false,                // show scrollbar
        false,                // enable scrolling
        2,                    // outline width
        general_radius,       // outline radius
        1
    );
    
    // User X
    result.ta_x = create_textarea(
        row_value_x,     // lv_obj_t
        value_width_0,   // width px
        obj_height,      // height px
        LV_ALIGN_CENTER, // alignment
        0,               // pos x
        0,               // pos y
        true,            // one line
        LV_TXT_ALNUMDEC, // accepted char*
        "0",             // placeholder text
        false,           // transparent bg
        false,           // show scrollbars
        false,           // enable scrolling
        font_sub,        // font for labels
        LV_TEXT_ALIGN_CENTER
    );
    lv_textarea_set_text(result.ta_x, String(matrixData.matrix_function_xyz[0][current_matrix_i][current_matrix_function_i][INDEX_MATRIX_FUNTION_X]).c_str());
    lv_obj_invalidate(result.ta_x); // Force redraw
    lv_obj_update_layout(result.ta_x); // Update layout
    lv_obj_add_event_cb(result.ta_x, set_keyboard_context_cb, LV_EVENT_ALL, NULL);
    lv_obj_set_user_data(result.ta_x, &matrix_value_x_ctx);

    // System X
    result.dd_x = create_dropdown_menu(
        row_value_x,
        NULL,
        0,
        value_width_0,
        obj_height,
        LV_ALIGN_CENTER,
        0,
        0,
        font_sub
    );
    char dd_x_name[MAX_GLOBAL_ELEMENT_SIZE];
    for (int i = 0; i < MAX_MATRIX_FUNCTION_NAMES; i++) {
        snprintf(dd_x_name, sizeof(dd_x_name), "%s", matrixData.matrix_function_names[i]);
        lv_dropdown_add_option(result.dd_x, dd_x_name, LV_DROPDOWN_POS_LAST);
    }
    lv_dropdown_set_selected(result.dd_x, matrixData.matrix_function_xyz[0][current_matrix_i][current_matrix_function_i][INDEX_MATRIX_FUNTION_X]);
    lv_obj_add_event_cb(result.dd_x, dd_x_event_cb, LV_EVENT_VALUE_CHANGED, NULL);
    lv_obj_add_flag(result.dd_x, LV_OBJ_FLAG_HIDDEN);

    // X Mode Select
    result.dd_mode_x = create_dropdown_menu(
        row_value_x,
        NULL,
        0,
        value_width_1,
        obj_height,
        LV_ALIGN_CENTER,
        0,
        0,
        font_sub
    );
    char dd_mode_x_name[MAX_GLOBAL_ELEMENT_SIZE];
    for (int i = 0; i < MAX_MATRIX_FUNCTION_XYZ_MODES; i++) {
        snprintf(dd_mode_x_name, sizeof(dd_mode_x_name), "%s", String(matrixData.matrix_function_mode_xyz_name[i]).c_str());
        lv_dropdown_add_option(result.dd_mode_x, dd_mode_x_name, LV_DROPDOWN_POS_LAST);
    }
    lv_dropdown_set_selected(result.dd_mode_x, matrixData.matrix_function_mode_xyz[0][current_matrix_i][current_matrix_function_i][INDEX_MATRIX_FUNTION_X]);
    lv_obj_add_event_cb(result.dd_mode_x, dd_mode_x_event_cb, LV_EVENT_VALUE_CHANGED, NULL);

    // Critical for alignment
    lv_obj_set_size(result.label_x, label_width_0, obj_height);
    lv_obj_set_size(result.ta_x, value_width_0, obj_height);
    lv_obj_set_size(result.dd_x, value_width_0, obj_height);
    lv_obj_set_size(result.dd_mode_x, value_width_1, obj_height);
    
    /* --- Y Value ------------------------------------------------------------- */
    
    lv_obj_t * row_value_y = lv_obj_create(result.panel);
    lv_obj_set_size(row_value_y, LV_PCT(100), row_height);
    lv_obj_set_flex_flow(row_value_y, LV_FLEX_FLOW_ROW);
    lv_obj_set_style_pad_all(row_value_y, 0, LV_PART_MAIN);
    lv_obj_set_style_bg_opa(row_value_y, LV_OPA_TRANSP, LV_PART_MAIN);
    lv_obj_set_style_border_width(row_value_y, 0, LV_PART_MAIN);
    lv_obj_set_style_pad_column(row_value_y, padding, LV_PART_MAIN);

    // Critical for alignment
    lv_obj_set_flex_align(
        row_value_y,
        LV_FLEX_ALIGN_START,   // main axis (left‑right)
        LV_FLEX_ALIGN_CENTER,  // cross axis (top‑bottom)
        LV_FLEX_ALIGN_CENTER   // track alignment
    );
    
    // Show scrollbar
    if (show_scrollbar) {lv_obj_set_scrollbar_mode(row_value_y, LV_SCROLLBAR_MODE_AUTO);}
    else {lv_obj_set_scrollbar_mode(row_value_y, LV_SCROLLBAR_MODE_OFF);}

    // Enable scrolling
    if (enable_scrolling) {lv_obj_set_scroll_dir(row_value_y, LV_DIR_ALL);}
    else {lv_obj_set_scroll_dir(row_value_y, LV_DIR_NONE);}

