holographicSol/SatIO_ESPIDF_Waveshare_ESP32-P4_Round_Display/satio_lvgl.cpp
    // Select Map Mode
    result.dd_slot = create_dropdown_menu(
        row1,
        NULL,
        0,
        value_width_0,
        obj_height,
        LV_ALIGN_CENTER,
        0,
        0,
        font_sub
    );
    char dd_slot_name[MAX_GLOBAL_ELEMENT_SIZE];
    for (int i = 0; i < MAX_MAP_SLOTS; i++) {
        snprintf(dd_slot_name, sizeof(dd_slot_name), "%s", String(i).c_str()); // todo: make human map mode name array in mapping.cpp
        lv_dropdown_add_option(result.dd_slot, dd_slot_name, LV_DROPDOWN_POS_LAST);
    }
    lv_dropdown_set_selected(result.dd_slot, 0);
    lv_obj_add_event_cb(result.dd_slot, dd_current_map_slot_event_cb, LV_EVENT_VALUE_CHANGED, NULL);

    // Critical for alignment
    lv_obj_set_size(result.slot, label_width_0, obj_height);
    lv_obj_set_size(result.dd_slot, value_width_0, obj_height);
    
    /* --- Function Name ------------------------------------------------------- */
    
    lv_obj_t * row2 = lv_obj_create(result.panel);
    lv_obj_set_size(row2, LV_PCT(100), row_height);
    lv_obj_set_flex_flow(row2, LV_FLEX_FLOW_ROW);
    lv_obj_set_style_pad_all(row2, 0, LV_PART_MAIN);
    lv_obj_set_style_bg_opa(row2, LV_OPA_TRANSP, LV_PART_MAIN);
    lv_obj_set_style_border_width(row2, 0, LV_PART_MAIN);
    lv_obj_set_style_pad_column(row2, padding, LV_PART_MAIN);

    // Critical for alignment
    lv_obj_set_flex_align(
        row2,
        LV_FLEX_ALIGN_START,   // main axis (left‑right)
        LV_FLEX_ALIGN_CENTER,  // cross axis (top‑bottom)
        LV_FLEX_ALIGN_CENTER   // track alignment
    );

    // Show scrollbar
    if (show_scrollbar) {lv_obj_set_scrollbar_mode(row2, LV_SCROLLBAR_MODE_AUTO);}
    else {lv_obj_set_scrollbar_mode(row2, LV_SCROLLBAR_MODE_OFF);}

    // Enable scrolling
    if (enable_scrolling) {lv_obj_set_scroll_dir(row2, LV_DIR_ALL);}
    else {lv_obj_set_scroll_dir(row2, LV_DIR_NONE);}

    label_width_0 = 150;
    value_width_0 = ((width_px/1) - label_width_0) - padding*4;
    
    // C0
    result.c0 = create_label(
        row2,                 // parent
        label_width_0,        // width
        obj_height,           // height
        LV_ALIGN_CENTER,      // parent alignment
        0,                    // pos x
        0,                    // pos y
        "C0",                 // initial text
        LV_TEXT_ALIGN_LEFT,   // font alignment
        &cobalt_alien_17,     // font
        false,                // transparent background
        false,                // show scrollbar
        false,                // enable scrolling
        2,                    // outline width
        general_radius,       // outline radius
        1
    );
    
    // Select C0
    result.dd_c0 = create_dropdown_menu(
        row2,
        NULL,
        0,
        value_width_0,
        obj_height,
        LV_ALIGN_CENTER,
        0,
        0,
        font_sub
    );
    char dd_c0_name[MAX_GLOBAL_ELEMENT_SIZE];
    for (int i = 0; i < MAX_MAPPABLE_VALUES; i++) {
        snprintf(dd_c0_name, sizeof(dd_c0_name), "%s", mappingData.char_map_value[i]);
        lv_dropdown_add_option(result.dd_c0, dd_c0_name, LV_DROPDOWN_POS_LAST);
    }
    lv_dropdown_set_selected(result.dd_c0, mappingData.mapping_config[0][matrixData.index_mapped_value[0][current_matrix_i]][INDEX_MAP_C0]);
    lv_obj_add_event_cb(result.dd_c0, dd_c0_event_cb, LV_EVENT_VALUE_CHANGED, NULL);

    // Critical for alignment
    lv_obj_set_size(result.c0, label_width_0, obj_height);
    lv_obj_set_size(result.dd_c0, value_width_0, obj_height);
    
    /* --- C1 Value ------------------------------------------------------------- */
    
    lv_obj_t * row3 = lv_obj_create(result.panel);
    lv_obj_set_size(row3, LV_PCT(100), row_height);
    lv_obj_set_flex_flow(row3, LV_FLEX_FLOW_ROW);
    lv_obj_set_style_pad_all(row3, 0, LV_PART_MAIN);
    lv_obj_set_style_bg_opa(row3, LV_OPA_TRANSP, LV_PART_MAIN);
    lv_obj_set_style_border_width(row3, 0, LV_PART_MAIN);
    lv_obj_set_style_pad_column(row3, padding, LV_PART_MAIN);

    // Critical for alignment
    lv_obj_set_flex_align(
        row3,
        LV_FLEX_ALIGN_START,   // main axis (left‑right)
        LV_FLEX_ALIGN_CENTER,  // cross axis (top‑bottom)
        LV_FLEX_ALIGN_CENTER   // track alignment
    );

    // Show scrollbar
    if (show_scrollbar) {lv_obj_set_scrollbar_mode(row3, LV_SCROLLBAR_MODE_AUTO);}
    else {lv_obj_set_scrollbar_mode(row3, LV_SCROLLBAR_MODE_OFF);}

    // Enable scrolling
    if (enable_scrolling) {lv_obj_set_scroll_dir(row3, LV_DIR_ALL);}
    else {lv_obj_set_scroll_dir(row3, LV_DIR_NONE);}

    label_width_0 = 200;
    value_width_0 = ((width_px/1) - label_width_0) - padding*4;
    
    // Label C1
    result.c1 = create_label(
        row3,                 // parent
        label_width_0,        // width
        obj_height,           // height
        LV_ALIGN_CENTER,      // parent alignment
        0,                    // pos x
        0,                    // pos y
        "C1",                 // initial text
        LV_TEXT_ALIGN_LEFT,   // font alignment
        &cobalt_alien_17,     // font
        false,                // transparent background
        false,                // show scrollbar
        false,                // enable scrolling
        2,                    // outline width
        general_radius,       // outline radius
        1
    );
    
    // Value C1
    result.ta_c1 = create_textarea(
        row3,            // lv_obj_t
        value_width_0,   // width px
        obj_height,      // height px
        LV_ALIGN_CENTER, // alignment
        0,               // pos x
        0,               // pos y
        true,            // one line
        LV_TXT_ALNUMDEC, // accepted char*
        "",              // placeholder text
        false,           // transparent background
        false,           // show scrollbars
        false,           // enable scrolling
        font_sub,
        LV_TEXT_ALIGN_RIGHT
    );
    lv_textarea_set_text(result.ta_c1, String(mappingData.mapping_config[0][current_matrix_i][INDEX_MAP_C1]).c_str());
    lv_obj_add_event_cb(result.ta_c1, set_keyboard_context_cb, LV_EVENT_ALL, NULL);
    lv_obj_set_user_data(result.ta_c1, &mapping_c1_ctx);

    // Critical for alignment
    lv_obj_set_size(result.c1, label_width_0, obj_height);
    lv_obj_set_size(result.ta_c1, value_width_0, obj_height);
    
    /* --- C2 Value ------------------------------------------------------------- */
    
    lv_obj_t * row4 = lv_obj_create(result.panel);
    lv_obj_set_size(row4, LV_PCT(100), row_height);
    lv_obj_set_flex_flow(row4, LV_FLEX_FLOW_ROW);
    lv_obj_set_style_pad_all(row4, 0, LV_PART_MAIN);
    lv_obj_set_style_bg_opa(row4, LV_OPA_TRANSP, LV_PART_MAIN);
    lv_obj_set_style_border_width(row4, 0, LV_PART_MAIN);
    lv_obj_set_style_pad_column(row4, padding, LV_PART_MAIN);

    // Critical for alignment
    lv_obj_set_flex_align(
        row4,
        LV_FLEX_ALIGN_START,   // main axis (left‑right)
        LV_FLEX_ALIGN_CENTER,  // cross axis (top‑bottom)
        LV_FLEX_ALIGN_CENTER   // track alignment
    );
    
    // Show scrollbar
    if (show_scrollbar) {lv_obj_set_scrollbar_mode(row4, LV_SCROLLBAR_MODE_AUTO);}
    else {lv_obj_set_scrollbar_mode(row4, LV_SCROLLBAR_MODE_OFF);}

    // Enable scrolling
    if (enable_scrolling) {lv_obj_set_scroll_dir(row4, LV_DIR_ALL);}
    else {lv_obj_set_scroll_dir(row4, LV_DIR_NONE);}

    label_width_0 = 200;
    value_width_0 = ((width_px/1) - label_width_0) - padding*4;

    // Label C2
    result.c2 = create_label(
        row4,                 // parent
        label_width_0,        // width
        obj_height,           // height
        LV_ALIGN_CENTER,      // parent alignment
        0,                    // pos x
        0,                    // pos y
        "C2",                 // initial text
        LV_TEXT_ALIGN_LEFT,   // font alignment
        &cobalt_alien_17,     // font
        false,                // transparent background
        false,                // show scrollbar
        false,                // enable scrolling
        2,                    // outline width
        general_radius,       // outline radius
        1
    );
    
    // Value C2
    result.ta_c2 = create_textarea(
        row4,            // lv_obj_t
        value_width_0,   // width px
        obj_height,      // height px
        LV_ALIGN_CENTER, // alignment
        0,               // pos x
        0,               // pos y
        true,            // one line
        LV_TXT_ALNUMDEC, // accepted char*
        "",              // placeholder text
        false,           // transparent background
        false,           // show scrollbars
        false,           // enable scrolling
        font_sub,
        LV_TEXT_ALIGN_RIGHT
    );
    lv_textarea_set_text(result.ta_c2, String(mappingData.mapping_config[0][current_matrix_i][INDEX_MAP_C2]).c_str());
    lv_obj_add_event_cb(result.ta_c2, set_keyboard_context_cb, LV_EVENT_ALL, NULL);
    lv_obj_set_user_data(result.ta_c2, &mapping_c2_ctx);

    // Critical for alignment
    lv_obj_set_size(result.c2, label_width_0, obj_height);
    lv_obj_set_size(result.ta_c2, value_width_0, obj_height);

    /* --- C3 Value ------------------------------------------------------------- */
    
    lv_obj_t * row5 = lv_obj_create(result.panel);
    lv_obj_set_size(row5, LV_PCT(100), row_height);
    lv_obj_set_flex_flow(row5, LV_FLEX_FLOW_ROW);
    lv_obj_set_style_pad_all(row5, 0, LV_PART_MAIN);
    lv_obj_set_style_bg_opa(row5, LV_OPA_TRANSP, LV_PART_MAIN);
    lv_obj_set_style_border_width(row5, 0, LV_PART_MAIN);
    lv_obj_set_style_pad_column(row5, padding, LV_PART_MAIN);

    // Critical for alignment
    lv_obj_set_flex_align(
        row5,
        LV_FLEX_ALIGN_START,   // main axis (left‑right)
        LV_FLEX_ALIGN_CENTER,  // cross axis (top‑bottom)
        LV_FLEX_ALIGN_CENTER   // track alignment
    );

    // Show scrollbar
    if (show_scrollbar) {lv_obj_set_scrollbar_mode(row5, LV_SCROLLBAR_MODE_AUTO);}
    else {lv_obj_set_scrollbar_mode(row5, LV_SCROLLBAR_MODE_OFF);}

    // Enable scrolling
    if (enable_scrolling) {lv_obj_set_scroll_dir(row5, LV_DIR_ALL);}
    else {lv_obj_set_scroll_dir(row5, LV_DIR_NONE);}

    label_width_0 = 200;
    value_width_0 = ((width_px/1) - label_width_0) - padding*4;

    // Label C3
    result.c3 = create_label(
        row5,                 // parent
        label_width_0,        // width
        obj_height,           // height
        LV_ALIGN_CENTER,      // parent alignment
        0,                    // pos x
        0,                    // pos y
        "C3",                 // initial text
        LV_TEXT_ALIGN_LEFT,   // font alignment
        &cobalt_alien_17,     // font
        false,                // transparent background
        false,                // show scrollbar
        false,                // enable scrolling
        2,                    // outline width
        general_radius,       // outline radius
        1
    );
    
