holographicSol/SatIO_ESPIDF_Waveshare_ESP32-P4_Round_Display/satio_lvgl.cpp
    // Value C3
    result.ta_c3 = create_textarea(
        row5,            // lv_obj_t
        value_width_0,   // width px
        obj_height,      // height px
        LV_ALIGN_CENTER, // alignment
        0,               // pos x
        0,               // pos y
        true,            // one line
        LV_TXT_ALNUMDEC, // accepted char*
        "",              // placeholder text
        false,           // transparent background
        false,           // show scrollbars
        false,           // enable scrolling
        font_sub,
        LV_TEXT_ALIGN_RIGHT
    );
    lv_textarea_set_text(result.ta_c3, String(mappingData.mapping_config[0][current_matrix_i][INDEX_MAP_C3]).c_str());
    lv_obj_add_event_cb(result.ta_c3, set_keyboard_context_cb, LV_EVENT_ALL, NULL);
    lv_obj_set_user_data(result.ta_c3, &mapping_c3_ctx);

    // Critical for alignment
    lv_obj_set_size(result.c3, label_width_0, obj_height);
    lv_obj_set_size(result.ta_c3, value_width_0, obj_height);
    
    /* --- C4 Value ------------------------------------------------------------ */
    
    lv_obj_t * row6 = lv_obj_create(result.panel);
    lv_obj_set_size(row6, LV_PCT(100), row_height);
    lv_obj_set_flex_flow(row6, LV_FLEX_FLOW_ROW);
    lv_obj_set_style_pad_all(row6, 0, LV_PART_MAIN);
    lv_obj_set_style_bg_opa(row6, LV_OPA_TRANSP, LV_PART_MAIN);
    lv_obj_set_style_border_width(row6, 0, LV_PART_MAIN);
    lv_obj_set_style_pad_column(row6, padding, LV_PART_MAIN);

    // Critical for alignment
    lv_obj_set_flex_align(
        row6,
        LV_FLEX_ALIGN_START,   // main axis (left‑right)
        LV_FLEX_ALIGN_CENTER,  // cross axis (top‑bottom)
        LV_FLEX_ALIGN_CENTER   // track alignment
    );

    // Show scrollbar
    if (show_scrollbar) {lv_obj_set_scrollbar_mode(row6, LV_SCROLLBAR_MODE_AUTO);}
    else {lv_obj_set_scrollbar_mode(row6, LV_SCROLLBAR_MODE_OFF);}

    // Enable scrolling
    if (enable_scrolling) {lv_obj_set_scroll_dir(row6, LV_DIR_ALL);}
    else {lv_obj_set_scroll_dir(row6, LV_DIR_NONE);}

    label_width_0 = 200;
    value_width_0 = ((width_px/1) - label_width_0) - padding*4;

    // Label C4
    result.c4 = create_label(
        row6,                 // parent
        label_width_0,        // width
        obj_height,           // height
        LV_ALIGN_CENTER,      // parent alignment
        0,                    // pos x
        0,                    // pos y
        "C4",                 // initial text
        LV_TEXT_ALIGN_LEFT,   // font alignment
        &cobalt_alien_17,     // font
        false,           // transparent background
        false,                // show scrollbar
        false,                // enable scrolling
        2,                    // outline width
        general_radius,       // outline radius
        1
    );
    
    // Value C4
    result.ta_c4 = create_textarea(
        row6,            // lv_obj_t
        value_width_0,   // width px
        obj_height,      // height px
        LV_ALIGN_CENTER, // alignment
        0,               // pos x
        0,               // pos y
        true,            // one line
        LV_TXT_ALNUMDEC, // accepted char*
        "",              // placeholder text
        false,           // transparent background
        false,           // show scrollbars
        false,           // enable scrolling
        font_sub,
        LV_TEXT_ALIGN_RIGHT
    );
    lv_textarea_set_text(result.ta_c4, String(mappingData.mapping_config[0][current_matrix_i][INDEX_MAP_C4]).c_str());
    lv_obj_add_event_cb(result.ta_c4, set_keyboard_context_cb, LV_EVENT_ALL, NULL);
    lv_obj_set_user_data(result.ta_c4, &mapping_c4_ctx);

    // Critical for alignment
    lv_obj_set_size(result.c4, label_width_0, obj_height);
    lv_obj_set_size(result.ta_c4, value_width_0, obj_height);
    
    /* --- C5 Value ---------------------------------------------------------- */
    
    lv_obj_t * row7 = lv_obj_create(result.panel);
    lv_obj_set_size(row7, LV_PCT(100), row_height);
    lv_obj_set_flex_flow(row7, LV_FLEX_FLOW_ROW);
    lv_obj_set_style_pad_all(row7, 0, LV_PART_MAIN);
    lv_obj_set_style_bg_opa(row7, LV_OPA_TRANSP, LV_PART_MAIN);
    lv_obj_set_style_border_width(row7, 0, LV_PART_MAIN);
    lv_obj_set_style_pad_column(row7, padding, LV_PART_MAIN);

    // Critical for alignment
    lv_obj_set_flex_align(
        row7,
        LV_FLEX_ALIGN_START,   // main axis (left‑right)
        LV_FLEX_ALIGN_CENTER,  // cross axis (top‑bottom)
        LV_FLEX_ALIGN_CENTER   // track alignment
    );
    
    // Show scrollbar
    if (show_scrollbar) {lv_obj_set_scrollbar_mode(row7, LV_SCROLLBAR_MODE_AUTO);}
    else {lv_obj_set_scrollbar_mode(row7, LV_SCROLLBAR_MODE_OFF);}

    // Enable scrolling
    if (enable_scrolling) {lv_obj_set_scroll_dir(row7, LV_DIR_ALL);}
    else {lv_obj_set_scroll_dir(row7, LV_DIR_NONE);}

    label_width_0 = 200;
    value_width_0 = ((width_px/1) - label_width_0) - padding*4;

    // Label C5
    result.c5 = create_label(
        row7,                 // parent
        label_width_0,        // width
        obj_height,           // height
        LV_ALIGN_CENTER,      // parent alignment
        0,                    // pos x
        0,                    // pos y
        "C5",                 // initial text
        LV_TEXT_ALIGN_LEFT,   // font alignment
        &cobalt_alien_17,     // font
        true,                 // transparent background
        false,                // show scrollbar
        false,                // enable scrolling
        2,                    // outline width
        general_radius,       // outline radius
        1
    );
    
    // Value C5
    result.ta_c5 = create_textarea(
        row7,            // lv_obj_t
        value_width_0,   // width px
        obj_height,      // height px
        LV_ALIGN_CENTER, // alignment
        0,               // pos x
        0,               // pos y
        true,            // one line
        LV_TXT_ALNUMDEC, // accepted char*
        "",              // placeholder text
        false,           // transparent background
        false,           // show scrollbars
        false,           // enable scrolling
        font_sub,
        LV_TEXT_ALIGN_RIGHT
    );
    lv_textarea_set_text(result.ta_c5, String(mappingData.mapping_config[0][matrixData.index_mapped_value[0][current_matrix_i]][INDEX_MAP_C5]).c_str());
    lv_obj_add_event_cb(result.ta_c5, set_keyboard_context_cb, LV_EVENT_ALL, NULL);
    lv_obj_set_user_data(result.ta_c5, &mapping_c5_ctx);

    // Critical for alignment
    lv_obj_set_size(result.c5, label_width_0, obj_height);
    lv_obj_set_size(result.ta_c5, value_width_0, obj_height);
    
