holographicSol/SatIO_ESPIDF_Waveshare_ESP32-P4_Round_Display/satio_lvgl.cpp
    /* --- Map Mode --------------------------------------------------------- */
    
    lv_obj_t * row8 = lv_obj_create(result.panel);
    lv_obj_set_size(row8, LV_PCT(100), row_height);
    lv_obj_set_flex_flow(row8, LV_FLEX_FLOW_ROW);
    lv_obj_set_style_pad_all(row8, 0, LV_PART_MAIN);
    lv_obj_set_style_bg_opa(row8, LV_OPA_TRANSP, LV_PART_MAIN);
    lv_obj_set_style_border_width(row8, 0, LV_PART_MAIN);
    lv_obj_set_style_pad_column(row8, padding, LV_PART_MAIN);

    // Critical for alignment
    lv_obj_set_flex_align(
        row8,
        LV_FLEX_ALIGN_START,   // main axis (left‑right)
        LV_FLEX_ALIGN_CENTER,  // cross axis (top‑bottom)
        LV_FLEX_ALIGN_CENTER   // track alignment
    );

    // Show scrollbar
    if (show_scrollbar) {lv_obj_set_scrollbar_mode(row8, LV_SCROLLBAR_MODE_AUTO);}
    else {lv_obj_set_scrollbar_mode(row8, LV_SCROLLBAR_MODE_OFF);}

    // Enable scrolling
    if (enable_scrolling) {lv_obj_set_scroll_dir(row8, LV_DIR_ALL);}
    else {lv_obj_set_scroll_dir(row8, LV_DIR_NONE);}

    label_width_0 = 150;
    value_width_0 = ((width_px/1) - label_width_0) - padding*4;
    
    // Map Mode
    result.mode = create_label(
        row8,                 // parent
        label_width_0,        // width
        obj_height,           // height
        LV_ALIGN_CENTER,      // parent alignment
        0,                    // pos x
        0,                    // pos y
        "Map Mode",           // initial text
        LV_TEXT_ALIGN_LEFT,   // font alignment
        &cobalt_alien_17,     // font
        false,                // transparent background
        false,                // show scrollbar
        false,                // enable scrolling
        2,                    // outline width
        general_radius,       // outline radius
        1
    );
    
    // Select Map Mode
    result.dd_mode = create_dropdown_menu(
        row8,
        NULL,
        0,
        value_width_0,
        obj_height,
        LV_ALIGN_CENTER,
        0,
        0,
        font_sub
    );
    char dd_mode_name[MAX_GLOBAL_ELEMENT_SIZE];
    for (int i = 0; i < MAX_MAP_MODES; i++) {
        snprintf(dd_mode_name, sizeof(dd_mode_name), "%s", String(mappingData.char_map_mode_names[i]).c_str());
        lv_dropdown_add_option(result.dd_mode, dd_mode_name, LV_DROPDOWN_POS_LAST);
    }
    lv_dropdown_set_selected(result.dd_mode, 0);
    lv_obj_add_event_cb(result.dd_mode, dd_mode_event_cb, LV_EVENT_VALUE_CHANGED, NULL);

    // Critical for alignment
    lv_obj_set_size(result.mode, label_width_0, obj_height);
    lv_obj_set_size(result.dd_mode, value_width_0, obj_height);

    /* --- Map Input Value --------------------------------------------------- */
    
    lv_obj_t * row9 = lv_obj_create(result.panel);
    lv_obj_set_size(row9, LV_PCT(100), row_height);
    lv_obj_set_flex_flow(row9, LV_FLEX_FLOW_ROW);
    lv_obj_set_style_pad_all(row9, 0, LV_PART_MAIN);
    lv_obj_set_style_bg_opa(row9, LV_OPA_TRANSP, LV_PART_MAIN);
    lv_obj_set_style_border_width(row9, 0, LV_PART_MAIN);
    lv_obj_set_style_pad_column(row9, padding, LV_PART_MAIN);

    // Critical for alignment
    lv_obj_set_flex_align(
        row9,
        LV_FLEX_ALIGN_START,   // main axis (left‑right)
        LV_FLEX_ALIGN_CENTER,  // cross axis (top‑bottom)
        LV_FLEX_ALIGN_CENTER   // track alignment
    );
    
    // Show scrollbar
    if (show_scrollbar) {lv_obj_set_scrollbar_mode(row9, LV_SCROLLBAR_MODE_AUTO);}
    else {lv_obj_set_scrollbar_mode(row9, LV_SCROLLBAR_MODE_OFF);}

    // Enable scrolling
    if (enable_scrolling) {lv_obj_set_scroll_dir(row9, LV_DIR_ALL);}
    else {lv_obj_set_scroll_dir(row9, LV_DIR_NONE);}

    label_width_0 = 150;
    value_width_0 = ((width_px/1) - label_width_0) - padding*4;

    // Label Input
    result.input_value = create_label(
        row9,                 // parent
        label_width_0,        // width
        obj_height,           // height
        LV_ALIGN_CENTER,      // parent alignment
        0,                    // pos x
        0,                    // pos y
        "Input Value",        // initial text
        LV_TEXT_ALIGN_LEFT,   // font alignment
        &cobalt_alien_17,     // font
        false,                // transparent background
        false,                // show scrollbar
        false,                // enable scrolling
        2,                    // outline width
        general_radius,       // outline radius
        1
    );
    
    // Value Input
    result.value_input = create_label(
        row9,                 // parent
        value_width_0,        // width
        obj_height,           // height
        LV_ALIGN_CENTER,      // parent alignment
        0,                    // pos x
        0,                    // pos y
        "0",                  // initial text
        LV_TEXT_ALIGN_CENTER, // font alignment
        &cobalt_alien_17,     // font
        false,                // transparent background
        false,                // show scrollbar
        false,                // enable scrolling
        2,                    // outline width
        general_radius,       // outline radius
        1
    );

    // Critical for alignment
    lv_obj_set_size(result.input_value, label_width_0, obj_height);
    lv_obj_set_size(result.value_input, value_width_0, obj_height);

    /* --- Map Result ---------------------------------------------------------- */
    
    lv_obj_t * row10 = lv_obj_create(result.panel);
    lv_obj_set_size(row10, LV_PCT(100), row_height);
    lv_obj_set_flex_flow(row10, LV_FLEX_FLOW_ROW);
    lv_obj_set_style_pad_all(row10, 0, LV_PART_MAIN);
    lv_obj_set_style_bg_opa(row10, LV_OPA_TRANSP, LV_PART_MAIN);
    lv_obj_set_style_border_width(row10, 0, LV_PART_MAIN);
    lv_obj_set_style_pad_column(row10, padding, LV_PART_MAIN);

    // Critical for alignment
    lv_obj_set_flex_align(
        row10,
        LV_FLEX_ALIGN_START,   // main axis (left‑right)
        LV_FLEX_ALIGN_CENTER,  // cross axis (top‑bottom)
        LV_FLEX_ALIGN_CENTER   // track alignment
    );
    
    // Show scrollbar
    if (show_scrollbar) {lv_obj_set_scrollbar_mode(row10, LV_SCROLLBAR_MODE_AUTO);}
    else {lv_obj_set_scrollbar_mode(row10, LV_SCROLLBAR_MODE_OFF);}

    // Enable scrolling
    if (enable_scrolling) {lv_obj_set_scroll_dir(row10, LV_DIR_ALL);}
    else {lv_obj_set_scroll_dir(row10, LV_DIR_NONE);}

    label_width_0 = 150;
    value_width_0 = ((width_px/1) - label_width_0) - padding*4;

    // Label Output
    result.map_result = create_label(
        row10,                // parent
        label_width_0,        // width
        obj_height,           // height
        LV_ALIGN_CENTER,      // parent alignment
        0,                    // pos x
        0,                    // pos y
        "Output Value",       // initial text
        LV_TEXT_ALIGN_LEFT,   // font alignment
        &cobalt_alien_17,     // font
        false,                // transparent background
        false,                // show scrollbar
        false,                // enable scrolling
        2,                    // outline width
        general_radius,       // outline radius
        1
    );
    
    // Value Output
    result.value_map_result = create_label(
        row10,                // parent
        value_width_0,        // width
        obj_height,           // height
        LV_ALIGN_CENTER,      // parent alignment
        0,                    // pos x
        0,                    // pos y
        "0",                  // initial text
        LV_TEXT_ALIGN_CENTER, // font alignment
        &cobalt_alien_17,     // font
        false,                // transparent background
        false,                // show scrollbar
        false,                // enable scrolling
        2,                    // outline width
        general_radius,       // outline radius
        1
    );

    // Critical for alignment
    lv_obj_set_size(result.map_result, label_width_0, obj_height);
    lv_obj_set_size(result.value_map_result, value_width_0, obj_height);

    return result;
}

/** ----------------------------------------------------------------------------------------
 * @brief Display image from SD card.
 * 
 * @param scr Pointer to the parent screen object.
 * @param filename Path to the image file on the SD card.
 * @param width_px Width of the image in pixels.
 * @param height_px Height of the image in pixels.
 * @param color_depth_bits Color depth of the image in bits (e.g., 16 for RGB565).
 * @param pos_x X position of the image within its parent/screen.
 * @param pos_y Y position of the image within its parent/screen.
 * @param alignment Alignment of the image within its parent/screen.
 * 
 * @note Requires sufficient external RAM (PSRAM) for all file bytes.
 * 
 */
sdcard_image_t * create_image_from_sdcard(
    lv_obj_t * scr,
    const char * filename,
    uint32_t width_px,
    uint32_t height_px,
    uint32_t color_depth_bits,
    uint32_t pos_x,
    uint32_t pos_y,
    lv_align_t alignment,
    bool discard_after_display
) {

