holographicSol/SatIO_ESPIDF_Waveshare_ESP32-P4_Round_Display/satio_lvgl.cpp
    // Allocate sdcard_image_t structure
    sdcard_image_t * sdcard_image = (sdcard_image_t *)heap_caps_malloc(sizeof(sdcard_image_t), MALLOC_CAP_SPIRAM);
    if (!sdcard_image) {
        printf("ERROR: PSRAM allocation for sdcard_image_t failed\n");
        return NULL;
    }

    // Get file size
    sdcard_image->f_size = get_file_size(filename);
    if (sdcard_image->f_size == 0) {
        printf("ERROR: Cannot get size of %s\n", filename);
        heap_caps_free(sdcard_image);
        return NULL;
    }

    // Load image to PSRAM
    sdcard_image->bytes_in_psram = load_file_bytes_to_psram(filename, sdcard_image->f_size);
    if (!sdcard_image->bytes_in_psram) {
        printf("ERROR: Failed to load %s to PSRAM\n", filename);
        heap_caps_free(sdcard_image);
        return NULL;
    }

    // Create descriptor from loaded data
    sdcard_image->dsc.header.cf = color_depth_bits == 24 ? LV_COLOR_FORMAT_RGB565A8 : LV_COLOR_FORMAT_RGB565;
    sdcard_image->dsc.header.w = width_px;
    sdcard_image->dsc.header.h = height_px;
    sdcard_image->dsc.data_size = sdcard_image->f_size;
    sdcard_image->dsc.data = sdcard_image->bytes_in_psram; // Pointer to PSRAM data

    printf("Created image descriptor: cf=%d %ldx%ld size=%ld\n", 
           sdcard_image->dsc.header.cf, width_px, height_px, sdcard_image->f_size);

    // Create LVGL image object
    sdcard_image->lv_image_obj = lv_img_create(scr);
    if (!sdcard_image->lv_image_obj) {
        printf("ERROR: Failed to create LVGL image\n");
        heap_caps_free(sdcard_image->bytes_in_psram);
        heap_caps_free(sdcard_image);
        return NULL;
    }

    // Position and size
    lv_obj_set_pos(sdcard_image->lv_image_obj, pos_x, pos_y);
    if (alignment == LV_ALIGN_CENTER) {
        lv_obj_center(sdcard_image->lv_image_obj);
    }
    lv_obj_set_size(sdcard_image->lv_image_obj, width_px, height_px);
    
    // Set image source
    lv_img_set_src(sdcard_image->lv_image_obj, &sdcard_image->dsc);

    // Discard or return
    if (discard_after_display) {
        heap_caps_free(sdcard_image->bytes_in_psram);
        heap_caps_free(sdcard_image);
        printf("Discarded image data from PSRAM\n");
        return NULL;  // Return NULL when discarding
    }
    printf("Image created successfully at %p\n", sdcard_image);
    return sdcard_image;  // Return full structure
}

void cleanup_loading_image() {
    if (loading_image) {
        // Delete LVGL image object
        if (loading_image->lv_image_obj) {
            lv_obj_del(loading_image->lv_image_obj);
        }
        // Free PSRAM image data
        if (loading_image->bytes_in_psram) {
            heap_caps_free(loading_image->bytes_in_psram);
        }
        // Free the struct itself
        heap_caps_free(loading_image);
        loading_image = NULL;
        printf("Loading screen image cleaned up\n");
    }
}

void lvgl_cleanup_all() {
    // Ensure no pending events
    lv_timer_handler();
    
    astro_clock_end();
}

void create_default_screen_objects(lv_obj_t * scr)
{

    lvgl_cleanup_all();

    // Set background color for main part of the screen
    lv_obj_set_style_bg_color(scr, lv_color_make(0, 0, 0), LV_PART_MAIN);

    // -------------------------------- Keypad Num ------------------------------------ //

    // Create keyboard (bootstrapped)
    kb_numdec = create_keyboard(
        scr,            // lv_obj_t
        600,                    // width px
        250,                    // height px
        LV_ALIGN_CENTER,        // alignment
        0,                      // pos x
        23,                     // pos y
        10,                     // padding between kb and text area
        36,                     // text area height
        LV_KEYBOARD_MODE_NUMBER // keyboard mode
    );
    
    // Plug in keyboard callback for kb_numdec
    lv_obj_add_event_cb(kb_numdec.kb, keyboard_event_cb, LV_EVENT_VALUE_CHANGED, &kb_numdec);
    lv_obj_add_flag(kb_numdec.kb, LV_OBJ_FLAG_HIDDEN);
    lv_obj_add_flag(kb_numdec.ta, LV_OBJ_FLAG_HIDDEN);

    // -------------------------------- Keyboard ----------------------------------- //

    // Create keyboard (bootstrapped)
    kb_alnumsym = create_keyboard(
        scr,            // lv_obj_t
        600,                    // width px
        250,                    // height px
        LV_ALIGN_CENTER,        // alignment
        0,                      // pos x
        23,                     // pos y
        10,                     // padding between kb and text area
        36,                     // text area height
        LV_KEYBOARD_MODE_USER_1 // keyboard mode
    );
    
    // Plug in keyboard callback for kb_alnumsym
    lv_obj_add_event_cb(kb_alnumsym.kb, keyboard_event_cb, LV_EVENT_VALUE_CHANGED, &kb_alnumsym);
    lv_obj_add_flag(kb_alnumsym.kb, LV_OBJ_FLAG_HIDDEN);
    lv_obj_add_flag(kb_alnumsym.ta, LV_OBJ_FLAG_HIDDEN);

    // -------------------------------- Title Bar --------------------------------- //

    main_title_bar = create_title_bar(
        scr, // parent
        720, // width px
        64,  // height px
        LV_ALIGN_TOP_MID,
        0, // pos x
        0, // pos y
        false, // show scrollbar
        false  // enable scrollbar
    );

    // ------------------------------ System Tray --------------------------------- //

    // Create system tray
    system_tray = create_system_tray(scr);

    // Plug in event callback for screen click events
    lv_obj_add_event_cb(scr, screen_tap_cb, LV_EVENT_CLICKED, NULL);

    // Plug in event callback for screen swipe events
    lv_obj_add_event_cb(scr, screen_swipe_cb, LV_EVENT_GESTURE, NULL);
}

void display_loading_screen() {

    lv_obj_t * current_screen = lv_scr_act();

    if (!lv_obj_is_valid(loading_screen)) {loading_screen = lv_obj_create(NULL);}
    if (current_screen == loading_screen) return;

    lv_obj_set_style_bg_color(loading_screen, lv_color_make(0, 0, 0), LV_PART_MAIN);
    
