holographicSol/SatIO_ESPIDF_Waveshare_ESP32-P4_Round_Display/satio_lvgl.cpp
                lv_obj_set_style_outline_color(mcc.ta_c2, main_contrast_value_hue, LV_PART_MAIN);
                lv_obj_set_style_text_color(mcc.c2, main_contrast_title_hue, LV_PART_MAIN);
                lv_textarea_set_text(mcc.ta_c2, String(mappingData.mapping_config[0][current_mapping_i][INDEX_MAP_C2]).c_str());
                lv_obj_set_style_text_color(mcc.ta_c2, main_contrast_value_hue, LV_PART_MAIN);

                lv_obj_set_style_outline_color(mcc.ta_c3, main_contrast_value_hue, LV_PART_MAIN);
                lv_obj_set_style_text_color(mcc.c3, main_contrast_title_hue, LV_PART_MAIN);
                lv_textarea_set_text(mcc.ta_c3, String(mappingData.mapping_config[0][current_mapping_i][INDEX_MAP_C3]).c_str());
                lv_obj_set_style_text_color(mcc.ta_c3, main_contrast_value_hue, LV_PART_MAIN);

                lv_obj_set_style_outline_color(mcc.ta_c4, main_contrast_value_hue, LV_PART_MAIN);
                lv_obj_set_style_text_color(mcc.c4, main_contrast_title_hue, LV_PART_MAIN);
                lv_textarea_set_text(mcc.ta_c4, String(mappingData.mapping_config[0][current_mapping_i][INDEX_MAP_C4]).c_str());
                lv_obj_set_style_text_color(mcc.ta_c4, main_contrast_value_hue, LV_PART_MAIN);
                
                lv_obj_set_style_outline_color(mcc.ta_c5, main_contrast_value_hue, LV_PART_MAIN);
                lv_obj_set_style_text_color(mcc.c5, main_contrast_title_hue, LV_PART_MAIN);
                lv_textarea_set_text(mcc.ta_c5, String(mappingData.mapping_config[0][current_mapping_i][INDEX_MAP_C5]).c_str());
                lv_obj_set_style_text_color(mcc.ta_c5, main_contrast_value_hue, LV_PART_MAIN);

                lv_obj_set_style_text_color(mcc.mode, main_contrast_title_hue, LV_PART_MAIN);
                lv_obj_set_style_outline_color(mcc.dd_mode, main_contrast_value_hue, LV_PART_MAIN);
                lv_dropdown_set_selected(mcc.dd_mode, mappingData.map_mode[0][current_mapping_i]);
                lv_obj_set_style_text_color(mcc.dd_mode, main_contrast_value_hue, LV_PART_MAIN);
                lv_obj_set_style_outline_color(lv_dropdown_get_list(mcc.dd_mode), main_contrast_outline_hue, LV_PART_MAIN);
                lv_obj_set_style_text_color(lv_dropdown_get_list(mcc.dd_mode), main_contrast_value_hue, LV_PART_MAIN);
                lv_obj_set_style_text_color(lv_dropdown_get_list(mcc.dd_mode), main_contrast_value_hue, LV_PART_SELECTED | LV_STATE_CHECKED);
                lv_obj_set_style_text_color(lv_dropdown_get_list(mcc.dd_mode), main_contrast_value_hue, LV_PART_SELECTED | LV_STATE_DEFAULT);

                lv_obj_set_style_text_color(mcc.input_value, main_contrast_title_hue, LV_PART_MAIN);
                lv_obj_set_style_outline_color(mcc.value_input, main_contrast_value_hue, LV_PART_MAIN);
                lv_label_set_text(mcc.value_input, String(get_mapping_input_value(current_mapping_i)).c_str());
                lv_obj_set_style_text_color(mcc.value_input, main_contrast_value_hue, LV_PART_MAIN);

                lv_obj_set_style_text_color(mcc.map_result, main_contrast_title_hue, LV_PART_MAIN);
                lv_obj_set_style_outline_color(mcc.value_map_result, main_contrast_value_hue, LV_PART_MAIN);
                lv_label_set_text(mcc.value_map_result, String(mappingData.mapped_value[0][current_mapping_i]).c_str());
                lv_obj_set_style_text_color(mcc.value_map_result, main_contrast_value_hue, LV_PART_MAIN);
            }
        }
    }
    // ---------------------
    // gps screen
    // ---------------------
    else if (lv_scr_act() == gps_screen) {
        vTaskDelay(5 / portTICK_PERIOD_MS);

        // Switch GPS Panel
        if (switch_gps_panel.label) {
            if      (current_gps_panel==0) {lv_label_set_text(switch_gps_panel.label, "SATIO");}
            else if (current_gps_panel==1) {lv_label_set_text(switch_gps_panel.label, "GNGGA");}
            else if (current_gps_panel==2) {lv_label_set_text(switch_gps_panel.label, "GNRMC");}
            else if (current_gps_panel==3) {lv_label_set_text(switch_gps_panel.label, "GPATT");}
            else {lv_label_set_text(switch_gps_panel.label, "");}
            lv_obj_set_style_outline_color(switch_gps_panel.panel, main_contrast_outline_hue, LV_PART_MAIN);
            lv_obj_set_style_text_color(switch_gps_panel.label, main_contrast_title_hue, LV_PART_MAIN);
        }

        if (current_gps_panel == 0) {
            if (satio_c.panel) {
                // Hide
                lv_obj_add_flag(gngga_c.panel, LV_OBJ_FLAG_HIDDEN);
                lv_obj_add_flag(gnrmc_c.panel, LV_OBJ_FLAG_HIDDEN);
                lv_obj_add_flag(gpatt_c.panel, LV_OBJ_FLAG_HIDDEN);

                // Show
                lv_obj_remove_flag(satio_c.panel, LV_OBJ_FLAG_HIDDEN);

                vTaskDelay(5 / portTICK_PERIOD_MS);

                // Panel
                lv_obj_set_style_outline_color(satio_c.panel, main_contrast_outline_hue, LV_PART_MAIN);

                // ────────────────────────────────────────────────
                // Degrees Latitude
                // ────────────────────────────────────────────────
                lv_obj_set_style_text_color(satio_c.lbl_deg_lat, main_contrast_title_hue, LV_PART_MAIN);
                lv_obj_set_style_outline_color(satio_c.val_deg_lat, main_contrast_value_hue, LV_PART_MAIN);
                lv_label_set_text(satio_c.val_deg_lat, String(satioData.degrees_latitude, 7).c_str());
                lv_obj_set_style_text_color(satio_c.val_deg_lat, main_contrast_value_hue, LV_PART_MAIN);

                // ────────────────────────────────────────────────
                // Degrees Longitude
                // ────────────────────────────────────────────────
                lv_obj_set_style_text_color(satio_c.lbl_deg_lon, main_contrast_title_hue, LV_PART_MAIN);
                lv_obj_set_style_outline_color(satio_c.val_deg_lon, main_contrast_value_hue, LV_PART_MAIN);
                lv_label_set_text(satio_c.val_deg_lon, String(satioData.degrees_longitude, 7).c_str());
                lv_obj_set_style_text_color(satio_c.val_deg_lon, main_contrast_value_hue, LV_PART_MAIN);

