holographicSol/SatIO_ESPIDF_Waveshare_ESP32-P4_Round_Display/satio_lvgl.cpp
                lv_obj_set_style_text_color(gngga_c.lbl_bad_element_count, main_contrast_title_hue, LV_PART_MAIN);
                lv_obj_set_style_outline_color(gngga_c.val_bad_element_count, main_contrast_value_hue, LV_PART_MAIN);
                lv_label_set_text(gngga_c.val_bad_element_count, String(gnggaData.total_bad_elements).c_str());
                lv_obj_set_style_text_color(gngga_c.val_bad_element_count, main_contrast_value_hue, LV_PART_MAIN); 
            }
        }

        else if (current_gps_panel==2) {
            if (gnrmc_c.panel) {
                // Hide
                lv_obj_add_flag(gngga_c.panel, LV_OBJ_FLAG_HIDDEN);
                // lv_obj_add_flag(gnrmc_c.panel, LV_OBJ_FLAG_HIDDEN);
                lv_obj_add_flag(gpatt_c.panel, LV_OBJ_FLAG_HIDDEN);
                // lv_obj_add_flag(satio_c.panel, LV_OBJ_FLAG_HIDDEN);

                // Show
                lv_obj_remove_flag(gnrmc_c.panel, LV_OBJ_FLAG_HIDDEN);

                vTaskDelay(5 / portTICK_PERIOD_MS);

                lv_obj_set_style_outline_color(gnrmc_c.panel, main_contrast_outline_hue, LV_PART_MAIN);

                lv_obj_set_style_text_color(gnrmc_c.lbl_utc_time, main_contrast_title_hue, LV_PART_MAIN);
                lv_obj_set_style_outline_color(gnrmc_c.val_utc_time, main_contrast_value_hue, LV_PART_MAIN);
                lv_label_set_text(gnrmc_c.val_utc_time, String(gnrmcData.utc_time).c_str());
                lv_obj_set_style_text_color(gnrmc_c.val_utc_time, main_contrast_value_hue, LV_PART_MAIN);

                lv_obj_set_style_text_color(gnrmc_c.lbl_positioning_status, main_contrast_title_hue, LV_PART_MAIN);
                lv_obj_set_style_outline_color(gnrmc_c.val_positioning_status, main_contrast_value_hue, LV_PART_MAIN);
                lv_label_set_text(gnrmc_c.val_positioning_status, String(gnrmcData.positioning_status).c_str());
                lv_obj_set_style_text_color(gnrmc_c.val_positioning_status, main_contrast_value_hue, LV_PART_MAIN);

                lv_obj_set_style_text_color(gnrmc_c.lbl_latitude, main_contrast_title_hue, LV_PART_MAIN);
                lv_obj_set_style_outline_color(gnrmc_c.val_latitude, main_contrast_value_hue, LV_PART_MAIN);
                lv_label_set_text(gnrmc_c.val_latitude,
                                String(String(gnrmcData.latitude_hemisphere) + " " +
                                        String(gnrmcData.latitude)).c_str());
                lv_obj_set_style_text_color(gnrmc_c.val_latitude, main_contrast_value_hue, LV_PART_MAIN);

                lv_obj_set_style_text_color(gnrmc_c.lbl_longitude, main_contrast_title_hue, LV_PART_MAIN);
                lv_obj_set_style_outline_color(gnrmc_c.val_longitude, main_contrast_value_hue, LV_PART_MAIN);
                lv_label_set_text(gnrmc_c.val_longitude,
                                String(String(gnrmcData.longitude_hemisphere) + " " +
                                        String(gnrmcData.longitude)).c_str());
                lv_obj_set_style_text_color(gnrmc_c.val_longitude, main_contrast_value_hue, LV_PART_MAIN);

                lv_obj_set_style_text_color(gnrmc_c.lbl_ground_speed, main_contrast_title_hue, LV_PART_MAIN);
                lv_obj_set_style_outline_color(gnrmc_c.val_ground_speed, main_contrast_value_hue, LV_PART_MAIN);
                lv_label_set_text(gnrmc_c.val_ground_speed, String(gnrmcData.ground_speed).c_str());
                lv_obj_set_style_text_color(gnrmc_c.val_ground_speed, main_contrast_value_hue, LV_PART_MAIN);

                lv_obj_set_style_text_color(gnrmc_c.lbl_ground_heading, main_contrast_title_hue, LV_PART_MAIN);
                lv_obj_set_style_outline_color(gnrmc_c.val_ground_heading, main_contrast_value_hue, LV_PART_MAIN);
                lv_label_set_text(gnrmc_c.val_ground_heading, String(gnrmcData.ground_heading).c_str());
                lv_obj_set_style_text_color(gnrmc_c.val_ground_heading, main_contrast_value_hue, LV_PART_MAIN);

                lv_obj_set_style_text_color(gnrmc_c.lbl_utc_date, main_contrast_title_hue, LV_PART_MAIN);
                lv_obj_set_style_outline_color(gnrmc_c.val_utc_date, main_contrast_value_hue, LV_PART_MAIN);
                lv_label_set_text(gnrmc_c.val_utc_date, String(gnrmcData.utc_date).c_str());
                lv_obj_set_style_text_color(gnrmc_c.val_utc_date, main_contrast_value_hue, LV_PART_MAIN);

                lv_obj_set_style_text_color(gnrmc_c.lbl_installation_angle, main_contrast_title_hue, LV_PART_MAIN);
                lv_obj_set_style_outline_color(gnrmc_c.val_installation_angle, main_contrast_value_hue, LV_PART_MAIN);
                lv_label_set_text(gnrmc_c.val_installation_angle, String(gnrmcData.installation_angle).c_str());
                lv_obj_set_style_text_color(gnrmc_c.val_installation_angle, main_contrast_value_hue, LV_PART_MAIN);

                lv_obj_set_style_text_color(gnrmc_c.lbl_installation_angle_direction, main_contrast_title_hue, LV_PART_MAIN);
                lv_obj_set_style_outline_color(gnrmc_c.val_installation_angle_direction, main_contrast_value_hue, LV_PART_MAIN);
                lv_label_set_text(gnrmc_c.val_installation_angle_direction,
                                String(gnrmcData.installation_angle_direction).c_str());
                lv_obj_set_style_text_color(gnrmc_c.val_installation_angle_direction, main_contrast_value_hue, LV_PART_MAIN);

                lv_obj_set_style_text_color(gnrmc_c.lbl_mode_indication, main_contrast_title_hue, LV_PART_MAIN);
                lv_obj_set_style_outline_color(gnrmc_c.val_mode_indication, main_contrast_value_hue, LV_PART_MAIN);
                lv_label_set_text(gnrmc_c.val_mode_indication, String(gnrmcData.mode_indication).c_str());
                lv_obj_set_style_text_color(gnrmc_c.val_mode_indication, main_contrast_value_hue, LV_PART_MAIN);

                lv_obj_set_style_text_color(gnrmc_c.lbl_bad_element_count, main_contrast_title_hue, LV_PART_MAIN);
                lv_obj_set_style_outline_color(gnrmc_c.val_bad_element_count, main_contrast_value_hue, LV_PART_MAIN);
                lv_label_set_text(gnrmc_c.val_bad_element_count, String(gnrmcData.total_bad_elements).c_str());
                lv_obj_set_style_text_color(gnrmc_c.val_bad_element_count, main_contrast_value_hue, LV_PART_MAIN);
            }
        }

