holographicSol/SatIO_ESPIDF_Waveshare_ESP32-P4_Round_Display/satio_lvgl.cpp
            // ────────────────────────────────────────────────
            // Acceleration Y
            // ────────────────────────────────────────────────
            lv_obj_set_style_text_color(gyro_0_c.lbl_gyro_0_acc_y, main_contrast_title_hue, LV_PART_MAIN);
            lv_obj_set_style_outline_color(gyro_0_c.val_gyro_0_acc_y, main_contrast_value_hue, LV_PART_MAIN);
            lv_label_set_text(gyro_0_c.val_gyro_0_acc_y, String(gyroData.gyro_0_acc_y).c_str());
            lv_obj_set_style_text_color(gyro_0_c.val_gyro_0_acc_y, main_contrast_value_hue, LV_PART_MAIN);

            // ────────────────────────────────────────────────
            // Acceleration Z
            // ────────────────────────────────────────────────
            lv_obj_set_style_text_color(gyro_0_c.lbl_gyro_0_acc_z, main_contrast_title_hue, LV_PART_MAIN);
            lv_obj_set_style_outline_color(gyro_0_c.val_gyro_0_acc_z, main_contrast_value_hue, LV_PART_MAIN);
            lv_label_set_text(gyro_0_c.val_gyro_0_acc_z, String(gyroData.gyro_0_acc_z).c_str());
            lv_obj_set_style_text_color(gyro_0_c.val_gyro_0_acc_z, main_contrast_value_hue, LV_PART_MAIN);

            // ────────────────────────────────────────────────
            // Gyroscope X
            // ────────────────────────────────────────────────
            lv_obj_set_style_text_color(gyro_0_c.lbl_gyro_0_gyr_x, main_contrast_title_hue, LV_PART_MAIN);
            lv_obj_set_style_outline_color(gyro_0_c.val_gyro_0_gyr_x, main_contrast_value_hue, LV_PART_MAIN);
            lv_label_set_text(gyro_0_c.val_gyro_0_gyr_x, String(gyroData.gyro_0_gyr_x).c_str());
            lv_obj_set_style_text_color(gyro_0_c.val_gyro_0_gyr_x, main_contrast_value_hue, LV_PART_MAIN);

            // ────────────────────────────────────────────────
            // Gyroscope Y
            // ────────────────────────────────────────────────
            lv_obj_set_style_text_color(gyro_0_c.lbl_gyro_0_gyr_y, main_contrast_title_hue, LV_PART_MAIN);
            lv_obj_set_style_outline_color(gyro_0_c.val_gyro_0_gyr_y, main_contrast_value_hue, LV_PART_MAIN);
            lv_label_set_text(gyro_0_c.val_gyro_0_gyr_y, String(gyroData.gyro_0_gyr_y).c_str());
            lv_obj_set_style_text_color(gyro_0_c.val_gyro_0_gyr_y, main_contrast_value_hue, LV_PART_MAIN);

            // ────────────────────────────────────────────────
            // Gyroscope Z
            // ────────────────────────────────────────────────
            lv_obj_set_style_text_color(gyro_0_c.lbl_gyro_0_gyr_z, main_contrast_title_hue, LV_PART_MAIN);
            lv_obj_set_style_outline_color(gyro_0_c.val_gyro_0_gyr_z, main_contrast_value_hue, LV_PART_MAIN);
            lv_label_set_text(gyro_0_c.val_gyro_0_gyr_z, String(gyroData.gyro_0_gyr_z).c_str());
            lv_obj_set_style_text_color(gyro_0_c.val_gyro_0_gyr_z, main_contrast_value_hue, LV_PART_MAIN);

            // ────────────────────────────────────────────────
            // Magnetometer X
            // ────────────────────────────────────────────────
            lv_obj_set_style_text_color(gyro_0_c.lbl_gyro_0_mag_x, main_contrast_title_hue, LV_PART_MAIN);
            lv_obj_set_style_outline_color(gyro_0_c.val_gyro_0_mag_x, main_contrast_value_hue, LV_PART_MAIN);
            lv_label_set_text(gyro_0_c.val_gyro_0_mag_x, String(gyroData.gyro_0_mag_x).c_str());
            lv_obj_set_style_text_color(gyro_0_c.val_gyro_0_mag_x, main_contrast_value_hue, LV_PART_MAIN);

            // ────────────────────────────────────────────────
            // Magnetometer Y
            // ────────────────────────────────────────────────
            lv_obj_set_style_text_color(gyro_0_c.lbl_gyro_0_mag_y, main_contrast_title_hue, LV_PART_MAIN);
            lv_obj_set_style_outline_color(gyro_0_c.val_gyro_0_mag_y, main_contrast_value_hue, LV_PART_MAIN);
            lv_label_set_text(gyro_0_c.val_gyro_0_mag_y, String(gyroData.gyro_0_mag_y).c_str());
            lv_obj_set_style_text_color(gyro_0_c.val_gyro_0_mag_y, main_contrast_value_hue, LV_PART_MAIN);

            // ────────────────────────────────────────────────
            // Magnetometer Z
            // ────────────────────────────────────────────────
            lv_obj_set_style_text_color(gyro_0_c.lbl_gyro_0_mag_z, main_contrast_title_hue, LV_PART_MAIN);
            lv_obj_set_style_outline_color(gyro_0_c.val_gyro_0_mag_z, main_contrast_value_hue, LV_PART_MAIN);
            lv_label_set_text(gyro_0_c.val_gyro_0_mag_z, String(gyroData.gyro_0_mag_z).c_str());
            lv_obj_set_style_text_color(gyro_0_c.val_gyro_0_mag_z, main_contrast_value_hue, LV_PART_MAIN);

            // ────────────────────────────────────────────────
            // Current UI Baud Rate
            // ────────────────────────────────────────────────
            lv_obj_set_style_text_color(gyro_0_c.lbl_gyro_0_current_uiBaud, main_contrast_title_hue, LV_PART_MAIN);
            lv_obj_set_style_outline_color(gyro_0_c.val_gyro_0_current_uiBaud, main_contrast_value_hue, LV_PART_MAIN);
            lv_label_set_text(gyro_0_c.val_gyro_0_current_uiBaud, String(gyroData.gyro_0_current_uiBaud).c_str());
            lv_obj_set_style_text_color(gyro_0_c.val_gyro_0_current_uiBaud, main_contrast_value_hue, LV_PART_MAIN);
        }
    }

    lv_timer_resume(display_timer);
}

void setColorsDefault()
{
    // Major
    main_bg_hue      = default_bg_hue;
    main_outline_hue = default_outline_hue;
    main_border_hue  = default_border_hue;
    main_shadow_hue  = default_shadow_hue;
    main_title_hue   = default_title_hue;
    main_value_hue   = default_value_hue;
    // Minor
    main_contrast_bg_hue      = default_contrast_bg_hue;
    main_contrast_outline_hue = default_contrast_outline_hue;
    main_contrast_border_hue  = default_contrast_border_hue;
    main_contrast_shadow_hue  = default_contrast_shadow_hue;
    main_contrast_title_hue   = default_contrast_title_hue;
    main_contrast_value_hue   = default_contrast_value_hue;
}

void setColorsCustom()
{
    // Major
    main_bg_hue      = custom_bg_hue;
    main_outline_hue = custom_outline_hue;
    main_border_hue  = custom_border_hue;
    main_shadow_hue  = custom_shadow_hue;
    main_title_hue   = custom_title_hue;
    main_value_hue   = custom_value_hue;
    // Minor
    main_contrast_bg_hue      = custom_contrast_bg_hue;
    main_contrast_outline_hue = custom_contrast_outline_hue;
    main_contrast_border_hue  = custom_contrast_border_hue;
    main_contrast_shadow_hue  = custom_contrast_shadow_hue;
    main_contrast_title_hue   = custom_contrast_title_hue;
    main_contrast_value_hue   = custom_contrast_value_hue;
}

void initSatIOUI() {
    // --------------------------------------------------------------
    // LVGL Initialization
    // --------------------------------------------------------------
    ESP_LOGI("LVGL", "Version: %d.%d.%d", LVGL_VERSION_MAJOR, LVGL_VERSION_MINOR, LVGL_VERSION_PATCH);

    delay(1000);
    
    // Initialize LVGL display object via BSP
    lv_display_t *disp = bsp_display_start();
    if (!disp) {ESP_LOGE("APP", "Failed to initialize display");}
    ESP_LOGI("APP", "Display initialized successfully");
    
    // Give BSP task time to fully initialize LVGL
    vTaskDelay(pdMS_TO_TICKS(1000));

    // Set LVGL tick period
    lv_timer_set_period(lv_timer_get_next(NULL), 50);  // ms

    // Set screens
    loading_screen = lv_obj_create(NULL);
    home_screen = lv_obj_create(NULL);
    matrix_screen = lv_obj_create(NULL);
    gps_screen = lv_obj_create(NULL);
    gyro_screen = lv_obj_create(NULL);
    display_screen = lv_obj_create(NULL);
    system_screen = lv_obj_create(NULL);
    uap_screen = lv_obj_create(NULL);
    
    // Initialize display brightness and backlight
    bsp_display_brightness_init();
    bsp_display_backlight_on();
    slider_brightness_value = 80;
    bsp_display_brightness_set(slider_brightness_value);

